
//=================================================================================================
array_name_sait = ["Творчество", "во всём!"];
predupregd = 'Сайт находится в разработке';
//=================================================================================================
array_menu = [["Главное", "Обучение", "Обсуждение", "Справка"],
["От создателя сайта", "Чего новенького", "Люди-умельцы", "Творческие работы", "Поиск по сайту", "История просмотра", "Регистрация"],
["Обучение от умельцев", "Творчество", "Программирование", "Алгебра и Геометрия", "Физика", "Химия", "Биология", "История", "География", "Обществознание", "Экономика", "Литература", "Языки стран мира", "Астрономия", "Черчение", "Музыка", "Физкультура", "Для дошколят", "Энциклопедии", "Заметки"],
["Беседы", "Предложения/критика", "Написать письмо"],
["Инструкция по сайту", "Донаты", "Об авторе сайта"]];
//=================================================================================================
array_razd_p = [[
    ['Приветствие', 'Особенности сайта', 'Содержимое сайта', 'Настройки сайта'],
    ['Все новости', 'Об умельцах','Об обучении', 'По выбранной категории'],
    ['Список с начала','Список с конца','Список по алфавиту','По скорости выполнения работ','Как стать участником нашей группы','Запись в группу "Люди-умельцы"'],
    ['Все изделия', 'Работы по категории творчества', 'Категории применяемости в быту', 'Выстовочные работы'],
    ['Искать везде', 'Только среди умельцев', 'Среди творческих работ', 'По названию статей и параграфов', 'По тексту'],
    ['Ваша история просмотра страниц','Уточнения по данному вопросу'],
    ['Зачем нужна регистрация','Что входит в регистрацию','Регистрация']
], [
    ['Обучающие уроки по мере поступления','Обучение от конкретного мастера','Обучение по категориям творчества','Обучающие схемы от умельцев','Особености данного обучения'],
    ['Все, освоенные мною, виды творчества', 'Необходимое для занятий', 'Термины', 'Рисунки, фото, схемы с расшифровкой','Особенности данного обучения','Используемая литература'],
    ['Всё, что я знаю из программирования', 'Основные понятия языка', 'Директивы, операторы, команды, теги', 'Примеры программ','Интересные факты', 'Выдающиеся личности', 'Задачи для самооценки', 'Вопросы для самопроверки', 'Используемая литература','Мои мысли о программировании'],
    ['Обучающий курс', 'Теоремы, определения, формулы', 'Графики, таблицы, рисунки', 'Интересные факты' ,'Выдающиеся личности', 'Задачи для самооценки', 'Вопросы для самопроверки', 'Используемая литература'],
    ['Обучающий курс', 'Теоремы, определения, формулы', 'Графики, таблицы, рисунки', 'Интересные факты', 'Выдающиеся личности', 'Задачи для самооценки', 'Лабораторные работы', 'Вопросы для самопроверки', 'Используемая литература'],
    ['Обучающий курс', 'Теоремы, определения, формулы', 'Графики, таблицы, рисунки', 'Вещества, их структура и особенности', 'Интересные факты', 'Выдающиеся личности', 'Задачи для самооценки', 'Лабораторные работы', 'Вопросы для самопроверки', 'Используемая литература'],
    ['Обучающий курс', 'Теоремы, определения, формулы', 'Графики, таблицы, рисунки', 'Вещества, их структура и особенности', 'Животные, птицы, пресноводные, насекомые', 'Растения, грибы', 'Интересные факты', 'Выдающиеся личности', 'Задачи для самооценки', 'Лабораторные работы', 'Вопросы для самопроверки', 'Используемая литература'], 
    ['Обучающий курс', 'Хронология важнейших событий', 'Политические и военные личности', 'Творческие и научные личности', 'Реформы, войны', 'Культура, быт, религия и обучение','Условные обозначения и сокращения', 'Карты', 'Вопросы для самопроверки', 'Используемая литература'],
    ['Обучающий курс', 'Определения, понятия', 'Графики, таблицы, рисунки', 'Обитатели', 'Растения', 'Полезные ископаемые', 'Интересные факты', 'Выдающиеся личности', 'Вопросы для самопроверки', 'Используемая литература'],
    ['Обучающий курс', 'Определения, понятия', 'Графики, таблицы, рисунки', 'Обитатели', 'Растения', 'Полезные ископаемые', 'Интересные факты', 'Выдающиеся личности', 'Вопросы для самопроверки', 'Используемая литература'],
    ['Обучающий курс', 'Определения, понятия, формулы', 'Графики, таблицы, рисунки', 'Денежные курсы', 'Интересные факты', 'Выдающиеся личности', 'Вопросы для самопроверки', 'Используемая литература'],
    ['Обучающий курс', 'Определения', 'Даты и события', 'Стихи и произведения классиков', 'Интересные факты', 'Выдающиеся личности', 'Вопросы для самопроверки', 'Используемая литература'],
    ['Обучающий курс', 'Алфавит, произношения буквосочетаний', 'Правила', 'Местоимения, глаголы, причастия', 'Словарь', 'Интересные факты', 'Выдающиеся личности', 'Вопросы для самопроверки', 'Используемая литература'],
    ['Обучающий курс', 'Теоремы, определения, формулы', 'Атлас неба', 'Планеты', 'Звезды', 'Интересные факты', 'Выдающиеся личности', 'Вопросы для самопроверки', 'Используемая литература'],
    ['Обучающий курс', 'Теоремы, определения, формулы', 'Образцы чертежей', 'Необходимое для черчения', 'Интересные факты', 'Выдающиеся личности', 'Вопросы для самопроверки', 'Используемая литература'],
    ['Обучающий курс', 'Определения', 'Правила держания рук', 'Правила чтение для нот', 'Мелодии классики и эстрады', 'Интересные факты', 'Выдающиеся личности', 'Вопросы для самопроверки', 'Используемая литература'],
    ['Основные правила зарядки', 'Зарядка', 'Правила для игр'],
    ['Обучающие игры для детей', 'Чтение вслух с картинками', 'Родителям на заметку'],
    ['Алфавитный указатель', 'По категориям', 'Толковый словарь'],
    ['Все заметки', 'Зачем нужны заметки']
], [
    ['Все беседы', 'Беседы по категориям', 'Ответы от автора сайта'],
    ['Предложения', 'Критика'],
    ['Бланк отправки']
], [
    ['Вся инструкция', 'Меню сайта', 'Содержимое раздела', 'Страница', 'Боковая панель с окнами', 'Смайлик'],
    ['Что такое донаты', 'Отчёт о полученных донатах'],
    ['Вся история', 'Детство и школа', 'Переломный момент', 'Карьерный взлёт']
]

];
array_text =
    [
        [//Главное
            [//От создателя сайта
                [//Приветствие
                    //Начальная страница
                    '<h2><b><i>Приветик всем, кто зашёл на мой сайт!</i></b></h2>' +
                    '<div id="avtor"class="izobr"><img src="IMG_20241119_042503.jpg"></img></div>'+
                    '<p>Он создавался для творческого развития и  бесплатного обучения пользователей. Здесь Вы несомненно найдёте много интересной и полезной для себя информации.</p>' +
                    '<p>В меню <b>"Главное"</b> создала разделы <b>"Люди-умельцы"</b> и <b>"Творческие работы"</b>. Уверена, что ознакомление с ними пробудит в Вас любовь к творчеству.</p>' +
                    '<p>Посещение страниц умельцев в этих разделах может привести к рождению орегинальных идей (по крайней мере, со мной это точно срабатывает). Здесь Вы сможете найти: </p><p><b><ul><li>различные аккаунты этих людей,</li><li>личные фотографии,</li><li>их работы,</li> <li>обучающие уроки,</li><li>различные, выложенные ими, схемы и рисунки.</li></ul></b></p>' +
                    '<p>Много нового узнаете от мастеров своего дела. Труды, маленькие хитрости и другая полезная информация ждут своего обывателя. Ещё предоставляется возможность: <p><b><ul><li>перейти по ссылкам в профиль умельцев,</li><li>заказать понравившиеся Вам вещи у самих авторов,</li> <li>лично обговорить их цену.</li></ul></b> </p> ' +
                    '<p>К тому же Вы сможете не только созирцать на творения других людей, но и публиковать свои детища. Для этого в разделе <b>"Люди-умельцы"</b> имеется подраздел <b>"Запись в группу "Люди-умельцы""</b>. От Вас требуется сделать хотя бы одну вещь своими руками и можете вступать в наш дружный коллектив. Но не забывайте, что вся информация от мастеров проходит через меня, и <b>рекламы</b>, не связанной с Вашими работами, <b>я публиковать не буду!</b></p>' +
                    '<p>Проверьте свои знания или научитесь чему-то новому в меню <b>"Обучение"</b>. Здесь находятся уроки от умельцев и материал, изученный мной с помощью книг и интернета. Вы должны знать, что я очень люблю учиться, несмотря на мой возраст. Хочу показать всем, что это не сложно, и знаниям все возросты покорны.</p>' +
                    '<p>Но у меня не совсем обычная структура повествования. Чтобы ознакомиться с ней более подробно обязательно загляните в подраздел <b>"Особенности сайта"</b>. В каждом разделе находится:<p><ul><li><b>поисковик</b>, для удобства пользователя,</li><li><b>разделение предмета на подгруппы</b> (если есть). Например, в разделе <b>"Программирование"</b> имеются сразу несколько, изученных мной, програмных языков и шифрование,</li><li><b>начальное содержание.</b></li></ul>'+
                    '<p>В тексте встречаються выделенные разным цветом участки:<ul><li><b>розовый</b> отводится названию скрываеммых пунктов содержания или списка,<li><b> салатовый</b> - поясненииям и расшифровки сокращений, </li><li><b>жёлтый</b> - интересным людям и фактам,</li><li><b>голубой</b> - ответам и пошаговым решениям.</li></ul>' +
                    '<p>Теоремы, законы, формуры и так далее, не изменялись. Остальная часть текста была перефразирована мной частично. Если кому-то непонраву, то прошу прощения. Я не мостак умно изъяснятся и не претендую на авторство, только пересказываю. В подразделе <b>"Используемая литература"</b> указаны названия прочитанных по теме мной книг, их авторы и статьи из интернета. Настоятельно рекомендую ознакомится с ними.</p>'+
                    '<p>Сама работаю с большим количеством информации, поэтому прошу меня также простить за:<p><ul><li><b>ошибки,</b></li><li><b>незавершённость тем по предметам,</b> которые напишу как появится на это время,</li><li><b>задержку при вступлении в группу новеньких,</b></li><li><b>замедление в выкладывании свежего материала от умельцев.</b></li></ul></p><p> Я не метеор, а простая женщина, поэтому всё не успеваю. Все изменения по сайту и его разделам будут отмечаться в меню <b>"Главное / Чего новенького"</b>.</p>' +
                    '<p>Если появятся вопросы, предложения или критика, то милости прошу в меню <b>"Обсуждение"</b>. Здесь Вы сможете побеседовать с другими пользователями или написать письмо лично мне. При наборе текста в разделе <b>"Беседы"</b>, пожалуйста, фильтруйте свою лексику, так как Ваше высказывание автоматически записывается в файл и не контролируется мной. Зато шифрование здесь тоже не используется, и Ваша запись легко проверяется правохранительными органами... <b>Поэтому не балуйтесь!!! /:(</b></p>' +
                    '<p>Отдельно хочу остановиться на моём помошнике <b>Смайлике</b>. Этот солнечный блинчик можно перетаскивать по браузеру, отпускать и смотреть что будет... А если пользователь задержится на сайте дольше часа, то... Впринципе... Оставлю без внимания, потому что Вы и сами можете это увидеть! Такая, своего рода, разгрузка для мозгов читателя. <b>;)</b></p>' +
                    '<p>Были описаны не все разделы меню. Если хотите получить более подробную информацию: <p><ul><li>о разделах меню, то перейдите в подраздел <b>"Содержимое сайта"</b>;</li><li>о работе сайта, то Вы можете зайти в меню <b>"Справка / Инструкция по сайту"</b>.</li></ul></p>' +
                    '<h2><b><i>Жилаю Вам приятного путешествия по страницам и, надеюсь, что мой труд окажется полезным для Вас!</i></b></h2>'
                    
                ],
                [//Особенности сайта
                    //Начальная страница
                    '<h2><b><i>Для более полезного использования сайта, ознакомтесь с данным текстом!</i></b></h2>' +
                    '<p>Здесь будут встречаться надписи, выделенные различным цветом. Что же означает этот окрас?</p>'+
                    '<p><span id="metka_0_1_0" class="metka">Салатовый цвет</span> указывает на то, что есть шпаргалка или коментарий для данной надписи. В книгах присутствует свои термины и сокращения, которые часто забываются читателем. Здесь же их значения можно подсмотреть, щёлкнув по данному тексту.</p>'+
                    '<p><span id="interes_0_1_0" class="interes">Жёлтым цветом</span> выделена надпись, содержащяя интересные факты, достижения или биографии не связаные напрямую с данной темой. Это полезно знать тем, кто хочет расширить свой кругозор и увеличить уровень знаний.</p>'+
                    '<p><span id="paragraf_0_1_0" class="paragraf">Розовым цветом</span> выделяются разделы и параграфы по данному предмету. Содержимое открывается при нажатии по этой надписи и отделяется от остального текста чёрными линиями в начале и в конце.</p>'+
                    '<p><span id="reshenie_0_1_0" class="reshenie">Голубым цветом</span> выделена надпись, приглашающая, открыть текст с ответами, подробным решением или поэтапным прохождением различных задач. Данное писание отделяется от другой информации синей рамкой. Это очень удобно, когда, после самостоятельного решения, хочется проверить свой ответ или ознакомиться с иными способами.</p>'+
                    '<p>Всплывающий текст исчезает после щелчка за его пределами. Это правило распространяется для всех вышеперечисленых выделенных надписей.</p>'+
                    '<p>Так же Вы сможете записать любую информацию с данного сайта в отдельный файл, если нажмёте на кнопку ... Эти данные будуд фиксироваться в окне слева под названием "Заметки". Содержимое данного окна в более развёрнутом виде можно увидеть, щёлкнув по его экрану или зайдя в меню "Обучение / Заметки". Когда захотите перенести эти записи к себе на компьютер воспользуйтесь кнопкой ...</p>'+
                    '<p>Если вам мешает сосредoточиться на изучении предмета "Содержание раздела", "Боковая панель" или мой помошник Смайлик, то можно их отодвинуть. Для смещения панели с окнами имеется кнопка ... при нажатии на которую окна прячутся в правой стороне браузера. При её повторном нажатии, панель снова появляется.</p>'+
                    '<p>Для смещения Смайлика нужно для начала щёлкнуть по палочке, на которой он находится. После появится кнопка смещения, нажав на которую отодвинете Смайлика за пределы левой стороны браузера. При её повторном нажатии мой помошник снова вернётся.</p>'+
                    '<p>Для смещения "Содержания раздела" нужно нажать на кнопку ..., но при этом автоматически уберутся и Смайлик, и "Боковая панель". Если понадобится их вернуть, нажмите на упомянутые выше кнопки. Востановить "Содержимое раздела" можно, нажав на кнопку.</p>'+
                    '<p>В меню "Главное / История просмотра" можно проследить свой путь или вернуться на один из разделов.</p>'+
                    '<p>Для более подробной информации зайдите в меню "Справка / Инструкция по сайту".</p>'
                    
                ],
                [//Содержимое сайта
                    //Начальная страница
                    '<p>Здесь содержится описание каждого пункта меню, с возможностью перехода в сами разделы, а так же ответы на волнующие меня вопросы.</p>'+
                    '<p><b><big>Меню сайта:</big></b></p>'+
                    '<ul><li><div id="tt_0_0_2_0" class="paragraf" onmousedown="on_tt_0_0_2(0)"onmouseover="on_paragraf(1,0,0,2,0)"onmouseout="on_paragraf(2,0,0,2,0)"><b>"Главное"</b> содержит разделы:</div>' +
                    '<div id = "tt_0_0_2_0_telo"></div></li></ul>'+
                    '<ul><li><div id="tt_0_0_2_1" class="paragraf" onmousedown="on_tt_0_0_2(1)" onmouseover="on_paragraf(1,0,0,2,1)" onmouseout="on_paragraf(2,0,0,2,1)"><b>"Обучение"</b> содержит разделы:</div>'+
                    '<div id="tt_0_0_2_1_telo"></div></li></ul>'+
                    '<ul><li><div id="tt_0_0_2_2" class="paragraf" onmousedown="on_tt_0_0_2(2)" onmouseover="on_paragraf(1,0,0,2,2)" onmouseout="on_paragraf(2,0,0,2,2)"><b>"Обсуждение"</b> содержит разделы:</div>'+
                    '<div id="tt_0_0_2_2_telo"></div></li></ul>'+
                    '<ul><li><div id="tt_0_0_2_3" class="paragraf" onmousedown="on_tt_0_0_2(3)" onmouseover="on_paragraf(1,0,0,2,3)" onmouseout="on_paragraf(2,0,0,2,3)"><b>"Справка"</b> содержит разделы:</div>'+
                    '<div id="tt_0_0_2_3_telo"></div></li></ul>'+
                    '<p><b>Ответы на некоторые вопросы:</b></p>' +
                    '<ul><li><div id="tt_0_0_2_4" class="paragraf" onmousedown="on_tt_0_0_2(4)" onmouseover="on_paragraf(1,0,0,2,4)" onmouseout="on_paragraf(2,0,0,2,4)">Почему сделала участие в группе Люди-умельцы бесплатным?</div>' +
                    '<div id="tt_0_0_2_4_telo"></div></li></ul>' +
                    '<ul><li><div id="tt_0_0_2_5" class="paragraf" onmousedown="on_tt_0_0_2(5)" onmouseover="on_paragraf(1,0,0,2,5)" onmouseout="on_paragraf(2,0,0,2,5)"> Почему заостила внимание в обучении на школьной программе?</div>' +
                        '<div id="tt_0_0_2_5_telo"></div></li></ul>'
                    ,
                    //1
                    '<span class="reshenie" onmousedown = "on_reshenie(4)">Перейти в раздел</span><p>Ещё не написан'    
                    ,
                    //2
                        '<span class="reshenie" onmousedown = "on_reshenie(4)">Перейти в раздел</span><p>Ещё не написан'
                    , '<span class="reshenie" onmousedown = "on_reshenie(4)">Перейти в раздел</span><p>Ещё не написан'      
                    , '<span class="reshenie" onmousedown = "on_reshenie(4)">Перейти в раздел</span><p>Ещё не написан'      
                    , '<span class="reshenie" onmousedown = "on_reshenie(4)">Перейти в раздел</span><p>Ещё не написан'      
                    , '<span class="reshenie" onmousedown = "on_reshenie(4)">Перейти в раздел</span><p>Ещё не написан'      
                    , '<span class="reshenie" onmousedown = "on_reshenie(4)">Перейти в раздел</span><p>Ещё не написан'      
                    , '<span class="reshenie" onmousedown = "on_reshenie(4)">Перейти в раздел</span><p>Ещё не написан'      
                    , '<span class="reshenie" onmousedown = "on_reshenie(4)">Перейти в раздел</span><p>Ещё не написан'      
                    , '<span class="reshenie" onmousedown = "on_reshenie(4)">Перейти в раздел</span><p>Ещё не написан'      
                    , '<span class="reshenie" onmousedown = "on_reshenie(4)">Перейти в раздел</span><p>Ещё не написан'      
                    , '<span class="reshenie" onmousedown = "on_reshenie(4)">Перейти в раздел</span><p>Ещё не написан'      
                    , '<span class="reshenie" onmousedown = "on_reshenie(4)">Перейти в раздел</span><p>Ещё не написан'      
                    , '<span class="reshenie" onmousedown = "on_reshenie(4)">Перейти в раздел</span><p>Ещё не написан'      
                    , '<span class="reshenie" onmousedown = "on_reshenie(4)">Перейти в раздел</span><p>Ещё не написан'      
                    , '<span class="reshenie" onmousedown = "on_reshenie(4)">Перейти в раздел</span><p>Ещё не написан'      
                    , '<span class="reshenie" onmousedown = "on_reshenie(4)">Перейти в раздел</span><p>Ещё не написан'      
                    , '<span class="reshenie" onmousedown = "on_reshenie(4)">Перейти в раздел</span><p>Ещё не написан'      
                    , '<span class="reshenie" onmousedown = "on_reshenie(4)">Перейти в раздел</span><p>Ещё не написан'      
                    , '<span class="reshenie" onmousedown = "on_reshenie(4)">Перейти в раздел</span><p>Ещё не написан'      
                    , '<span class="reshenie" onmousedown = "on_reshenie(4)">Перейти в раздел</span><p>Ещё не написан'      
                    , '<span class="reshenie" onmousedown = "on_reshenie(4)">Перейти в раздел</span><p>Ещё не написан'      
                    , '<span class="reshenie" onmousedown = "on_reshenie(4)">Перейти в раздел</span><p>Ещё не написан'      
                    , '<span class="reshenie" onmousedown = "on_reshenie(4)">Перейти в раздел</span><p>Ещё не написан'      
                    , '<span class="reshenie" onmousedown = "on_reshenie(4)">Перейти в раздел</span><p>Ещё не написан'      
                    , '<span class="reshenie" onmousedown = "on_reshenie(4)">Перейти в раздел</span><p>Ещё не написан'      
                    , '<span class="reshenie" onmousedown = "on_reshenie(4)">Перейти в раздел</span><p>Ещё не написан'      
                    , '<span class="reshenie" onmousedown = "on_reshenie(4)">Перейти в раздел</span><p>Ещё не написан'      
                    , '<span class="reshenie" onmousedown = "on_reshenie(4)">Перейти в раздел</span><p>Ещё не написан'      
                    , '<span class="reshenie" onmousedown = "on_reshenie(4)">Перейти в раздел</span><p>Ещё не написан'      
                    , '<span class="reshenie" onmousedown = "on_reshenie(4)">Перейти в раздел</span><p>Ещё не написан'      
                    , '<span class="reshenie" onmousedown = "on_reshenie(4)">Перейти в раздел</span><p>Ещё не написан'      
                    , '<span class="reshenie" onmousedown = "on_reshenie(4)">Перейти в раздел</span><p>Ещё не написан'      
                    , '<span class="reshenie" onmousedown = "on_reshenie(4)">Перейти в раздел</span><p>Ещё не написан'      
                    , '<span class="reshenie" onmousedown = "on_reshenie(4)">Перейти в раздел</span><p>Ещё не написан'      
                    , '<span class="reshenie" onmousedown = "on_reshenie(4)">Перейти в раздел</span><p>Ещё не написан'      
                    , '<span class="reshenie" onmousedown = "on_reshenie(4)">Перейти в раздел</span><p>Ещё не написан'      
                    , '<span class="reshenie" onmousedown = "on_reshenie(4)">Перейти в раздел</span><p>Ещё не написан'      
                    , '<span class="reshenie" onmousedown = "on_reshenie(4)">Перейти в раздел</span><p>Ещё не написан'      
                    , 'Ещё не написан'      
                    , 'Ещё не написан'      

                ],
                [//Настройки сайта
                    '<p>Позволяет изменить окраску или дизайн сайта, положение Смайлика или панелей. Для этого нажмите на нужный Вам раздел и выберите один из представленных вариантов.</p>' +
                    '<div id="tt_0_0_3_0"class= "paragraf" onmousedown="on_tt_0_0_3(0)"onmouseover="on_paragraf(1,0,0,3,0)"onmouseout="on_paragraf(2,0,0,3,0)"style="text-align:center"> Определить сторону размещения Смайлика и его скрытость</div><p>' +
                    '<div id="tt_0_0_3_1"class= "paragraf" onmousedown="on_tt_0_0_3(1)"onmouseover="on_paragraf(1,0,0,3,1)"onmouseout="on_paragraf(2,0,0,3,1)"style="text-align:center"> Указать начальное положение панели "Содержимое раздела"</div><p>' +
                    '<div id="tt_0_0_3_2"class= "paragraf" onmousedown="on_tt_0_0_3(2)"onmouseover="on_paragraf(1,0,0,3,2)"onmouseout="on_paragraf(2,0,0,3,2)"style="text-align:center"> Определить положение панели "Окна" и значение её выдвижения</div><p>' +
                    '<div id="tt_0_0_3_3"class= "paragraf" onmousedown="on_tt_0_0_3(3)"onmouseover="on_paragraf(1,0,0,3,3)"onmouseout="on_paragraf(2,0,0,3,3)"style="text-align:center"> Сменить дизайн сайта</div><p>' +
                    '<div id="tt_0_0_3_4"class= "paragraf" onmousedown="on_tt_0_0_3(4)"onmouseover="on_paragraf(1,0,0,3,4)"onmouseout="on_paragraf(2,0,0,3,4)"style="text-align:center"> Указать цветовую гамму сайта</div><p>'
                  
                    
                ]
            ],
            [//Чего новенького
                [//Все новости
                    '<p>Новости идут в свёрнутом виде. Показан только загаловок и дата. Если захотите прочитать всю статью, то нажмите на интересующую Вас новость. Так же Вы сможите перейти в то место на сайте, о котором расказывается.</p>' +
                    '<div id="new_0" class="new_sait"><table width="90%"><tr width="80%"><td>Название новости</td><td>Дата и время</td></tr><tr><td colspan="2">Новость, которую хотят видеть пользователи.</td></tr></table></div>'
                ],
                [//Об умельцах
                    '<p>Здесь представлены новости, касающиеся только умельцев. А именно: вхождение их в нашу группу, новые работы, планы на будущее и обучающие уроки.</p>'
                ],
                [//Об обучении
                    '<p>Новости касающиеся обучения, в том числе от умельцев, с возможностью посмотреть на данные разделы и параграфы.</p>'
                ],
                [//По выбранной категории
                    '<p>Выберите из списка нужную категорию, по которой Вы хотели бы увидеть новости:</p>' +

                    '<ul><li><div id="tt_0_1_3_0"class="paragraf" onmousedown="on_tt_0_1_3(0)"onmouseover="on_paragraf(1,0,1,3,0)"onmouseout="on_paragraf(2,0,1,3,0)">"Люди-умельцы"</div></li><p>' +
                    '<li><div id="tt_0_1_3_1" class="paragraf" onmousedown="on_tt_0_1_3(1)" onmouseover="on_paragraf(1,0,1,3,1)" onmouseout="on_paragraf(2,0,1,3,1)">Обучение</div></li><p>'+
                    '<li><div id="tt_0_1_3_2"class="paragraf" onmousedown="on_tt_0_1_3(2)"onmouseover="on_paragraf(1,0,1,3,2)"onmouseout="on_paragraf(2,0,1,3,2)">Ответы на предложения</div></li></ul>'
                ]
            ],
            [//Люди-умельцы
                [//Список с начала
                    '<div class="metka"><table><tr><td><div id="lud_1"class="izobr"></div></td><td><div id="lud_1_name"><big><b>Ильина(Ковалёва) Людмила.</b></big></div> Создатель данного сайта, программист, вязальщица, рукодельница, художник.</td></tr></table></div><p>' +
                    '<div class="metka"><table><tr><td><div id="lud_1"class="izobr"></div></td><td><big><b>Ильина(Ковалёва) Людмила.</b></big> Создатель данного сайта, программист, рукодельница, художник.</td></tr></table></div><p>' +
                    '<div class="metka"><table><tr><td><div id="lud_1"class="izobr"></div></td><td><big><b>Ильина(Ковалёва) Людмила.</b></big> Создатель данного сайта, программист, рукодельница, художник.</td></tr></table></div><p>' 
                ],
                [//Список с конца
                    
                ],
                [//Список по алфавиту
                    
                ],
                [//По скорости выполнения работ
                    
                ],
                [//Как стать участником нашей группы
                    '<p>Если Вы хотите стать участником группы "Люди-умельцы", то Вы должны сделать хотя бы две вещи своими руками, отвечающие заявленной Вами специализации. Например, художник - фотографии написанных им картин, вязальщица - сделанные вещи и так далее.</p>' +
                    '<p>Зарегистрироваться в группе "Люди-умельцы", указав свой ник или Фамелию, Имя, Отчество (по желанию), адрес электронной почты, через которую я смогу связаться с Вами.</p>' +
                    '<p>Проверять адрес не буду. Если он окажется фейком, то я просто не внесу Вас в группу. </p>'+'<p>Не забудте написать ссылки на аккаунты, в которых можно будет ознакомиться с Вашим творчеством. </p>' +
                    '<p>Так же должна проинформировать Вас, что на сайт могут проникнуть хакеры, поэтому будте бдительны и заведите отдельный адрес электронной почты, по которому мы будем общаться!</p>' +
                    '<p>Скорость ответа на Ваш запрос будет медленной, потому как я не метиор, проверяю заявки только раз в сутки. Прошу меня понять и простить. </p>'
                ],
                [//Запись в группу "Люди-умельцы"
                    '<div id="imy"class="new_sait">Ник или Фамелию, Имя, Отчество (по желанию)</div>'

                ],
                [
                    
                ]
            ],
            [//Творческие работы
                [//Все изделия

                ],
                [//Работы по категории творчества
                    '<p>Многие из представленных работ находяться сразу в нескольких категориях. Выберите нужный Вам вид творчества: <p>'+
                    '<ul><li><div id="tt_0_3_1_0"class="paragraf"onmousedown="on_tt_0_3_1(0)"onmouseover="on_paragraf(1,0,3,1,0)"onmouseout="on_paragraf(2,0,3,1,0)">Рисование</div></li><p>' +
                    '<li><div id="tt_0_3_1_1"class="paragraf"onmousedown="on_tt_0_3_1(1)"onmouseover="on_paragraf(1,0,3,1,1)"onmouseout="on_paragraf(2,0,3,1,1)">Лепка скульптур</div></li><p>' +
                    '<li><div id="tt_0_3_1_2"class="paragraf"onmousedown="on_tt_0_3_1(2)"onmouseover="on_paragraf(1,0,3,1,2)"onmouseout="on_paragraf(2,0,3,1,2)">Резьба по дереву</div></li><p>' +
                    '<li><div id="tt_0_3_1_3"class="paragraf"onmousedown="on_tt_0_3_1(3)"onmouseover="on_paragraf(1,0,3,1,3)"onmouseout="on_paragraf(2,0,3,1,3)">Вязание</div></li><p>' +
                    '<li><div id="tt_0_3_1_4"class="paragraf"onmousedown="on_tt_0_3_1(4)"onmouseover="on_paragraf(1,0,3,1,4)"onmouseout="on_paragraf(2,0,3,1,4)">Шитьё</div></li><p>' +
                    '<li><div id="tt_0_3_1_1"class="paragraf"onmousedown="on_tt_0_3_1(1)"onmouseover="on_paragraf(1,0,3,1,1)"onmouseout="on_paragraf(2,0,3,1,1)">Плетение из бисера</div></li><p>' +
                    '<li><div id="tt_0_3_1_5"class="paragraf"onmousedown="on_tt_0_3_1(5)"onmouseover="on_paragraf(1,0,3,1,5)"onmouseout="on_paragraf(2,0,3,1,5)">Музыка</div></li><p>' +
                    '<li><div id="tt_0_3_1_6"class="paragraf"onmousedown="on_tt_0_3_1(6)"onmouseover="on_paragraf(1,0,3,1,6)"onmouseout="on_paragraf(2,0,3,1,6)">Литература</div></li><p>' +
                    '<li><div id="tt_0_3_1_7"class="paragraf"onmousedown="on_tt_0_3_1(7)"onmouseover="on_paragraf(1,0,3,1,7)"onmouseout="on_paragraf(2,0,3,1,7)">Программирование</div></li><p>' +
                    '<li><div id="tt_0_3_1_8"class="paragraf"onmousedown="on_tt_0_3_1(8)"onmouseover="on_paragraf(1,0,3,1,8)"onmouseout="on_paragraf(2,0,3,1,8)">Электроника</div></li><p>' +
                    '</ul>'
                ],
                [//Категории применяемости в быту
                    '<p>Многие из представленных работ находяться сразу в нескольких категориях. Выберите нужный Вам пункт:<p>'+
                    '<ul><li><div id="tt_0_3_2_0"class="paragraf"onmousedown="on_tt_0_3_2(0)"onmouseover="on_paragraf(1,0,3,2,0)"onmouseout="on_paragraf(2,0,3,2,0)">Дизайн интеръера</div></li><p>' +
                    '<li><div id="tt_0_3_2_1"class="paragraf"onmousedown="on_tt_0_3_2(1)"onmouseover="on_paragraf(1,0,3,2,1)"onmouseout="on_paragraf(2,0,3,2,1)">Ковры и дорожки</div></li><p>' +
                    '<li><div id="tt_0_3_2_2"class="paragraf"onmousedown="on_tt_0_3_2(2)"onmouseover="on_paragraf(1,0,3,2,2)"onmouseout="on_paragraf(2,0,3,2,2)">Покрывала и седушки</div></li><p>' +
                    '<li><div id="tt_0_3_2_3"class="paragraf"onmousedown="on_tt_0_3_2(3)"onmouseover="on_paragraf(1,0,3,2,3)"onmouseout="on_paragraf(2,0,3,2,3)">Кухонная утварь</div></li><p>' +
                    '<li><div id="tt_0_3_2_4"class="paragraf"onmousedown="on_tt_0_3_2(4)"onmouseover="on_paragraf(1,0,3,2,4)"onmouseout="on_paragraf(2,0,3,2,4)">Мебель</div></li><p>' +
                    '<li><div id="tt_0_3_2_5"class="paragraf"onmousedown="on_tt_0_3_2(5)"onmouseover="on_paragraf(1,0,3,2,5)"onmouseout="on_paragraf(2,0,3,2,5)">Картины</div></li><p>' +
                    '<li><div id="tt_0_3_2_6"class="paragraf"onmousedown="on_tt_0_3_2(6)"onmouseover="on_paragraf(1,0,3,2,6)"onmouseout="on_paragraf(2,0,3,2,6)">Скульптуры</div></li><p>' +
                    '<li><div id="tt_0_3_2_7"class="paragraf"onmousedown="on_tt_0_3_2(7)"onmouseover="on_paragraf(1,0,3,2,7)"onmouseout="on_paragraf(2,0,3,2,7)">Часы</div></li><p>' +
                    '<li><div id="tt_0_3_2_8"class="paragraf"onmousedown="on_tt_0_3_2(8)"onmouseover="on_paragraf(1,0,3,2,8)"onmouseout="on_paragraf(2,0,3,2,8)">Светильники</div></li><p>' +
                    '<li><div id="tt_0_3_2_9"class="paragraf"onmousedown="on_tt_0_3_2(9)"onmouseover="on_paragraf(1,0,3,2,9)"onmouseout="on_paragraf(2,0,3,2,9)">Горшки и коробы</div></li><p>' +
                    '<li><div id="tt_0_3_2_10"class="paragraf"onmousedown="on_tt_0_3_2(10)"onmouseover="on_paragraf(1,0,3,2,10)"onmouseout="on_paragraf(2,0,3,2,10)">Бижутерии</div></li><p>' +
                    '<li><div id="tt_0_3_2_11"class="paragraf"onmousedown="on_tt_0_3_2(11)"onmouseover="on_paragraf(1,0,3,2,11)"onmouseout="on_paragraf(2,0,3,2,11)">Одежда</div></li><p>' +
                    '<li><div id="tt_0_3_2_12"class="paragraf"onmousedown="on_tt_0_3_2(12)"onmouseover="on_paragraf(1,0,3,2,12)"onmouseout="on_paragraf(2,0,3,2,12)">Обувь</div></li><p>' +
                    '<li><div id="tt_0_3_2_13"class="paragraf"onmousedown="on_tt_0_3_2(13)"onmouseover="on_paragraf(1,0,3,2,13)"onmouseout="on_paragraf(2,0,3,2,13)">Мягкие игрушки</div></li><p>' +
                    '<li><div id="tt_0_3_2_14"class="paragraf"onmousedown="on_tt_0_3_2(14)"onmouseover="on_paragraf(1,0,3,2,14)"onmouseout="on_paragraf(2,0,3,2,14)">Поделки</div></li><p>' +
                    '<li><div id="tt_0_3_2_15"class="paragraf"onmousedown="on_tt_0_3_2(15)"onmouseover="on_paragraf(1,0,3,2,15)"onmouseout="on_paragraf(2,0,3,2,15)">Книги</div></li><p>' +
                    '<li><div id="tt_0_3_2_16"class="paragraf"onmousedown="on_tt_0_3_2(16)"onmouseover="on_paragraf(1,0,3,2,16)"onmouseout="on_paragraf(2,0,3,2,16)">Для сада и огорода</div></li><p>' +
                    '<li><div id="tt_0_3_2_17"class="paragraf"onmousedown="on_tt_0_3_2(17)"onmouseover="on_paragraf(1,0,3,2,17)"onmouseout="on_paragraf(2,0,3,2,17)">Электронные приборы</div></li><p>' +
                    '<li><div id="tt_0_3_2_18"class="paragraf"onmousedown="on_tt_0_3_2(18)"onmouseover="on_paragraf(1,0,3,2,18)"onmouseout="on_paragraf(2,0,3,2,18)">Компьютерные программы</div></li><p>' +
                    '</ul>'
                ],
                [//Выстовочные работы
                ],
            ],
            [//Поиск по сайту
                [//Искать везде
                    '<p>Поисковик не обращает внимание на заглавные буквы и читает их как прописные<p>Введите искомый текст:<p> ' +
                    'Искать<p>' +
                    'Результаты поиска с возможностью перейти в данный раздел:<p>'
                ],
                [//Только среди умельцев
                    '<p>Поисковик ищет только среди умельцев!<p>'
                ],
                [//Среди творческих работ
                    '<p>Поисковик ищет только среди представленных здесь работ умельцев и их описании!<p>'
                ],
                [//По названию статей и параграфов
                    '<p>Поисковик ищет только среди оглавлений и параграфов!<p>'
                ],
                [//По тексту
                    '<p>Поисковик ищет только лишь по тексту статей!<p>'
                ],
            ],
            [//История просмотра
                [//Ваша история просмотра страниц

                ],
                [//Уточнения по данному вопросу
                    '<p>Представленный здесь путь Вашего следования будет доступен только Вам. После обнавления сайта или нажатия на кнопку "Обнулить" путь сотрётся и будет записываться с чистого листа.<p> ' +
                    'В пункте "Ваша история просмотра страниц" содержаться все Ваши перемещения по сайту с датой и временем захождения и выхода в разделы. Вы можете перейти в указанный раздел снова, нажав на данную надпись.'
                ]
            ],
            [//Регистрация
                [//Зачем нужна регистрация
                    '<p>Я не сторонник слежки за своими пользователями и не люблю когда принуждают к регистрации на некоторых сайтах. <p>Данная регистрация нужна Вам, если хотите получать новости об изменениях на сайте, или по определённым разделам.'
                ],
                [//Что входит в регистрацию
                    '<p>Для регистрации будет запрашиваться:<p><ul>' +
                    '<li>Ваш ник или Фамелия, Имя, отчество</li><p>' +
                    '<li>Адрес электронной почты.</li><p>Проверять на подленность данного адреса не буду. Вы просто не будете получать новости, если окажется фейковая почта.<p>' +
                    '<li>Будет предоставлен выбор между новостями по всему сайту или только определённым разделам</li><p>' +
                    '<li>Если вы выберете второй пункт, то откроется список интересующих Вас разделов. Вы сможете назначить сразу несколько категорий из представленных.</li><p>' +
                    '</ul>'
                ],
                [//Регистрация
                    '<p>Для получения новостей лучше завести отдельно новый адрес электронной почты для своей же безопасности. '
                ]
            ]
        ],
        [//Обучение
            [//Обучение от умельцев
                [//Обучающие уроки по мере поступления
                    '<p>Здесь видны толь загаловок с кратким описанием и автор. Если захотите увидеть полностью занятие, то нажмите на его оглавление.<p> ' +
                    '<div class="metka"><table><tr><td> <big><b>Заголовок занятия</b></big> <p>Краткое описание урока с указанием его направления в творчестве</td><td align="center"width="30%"><div id="lud_1"class="izobr"></div><div id="lud_1_name"><big><b>Ильина(Ковалёва) Людмила.</b></big></div></td></tr></table></div><p>' +
                    '<div class="metka"><table><tr><td> <big><b>Заголовок занятия</b></big> <p>Краткое описание урока с указанием его направления в творчестве</td><td><div id="lud_1"class="izobr"></div><div id="lud_1_name"><big><b>Ильина(Ковалёва) Людмила.</b></big></div></td></tr></table></div><p>' +
                    '<div class="metka"><table><tr><td> <big><b>Заголовок занятия</b></big> <p>Краткое описание урока с указанием его направления в творчестве</td><td><div id="lud_1"class="izobr"></div><div id="lud_1_name"><big><b>Ильина(Ковалёва) Людмила.</b></big></div></td></tr></table></div><p>' +
                    '<div class="metka"><table><tr><td> <big><b>Заголовок занятия</b></big> <p>Краткое описание урока с указанием его направления в творчестве</td><td><div id="lud_1"class="izobr"></div><div id="lud_1_name"><big><b>Ильина(Ковалёва) Людмила.</b></big></div></td></tr></table></div><p>' +
                    '<div class="metka"><table><tr><td> <big><b>Заголовок занятия</b></big> <p>Краткое описание урока с указанием его направления в творчестве</td><td><div id="lud_1"class="izobr"></div><div id="lud_1_name"><big><b>Ильина(Ковалёва) Людмила.</b></big></div></td></tr></table></div><p>'
                ],
                [//Обучение от конкретного мастера
'<p>Выберите нужного Вам мастера:<p>'+
                    '<div class="metka"><table><tr><td align="center"width="30%"><div id="lud_1"class="izobr"></div><div id="lud_1_name"><big><b>Ильина(Ковалёва) Людмила.</b></big></div></td><td> Перечисления направления занятий.</td></tr></table></div><p>' +
                    '<div class="metka"><table><tr><td><div id="lud_1"class="izobr"></div><div id="lud_1_name"><big><b>Ильина(Ковалёва) Людмила.</b></big></div></td><td> Перечисления направления занятий.</td></tr></table></div><p>' 
                ],
                [//Обучение по категориям творчества
                    '<p>Выберите категорию творчества, по которой Вы хотели бы получить обучение от наших умельцев:<p>' +
                    '<ul><li><div id="tt_0_3_1_0"class="paragraf"onmousedown="on_tt_0_3_1(0)"onmouseover="on_paragraf(1,0,3,1,0)"onmouseout="on_paragraf(2,0,3,1,0)">Рисование</div></li><p>' +
                    '<li><div id="tt_0_3_1_1"class="paragraf"onmousedown="on_tt_0_3_1(1)"onmouseover="on_paragraf(1,0,3,1,1)"onmouseout="on_paragraf(2,0,3,1,1)">Лепка скульптур</div></li><p>' +
                    '<li><div id="tt_0_3_1_2"class="paragraf"onmousedown="on_tt_0_3_1(2)"onmouseover="on_paragraf(1,0,3,1,2)"onmouseout="on_paragraf(2,0,3,1,2)">Резьба по дереву</div></li><p>' +
                    '<li><div id="tt_0_3_1_3"class="paragraf"onmousedown="on_tt_0_3_1(3)"onmouseover="on_paragraf(1,0,3,1,3)"onmouseout="on_paragraf(2,0,3,1,3)">Вязание</div></li><p>' +
                    '<li><div id="tt_0_3_1_4"class="paragraf"onmousedown="on_tt_0_3_1(4)"onmouseover="on_paragraf(1,0,3,1,4)"onmouseout="on_paragraf(2,0,3,1,4)">Шитьё</div></li><p>' +
                    '<li><div id="tt_0_3_1_1"class="paragraf"onmousedown="on_tt_0_3_1(1)"onmouseover="on_paragraf(1,0,3,1,1)"onmouseout="on_paragraf(2,0,3,1,1)">Плетение из бисера</div></li><p>' +
                    '<li><div id="tt_0_3_1_5"class="paragraf"onmousedown="on_tt_0_3_1(5)"onmouseover="on_paragraf(1,0,3,1,5)"onmouseout="on_paragraf(2,0,3,1,5)">Музыка</div></li><p>' +
                    '<li><div id="tt_0_3_1_6"class="paragraf"onmousedown="on_tt_0_3_1(6)"onmouseover="on_paragraf(1,0,3,1,6)"onmouseout="on_paragraf(2,0,3,1,6)">Литература</div></li><p>' +
                    '<li><div id="tt_0_3_1_7"class="paragraf"onmousedown="on_tt_0_3_1(7)"onmouseover="on_paragraf(1,0,3,1,7)"onmouseout="on_paragraf(2,0,3,1,7)">Программирование</div></li><p>' +
                    '<li><div id="tt_0_3_1_8"class="paragraf"onmousedown="on_tt_0_3_1(8)"onmouseover="on_paragraf(1,0,3,1,8)"onmouseout="on_paragraf(2,0,3,1,8)">Электроника</div></li><p>' +
                    '</ul>'
                ],
                [//Обучающие схемы от умельцев
                    '<p>Схемы могут совпадать или принадлежать другим, неисзестным, авторам. Вы должны понимать, что всё попавшее в Internet становится достоянием общества. Здесь указывается человек, который выложил материал, для общего обозрения<p>' +
                    '<div class="metka"><table><tr><td align="center"width="30%"><div id="lud_1"class="izobr"></div><div id="lud_1_name"><big><b>Ильина(Ковалёва) Людмила.</b></big></div></td><td> Перечисления направления занятий.</td></tr></table></div><p>'
                ],
                [//Особенности данного обучения
                    '<p> '
                ],
            ],
            [//Творчество
                [//Все, освоенные мною, виды 
                    '<p>Я собрала здесь все, освоенные мною, виды творчества, не включая программирования и электроники. Выберите подходящий Вам раздел:<p>' +
                    '<ul><li><div id="tt_0_3_1_0"class="paragraf"onmousedown="on_tt_0_3_1(0)"onmouseover="on_paragraf(1,0,3,1,0)"onmouseout="on_paragraf(2,0,3,1,0)">Рисование</div></li><p>' +
                    '<li><div id="tt_0_3_1_1"class="paragraf"onmousedown="on_tt_0_3_1(1)"onmouseover="on_paragraf(1,0,3,1,1)"onmouseout="on_paragraf(2,0,3,1,1)">Лепка из глины</div></li><p>' +
                    '<li><div id="tt_0_3_1_4"class="paragraf"onmousedown="on_tt_0_3_1(4)"onmouseover="on_paragraf(1,0,3,1,4)"onmouseout="on_paragraf(2,0,3,1,4)">Лепка из Папье-маше</div></li><p>' +
                    '<li><div id="tt_0_3_1_4"class="paragraf"onmousedown="on_tt_0_3_1(4)"onmouseover="on_paragraf(1,0,3,1,4)"onmouseout="on_paragraf(2,0,3,1,4)">Плетение из лозы</div></li><p>' +
                    '<li><div id="tt_0_3_1_2"class="paragraf"onmousedown="on_tt_0_3_1(2)"onmouseover="on_paragraf(1,0,3,1,2)"onmouseout="on_paragraf(2,0,3,1,2)">Резьба по дереву</div></li><p>' +
                    '<li><div id="tt_0_3_1_3"class="paragraf"onmousedown="on_tt_0_3_1(3)"onmouseover="on_paragraf(1,0,3,1,3)"onmouseout="on_paragraf(2,0,3,1,3)">Вязание крючком</div></li><p>' +
                    '<li><div id="tt_0_3_1_3"class="paragraf"onmousedown="on_tt_0_3_1(3)"onmouseover="on_paragraf(1,0,3,1,3)"onmouseout="on_paragraf(2,0,3,1,3)">Вязание спицами</div></li><p>' +
                    '<li><div id="tt_0_3_1_3"class="paragraf"onmousedown="on_tt_0_3_1(3)"onmouseover="on_paragraf(1,0,3,1,3)"onmouseout="on_paragraf(2,0,3,1,3)">Фриволите</div></li><p>' +
                    '<li><div id="tt_0_3_1_3"class="paragraf"onmousedown="on_tt_0_3_1(3)"onmouseover="on_paragraf(1,0,3,1,3)"onmouseout="on_paragraf(2,0,3,1,3)">Бисироплитение</div></li><p>' +
                    '<li><div id="tt_0_3_1_3"class="paragraf"onmousedown="on_tt_0_3_1(3)"onmouseover="on_paragraf(1,0,3,1,3)"onmouseout="on_paragraf(2,0,3,1,3)">Воляние из шерсти</div></li><p>' +
                    '<li><div id="tt_0_3_1_3"class="paragraf"onmousedown="on_tt_0_3_1(3)"onmouseover="on_paragraf(1,0,3,1,3)"onmouseout="on_paragraf(2,0,3,1,3)">Вышивка</div></li><p>' +
                    '<li><div id="tt_0_3_1_4"class="paragraf"onmousedown="on_tt_0_3_1(4)"onmouseover="on_paragraf(1,0,3,1,4)"onmouseout="on_paragraf(2,0,3,1,4)">Шитьё</div></li><p>' +
                    '</ul>'+
                    

                    
                    '<p>Многие виды творчества изучались мною по книгам, приведенным в подразделе "Используемая литература". Я заказывала большинство из них на "Ozon"'
                ],
                [//Необходимое для занятий
                ],
                [//Термины
                ],
                [//Рисунки, фото, схемы с расшифровкой
                ],
                [//Особенности данного обучения
                ],
                [//Используемая литература
                ],
            ],
            [//Программирование
                [//Всё, что я знаю из программирования

                ],
                [//Основные понятия языка
                ],
                [//Директивы, операторы, команды, теги
                ],
                [//Примеры программ
                ],
                [//Интересные факты
                ],
                [//Выдающиеся личности
                ],
                [//Задачи для самооценки
                ],
                [//Вопросы для самопроверки
                ],
                [//Используемая литература
                ],
                [//Мои мысли о программировании
                ],
            ],
            [//Алгебра и Геометрия
                [//Обучающий курс
                ],
                [//Теоремы, определения, формулы 
                ],
                [//Графики, таблицы, рисунки
                ],
                [//Интересные факты
                ],
                [//Выдающиеся личности
                ],
                [//Задачи для самооценки
                ],
                [//Вопросы для самопроверки
                ],
                [//Используемая литература
                ],
            ],
            [//Физика
                [//Обучающий курс
                ],
                [//Теоремы, определения, формулы
                ],
                [//Графики, таблицы, рисунки
                ],
                [//Интересные факты
                ],
                [//Выдающиеся личности
                ],
                [//Задачи для самооценки
                ],
                [//Лабораторные работы
                ],
                [//Вопросы для самопроверки
                ],
                [//Используемая литература
                ],
            ],
            [//Химия
                [//Обучающий курс
                ],
                [//Теоремы, определения, формулы
                ],
                [//Графики, таблицы, рисунки
                ],
                [//Вещества, их структура и особенности
                ],
                [//Интересные факты
                ],
                [//Выдающиеся личности
                ],
                [//Задачи для самооценки
                ],
                [//Лабораторные работы
                ],
                [//Вопросы для самопроверки
                ],
                [//Используемая литература
                ],
            ],
            [//Биология
                [//Обучающий курс
                ],
                [//Теоремы, определения, формулы
                ],
                [//Графики, таблицы, рисунки
                ],
                [//Вещества, их структура и особенности
                ],
                [//Животные, птицы, пресноводные, насекомые
                ],
                [//Растения, грибы
                ],
                [//Интересные факты
                ],
                [//Выдающиеся личности
                ],
                [//Задачи для самооценки
                ],
                [//Лабораторные работы
                ],
                [//Вопросы для самопроверки
                ],
                [//Используемая литература
                ],
            ],
            [//История
                [//Обучающий курс
                ],
                [//Хронология важнейших событий
                ],
                [//Политические и военные личности
                ],
                [//Творческие и научные личности
                ],
                [//Реформы, войны
                ],
                [//Культура, быт, религия и обучение
                ],
                [//Условные обозначения и сокращения
                ],
                [//Карты
                ],
                [//Вопросы для самопроверки
                ],
                [//Используемая литература
                ],
            ],
            [//География
                [//Обучающий курс
                ],
                [//Определения, понятия
                ],
                [//Графики, таблицы, рисунки
                ],
                [//Обитатели
                ],
                [//Растения
                ],
                [//Полезные ископаемые
                ],
                [//Интересные факты
                ],
                [//Выдающиеся личности
                ],
                [//Вопросы для самопроверки
                ],
                [//Используемая литература
                ],
            ],
            [//Обществознание
                [//Обучающий курс
                ],
                [//Определения, понятия
                ],
                [//Графики, таблицы, рисунки
                ],
                [//Обитатели
                ],
                [//Растения
                ],
                [//Полезные ископаемые
                ],
                [//Интересные факты
                ],
                [//Выдающиеся личности
                ],
                [//Вопросы для самопроверки
                ],
                [//Используемая литература
                ],
            ],
            [//Экономика
                [//Обучающий курс
                ],
                [//Определения, понятия, формулы
                ],
                [//Графики, таблицы, рисунки
                ],
                [//Денежные курсы
                ],
                [//Интересные факты
                ],
                [//Выдающиеся личности  
                ],
                [//Вопросы для самопроверки
                ],
                [//Используемая литература
                ],
            ],
            [//Литература
                [//Обучающий курс
                ],
                [//Определения
                ],
                [//Даты и события
                ],
                [//Стихи и произведения классиков
                ],
                [//Интересные факты
                ],
                [//Выдающиеся личности
                ],
                [//Вопросы для самопроверки
                ],
                [//Используемая литература
                ],
            ],
            [//Языки стран мира
                [//Обучающий курс
                ],
                [//Алфавит, произношение буквосочетаний
                ],
                [//Правила
                ],
                [//Местоимения, глаголы, причастия
                ],
                [//Словарь
                ],
                [//Интересные факты
                ],
                [//Выдающиеся личности
                ],
                [//Вопросы для самопроверки
                ],
                [//Используемая литература
                ],
            ],
            [//Астрономия
                [//Обучающий курс
                ],
                [//Теоремы, определения, формулы
                ],
                [//Атлас неба
                ],
                [//Планеты
                ],
                [//Звёзды
                ],
                [//Интересные факты 
                ],
                [//Выдающиеся личности
                ],
                [//Вопросы для самопроверки
                ],
                [//Используемая литература
                ],
            ],
            [//Черчение
                [//Обучающий курс
                ],
                [//Теоремы, определения, формулы
                ],
                [//Образцы чертежей
                ],
                [//Необходимое для черчения
                ],
                [//Интересные факты
                ],
                [//Выдающиеся личности
                ],
                [//Вопросы для самопроверки
                ],
                [//Используемая литература
                ],
            ],
            [//Музыка
                [//Обучающий курс
                ],
                [//Определения
                ],
                [//Правила держания рук
                ],
                [//Правила чтения для нот
                ],
                [//Мелодии классики и эстрады
                ],
                [//Интересные факты
                ],
                [//Выдающиеся личности
                ],
                [//Вопросы для самопроверки
                ],
                [//Используемая литература
                ],
            ],
            [//Физкультура
                [//Основные правила зарядки
                ],
                [//Зарядка
                ],
                [//Правила для игр
                ],
            ],
            [//Для дошколят
                [//Обучающие игры для детей
                ],
                [//Чтение вслух с картинками
                ],
                [//Родителям на заметку
                ],
            ],
            [//Энциклопедии
                [//Алфавитный указатель
                ],
                [//По категориям
                ],
                [//Толковый словарь
                ],
            ],
            [//Заметки
                [//Все заметки
                ],
                [//Зачем нужны заметки
                ],
            ]
        ],
        [//Обсуждение 
            [//Беседы
                [//Все беседы
                ],
                [//Беседы по категориям
                ],
                [//Ответы от автора сайта
                ],
            ],
            [//Предложения/критика
                [//Предложения 
                ],
                [//Критика
                ],
            ],
            [//Написать письмо
                [//Бланк отправки
                ]
            ]
        ],
        [//Справка
            [//Инструкция по сайту
                [//Вся инструкция
                ],
                [//Меню сайта
                ],
                [//Содержимое раздела
                ],
                [//Страница
                ],
                [//Боковая панель с окнами
                ],
                [//Смайлик
                ],
            ],
            [//Донаты
                [//Что такое донаты
                ],
                [//Отчёт о полученных донатах
                ],
            ],
            [//Об авторе сайта
                [//Вся история
                ],
                [//Детство и школа
                ],
                [//Переломный момент
                ],
                [//Карьерный взлёт
                ],
            ]
        ]
    ];
nachalo_istorii = '<h2>История Ваших путешествий начиная с конца:</h2>';

//=================================================================================================
function Sait_load() {
    bob.style.backgroundColor = '#306090';
    bob.style.overflowX = 'hidden';
    okna_width = 20;
    pamyt_p_0_0_3 = 0;
    //---------------------------------------------------------------------------------------------
    str = "";
    //список содержимого раздела
    str += "<div id='okna'onmousemove='panel_izmen(3)'onmousedown='panel_izmen(4)'onmouseup='panel_izmen(5)'> ";
    //---------------------------------------------------------------------------------------------
    //кнопки на 3 окне 
    str_plus = "<td id='na_meste_3'class='c_okno_knopki'onmouseover = 'kn_okna_videlen(1,5)' onmouseout = 'kn_okna_videlen(2,5)'onmousedown='kn_okna_videlen(4,5)'><span id='na_meste_3_a'class='c_na_meste_a'></span><span id='na_meste_3_b'class='c_na_meste_b'></span><span id='na_meste_3_c'class='c_na_meste_c'></span></td>";
    str_plus += "<td id='svert_3'class='c_okno_knopki'onmouseover = 'kn_okna_videlen(1,2)' onmouseout = 'kn_okna_videlen(2,2)'onmousedown='kn_okna_videlen(4,2)'><span id='svert_3_a'class='c_svert_a'></span><span id='svert_3_b'class='c_svert_b'></span></td>";
    //свет и тень на заголовке 3 окна 
    str_plus += "<td><span id='svet_3_okna'class='c_svet_okna'></span><span id='ten_3_okna'class='c_ten_okna'></span></td>"
    //3 дополнительное окошко с закладками
    str += "<table id='okno_zametki' class='c_okno'onmousemove='okno_izmen(2,3)'onmousedown='okno_izmen(2,4)'onmouseup='okno_izmen(2,5)'><tr><td id='okno_name_zametki'class='c_okno_name'></td>" + str_plus + "</tr><tr><td id='okno_text_zametki' class='c_okno_text'></td></tr></table>";
    //свет и тень на заголовке 2 окна
    str_plus = "<td><span id='svet_2_okna'class='c_svet_okna'></span><span id='ten_2_okna'class='c_ten_okna'></span></td>"
    //2 дополнительное окошко с новостями
    str += "<table id='okno_novosti' class='c_okno'onmousemove='okno_izmen(1,3)'onmousedown='okno_izmen(1,4)'onmouseup='okno_izmen(1,5)'><tr><td id='okno_name_novosti'class='c_okno_name'></td>" + str_plus + "</tr><tr><td id='okno_text_novosti' class='c_okno_text'></td></tr></table>";
    //свет и тень на заголовке 1 окна
    str_plus = "<td><span id='svet_1_okna'class='c_svet_okna'></span><span id='ten_1_okna'class='c_ten_okna'></span></td>"
    //1 дополнительное окошко с беседами
    str += "<table id='okno_besedi' class='c_okno'onmousemove='okno_izmen(0,3)'onmousedown='okno_izmen(0,4)'onmouseup='okno_izmen(0,5)'><tr><td id='okno_name_besedi'class='c_okno_name'></td>" + str_plus + "</tr><tr><td id='okno_text_besedi' class='c_okno_text'></td></tr></table>";
    //---------------------------------------------------------------------------------------------
    //тень страницы
    str += "</div><div id='ten_stranici'></div><div id='ten'></div>";
    //---------------------------------------------------------------------------------------------
    //кнопка для двищения оконной панели
    str += "<div id='dvigenie_paneli'onmouseover='kn_dvig_panel(1)'onmouseout='kn_dvig_panel(2)'onmousemove='kn_dvig_panel(3)'onmousedown='kn_dvig_panel(4)'onmouseup='kn_dvig_panel(5)'><div id='dvig_ris'></div></div>";
    //---------------------------------------------------------------------------------------------
    //тень содержимого раздела 2
    str += "<div id='ten1_gl_p'></div>";
    str += "<div id='soderg_razdela_1'><div id='gl_p_za_str'></div></div>";
    //---------------------------------------------------------------------------------------------
    in_load_1.innerHTML = str;
    //---------------------------------------------------------------------------------------------
    if (screen.width < screen.height) {

    }

    minus = plus = 0;
    okgran = 45;
    //---------------------------------------------------------------------------------------------
    //  if (localStorage.getItem('w_s')) { } else localStorage.setItem('w_s', 650);//width_soderganiy_razdela
    //---------------------------------------------------------------------------------------------
    if (localStorage.getItem('p_m')) { } else 
    localStorage.setItem('p_m', 0);//punkt_menu
    if (localStorage.getItem('r_p')) { } else
    localStorage.setItem('r_p', 1);//razdel_punkta
    if (localStorage.getItem('n_r')) { } else
    localStorage.setItem('n_r', 0);//n_razdela
    localStorage.setItem('n_n', 0);//n_name

    ogl_vibrono = localStorage.getItem('n_r');

    //---------------------------------------------------------------------------------------------
    //// -------------УРА!!!! Зделала ;) -------------------
    document.getElementById('t_s').innerHTML = array_text[localStorage.getItem('p_m')][localStorage.getItem('r_p')-1][localStorage.getItem('n_r')][0];

    //---------------------------------------------------------------------------------------------
    document.getElementById('t_s').style.display = 'block';
    if (okna.clientWidth < 130) {
        peremeshenie_okon_svernut = true;
    } else {
        peremeshenie_okon_svernut = false;
    }
    if (scrollY > 150) okno_top = 60; else okno_top = 210 - scrollY;
    //---------------------------------------------------------------------------------------------
    if (localStorage.getItem('o_b')) { } else
        localStorage.setItem('o_b', 250);//okno_besedi
      if (localStorage.getItem('o_n')) { }else
    localStorage.setItem('o_n', 250);//okno_novosti
        if (localStorage.getItem('o_z')) { }else
    localStorage.setItem('o_z', 250);//okno_zametki
    //---------------------------------------------------------------------------------------------
    okno_besedi.style.height = localStorage.getItem('o_b');
    okno_novosti.style.height = localStorage.getItem('o_n');
    okno_zametki.style.height = localStorage.getItem('o_z');
    //---------------------------------------------------------------------------------------------
    if (osnova.clientHeight < okno_top + okno_besedi.clientHeight + okno_novosti.clientHeight + okno_zametki.clientHeight + 30) okna_umen();
    //---------------------------------------------------------------------------------------------
    perem = okno_top;
    okb = perem;
    okno_besedi.style.top = perem + 'px';
    perem += okno_besedi.clientHeight + 10;
    okn = perem;
    okno_novosti.style.top = perem + 'px';
    perem += okno_novosti.clientHeight + 10;
    okz = perem;
    okno_zametki.style.top = perem + 'px';
    //---------------------------------------------------------------------------------------------
    limit = 270;
    okna.style.height = limit + stranica.clientHeight + 'px';
    //---------------------------------------------------------------------------------------------
    
    //---------------------------------------------------------------------------------------------
    soderg_razdela_1.style.width = 750 + 'px';
    soderg_del = (soderg_razdela_1.clientWidth - 100) / 10;
    gl_p_za_str.style.width = soderg_razdela_1.clientWidth-100 + 'px';
    gl_p_za_str.style.left = -soderg_razdela_1.clientWidth - 70 + 'px';

    gl_p_za_str.innerHTML = "Содержимое раздела: <div id='kn_za_str2' onmouseover='kn_za_str2_(1)' onmouseout='kn_za_str2_(2)' onmousedown='kn_za_str2_(4)'></div>";
    
    //---------------------------------------------------------------------------------------------
    na_meste_3.style.right = '40px';
    svert_3.style.right = '10px';
    //---------------------------------------------------------------------------------------------
    okno_name_besedi.innerHTML = 'Беседы';
    okno_name_novosti.innerHTML = 'Новости';
    okno_name_zametki.innerHTML = 'Заметки';
    
    //---------------------------------------------------------------------------------------------
    if (osnova.clientHeight < 840) okno_besedi.style.height = okno_novosti.style.height = okno_zametki.style.height = (osnova.clientHeight - 240) / 3 + 'px';
    //---------------------------------------------------------------------------------------------
    perem = 0;
    //---------------------------------------------------------------------------------------------
    stranica.style.width = osnova.clientWidth - 135 - okna.clientWidth + 'px';
    ten_stranici.style.width = stranica.clientWidth + 'px';
    //---------------------------------------------------------------------------------------------
    //stranica_left = 130;
    stranica_top = 220;

    //---------------------------------------------------------------------------------------------
    //кнопка для возвращения назад на верх страницы и содержимое раздела по пунктам
    soderg_razdela();
    //---------------------------------------------------------------------------------------------
    str = "";
    //тень под названием раздела
    str += "<div id='razdel_teni'></div>";
    //---------------------------------------------------------------------------------------------
    //название раздела
    str += "<div id='razdel'></div>";
    //---------------------------------------------------------------------------------------------
    //тень верхней полоски меню
    str += "<div id='ten_menu'></div>";
    //---------------------------------------------------------------------------------------------
    //верхняя полоска меню
    str += "<table><tr><td id='menu_line'onmouseout = 'menu_(2,0,0)'><table id = 'menu' onmouseout = 'menu_(2,0,0)'><tr><td id = 'm_g' class='c_m_g' onmouseover = 'menu_(1,0,0)' onmouseout = 'menu_(2,0,0)' onmousemove='menu_(3,0,0)'></td ><td id='m_razdelitel'align='center'>|</td><td id='m_y' class='c_m_g' onmouseover='menu_(1,0,1)' onmouseout='menu_(2,0,1)'onmousemove='menu_(3,0,1)'></td><td align='center'>|</td><td id='m_os' class='c_m_g' onmouseover='menu_(1,0,2)' onmouseout='menu_(2,0,2)'onmousemove='menu_(3,0,2)'></td><td align='center'>|</td><td id='m_s' class='c_m_g' onmouseover='menu_(1,0,3)' onmouseout='menu_(2,0,3)'onmousemove='menu_(3,0,3)'></td></tr></table ></td></tr></table>";
    //---------------------------------------------------------------------------------------------
    //тени названия сайта
    str += "<div id='name_sait1_teni' ></div><div id='name_sait2_teni'style='filter:blur(7px)'></div>";
    //название сайта
    str += "<div id='name_sait1'></div><div id='name_sait2'></div>";
    //---------------------------------------------------------------------------------------------
    //развёрнутые списки менюшек
    str += "<div id='m1'></div><div id='m2'></div><div id='m3'></div><div id='m4'></div>";
    //помошник
    
    str += "<div id='ten_line_pomoshnik'></div>";
    
    str += "<div id='sleva'></div><hr id='line_pomoshnik' color='#80b0ff' />";
    
    //предупреждение
    //str += "<div id='predupr'>" + predupregd + "</div>";
    str += "<span id='ten_kn_prydki'></span><span id='kn_prydki'onmouseover='kn_prydki_(1)'onmouseout='kn_prydki_(2)'onmousedown='kn_prydki_(4)'></span>";
    in_load_3.innerHTML = str;
    //---------------------------------------------------------------------------------------------
    //имя с тенью раздела сайта на который перешли
    document.getElementById('razdel_teni').innerHTML = document.getElementById('razdel').innerHTML = array_menu[localStorage.getItem('p_m') - 0 + 1][localStorage.getItem('r_p') - 1];
    //---------------------------------------------------------------------------------------------
    sleva.innerHTML = "<span id='pomoshnik'></span>";
    //line_pomoshnik.style.top = innerHeight - 60 + 'px';
    pomoshnik.innerHTML = "<span id='ten_pomoshnika'></span><span id='telo'></span><span id='svet_tela'></span><span id='glaz_l'></span><span id='glaz_r'></span><span id='guba'></span>";
    glaz_l.innerHTML = "<span id='svet_glaz_l' class='c_svet_glaz'></span><span id='sheka_l'></span>";
    glaz_r.innerHTML = "<span id='svet_glaz_r' class='c_svet_glaz'></span><span id='sheka_r'></span>";
    guba.innerHTML = "<span id='guba_1'></span><span id='guba_2'></span>";
    //---------------------------------------------------------------------------------------------

    guba_2.style.visibility = 'hidden';
    //---------------------------------------------------------------------------------------------
    kn_prydki.innerHTML = '<';
    kn_prydki.style.top = innerHeight - 64 + 'px';
    ten_kn_prydki.style.top = innerHeight - 60 + 'px';
    ten_kn_prydki.style.visibility= kn_prydki.style.visibility = 'hidden';
    //---------------------------------------------------------------------------------------------
    //if (localStorage.getItem('l_p')) { } else
    localStorage.setItem('l_p', 0);  //left_pomoshnik
    
    //---------------------------------------------------------------------------------------------
    name_sait1.innerText = array_name_sait[0];
    name_sait1_teni.innerText = array_name_sait[0];
    name_sait2.innerText = array_name_sait[1];
    name_sait2_teni.innerText = array_name_sait[1];
    ns_a = 2; ns_b = 1; ns_i = 0;
    ns_c = ns_d = 0;
    //---------------------------------------------------------------------------------------------
    m_g.innerHTML = array_menu[0][0];
    m_y.innerHTML = array_menu[0][1];
    m_os.innerHTML = array_menu[0][2];
    m_s.innerHTML = array_menu[0][3];
    //---------------------------------------------------------------------------------------------
    setTimeout('sait_load_dopolnit()', 10);
}

//=================================================================================================
function sait_load_dopolnit() {
    menu_width = 300;
    m1_left = 22; m2_left = m1_left + m_g.clientWidth + m_razdelitel.clientWidth + 4; m3_left = m2_left + m_y.clientWidth + m_razdelitel.clientWidth + 4; m4_left = m3_left + m_os.clientWidth + m_razdelitel.clientWidth + 4; m_b = 1;
    ms = [["m_g", 8, m1_left,4], ["m_y", 21, m2_left,6], ["m_os", 4, m3_left,2], ["m_s", 4, m4_left,2]];
    //---------------------------------------------------------------------------------------------
    str = "<div id='ten_m'></div>";
    str += "<div id='m_g_0'class='c_m_o'onmouseover='menu_(1,1,0)'onmouseleave='menu_(2,1,0)'onmousemove='menu_(3,1,0)'>"
    for (i = 1; i < ms[0][1]; i++)str += "<div id='m_g_" + i + "'class='c_m'onmouseover='menu_(1," + (i + 1) + ",0)'onmouseout='menu_(2," + (i + 1) + ",0)'onclick='menu_(4," + (i + 1) + ",0)'></div>";
    str += "<hr id='m_g_l_0'class='c_m_line_0'color='black'size='1'/><hr id='m_g_l_1'class='c_m_line_1'color='white'size='1'/><hr id='m_g_l_2'class='c_m_line_2'color='black'size='1'/><hr id='m_g_l_3'class='c_m_line_3'color='white'size='1'/></div>";
    m1.innerHTML = str;
    for (i = 0; i < ms[0][1] - 1; i++)document.getElementById(ms[0][0] + '_' + (i + 1)).innerText = array_menu[1][i];
    //---------------------------------------------------------------------------------------------
    str = "<div id='m_y_0'class='c_m_o'onmouseover='menu_(1,1,1)'onmouseout='menu_(2,1,1)'onmousemove='menu_(3,1,1)'>"
    for (i = 1; i < ms[1][1]; i++)str += "<div id='m_y_" + i + "'class='c_m'onmouseover='menu_(1," + (i + 1) + ",1)'onmouseout='menu_(2," + (i + 1) + ",1)'onclick='menu_(4," + (i + 1) + ",1)'></div>";
    str += "<hr id='m_y_l_0' class='c_m_line_0' color='black' size='1'/><hr id='m_y_l_1' class='c_m_line_1' color='white' size='1'/><hr id='m_y_l_2'class='c_m_line_4' color='black' size='1'/><hr id='m_y_l_3'class='c_m_line_5' color='white' size='1'/><hr id='m_y_l_4'class='c_m_line_6' color='black' size='1'/><hr id='m_y_l_5'class='c_m_line_7' color='white' size='1'/></div > ";
    m2.innerHTML = str;
    for (i = 0; i < ms[1][1] - 1; i++)document.getElementById(ms[1][0] + '_' + (i + 1)).innerText = array_menu[2][i];
    //---------------------------------------------------------------------------------------------
    str = "<div id='m_os_0'class='c_m_o'onmouseover='menu_(1,1,2)'onmouseout='menu_(2,1,2)'onmousemove='menu_(3,1,2)'>"
    for (i = 1; i < ms[2][1]; i++)str += "<div id='m_os_" + i + "'class='c_m'onmouseover='menu_(1," + (i + 1) + ",2)'onmouseout='menu_(2," + (i + 1) + ",2)'onclick='menu_(4," + (i + 1) + ",2)'></div>";
    str += "<hr id='m_os_l_0' class='c_m_line_0' color='black' size='1'/><hr id='m_os_l_1' class='c_m_line_1' color='white' size='1'/></div > ";
    m3.innerHTML = str;
    for (i = 0; i < ms[2][1] - 1; i++)document.getElementById(ms[2][0] + '_' + (i + 1)).innerText = array_menu[3][i];
    //---------------------------------------------------------------------------------------------
    str = "<div id='m_s_0'class='c_m_o'onmouseover='menu_(1,1,3)'onmouseout='menu_(2,1,3)'onmousemove='menu_(3,1,3)'>"
    for (i = 1; i < ms[3][1]; i++)str += "<div id='m_s_" + i + "'class='c_m'onmouseover='menu_(1," + (i + 1) + ",3)'onmouseout='menu_(2," + (i + 1) + ",3)'onclick='menu_(4," + (i + 1) + ",3)'></div>";
    str += "<hr id='m_s_l_0'class='c_m_line_0' color='black' size='1'/><hr id='m_s_l_1'class='c_m_line_1' color='white' size='1'/></div > ";
    m4.innerHTML = str;
    for (i = 0; i < ms[3][1] - 1; i++)document.getElementById(ms[3][0] + '_' + (i + 1)).innerText = array_menu[4][i];
    //---------------------------------------------------------------------------------------------
    for (j = 0; j < 4; j++) {
        m = [];
        for (i = 0; i < ms[j][1]; i++) { m[i] = document.getElementById(ms[j][0] + "_" + i); }
        m[0].style.height = (ms[j][1] - 1) * text_size + 'px';
        m[0].style.left = ms[j][2] + 'px';
        mm = document.getElementById(ms[j][0]).clientWidth;
        if (m[0].clientWidth <= mm) m[0].style.width = mm + 10 + 'px';
        t = 2;
        for (i = 1; i < m.length; i++) {
            m[i].style.top = t + 'px';
            t += text_size;
        }
    }
    m_i = 0;
    //---------------------------------------------------------------------------------------------

    stranici_right = stranica_left + stranica.clientHeight;
    stranica_left_p = stranica_left;

    gl_p_vis_hidden = false;
    deform_okno_besedi_down = false;
    deform_okno_novosti_down = false;
    deform_okno_zametki_down = false;
    peremeshenie_okon_down = false;
    peremeshenie_okon_svernut = false;
    peremeshenie_okon_fiksaciy = 0;
    kn_prydki_skrita = true;
    kn_prydki_start = false;
    okna_svernuti = false;
    nachalo_napisano = false;
    staroe_x = innerWidth;
    staroe_y = innerHeight;
    peremeshenie_vniz = 0;
    posle_scroll = false;
    kn_nazad_vidna = false;

    soderg_rabota = true;
    soderg_izmen = 30;
    soderg_variant = 0;
    soderg_index = 0;

    dvig_pan_rabota = false;
    dvig_pan_del = 0;
    dvig_pan_variant = 0;
    dvig_pan_konec = osnova.clientWidth-20;
    dvig_pan_index = 0;

    prydki_index = 0;
    prydki_variant = 0;
    prydki_rabota = false;
    prydki_del = 0;
    prydki_perem = 0;


    setTimeout('izmen_win()', 4);
    pom_etap_vipolnen = false;
    pom_etap = 1;
    pom_et_nomer = 0;


}
//=================================================================================================
function prydki_() {
    switch (prydki_variant) {
        case 0:
            prydki_rabota = true;
                prydki_del = line_pomoshnik.clientWidth / 10;
            prydki_index = line_pomoshnik.clientWidth;
            kn_prydki_skrita = false;
            kn_prydki_start = true;
                kn_prydki.style.visibility = 'visible';
                ten_kn_prydki.style.visibility = 'visible';
                pomoshnik.style.left = '40px';
                prydki_variant++;
            break;
        case 1:
            if (prydki_index > -prydki_del) {
                prydki_index -= prydki_del;
                pomoshnik.style.left = pomoshnik.style.left.slice(0, pomoshnik.style.left.length - 2) - prydki_del + 'px';
                line_pomoshnik.style.width = prydki_index + 'px';
                ten_line_pomoshnik.style.width = prydki_index + 10 + 'px';
                ten_kn_prydki.style.left = kn_prydki.style.left = line_pomoshnik.clientWidth + 'px';
            }
            else {
                ten_line_pomoshnik.style.visibility = 'hidden';
                line_pomoshnik.style.visibility = 'hidden';
                kn_prydki_start = true;
                kn_prydki.style.left = 0 + 'px';
                kn_prydki.style.borderTopLeftRadius = '0px';
                kn_prydki.style.borderLeft = '0px';
                kn_prydki.style.width = 35 + 'px';
                kn_prydki.innerHTML = '>';
                ten_kn_prydki.style.visibility =kn_prydki.style.visibility = 'visible';
                prydki_perem = 50;
                ten_kn_prydki.style.left = '0px';
                localStorage.setItem('l_p', 1);
                prydki_rabota = false;
                prydki_variant++;
 }
            break;
        case 2: 
            kn_prydki.style.visibility = 'visible';
            ten_kn_prydki.style.visibility = 'visible';
            ten_line_pomoshnik.style.visibility = 'visible';
            line_pomoshnik.style.visibility = 'visible';
            kn_prydki.style.borderTopLeftRadius = '10px';
            kn_prydki.style.border = '2px solid #104070';
            kn_prydki.style.width = 40 + 'px';
            perem = 1;
            prydki_variant++;
            break;
        case 3:
            if (prydki_index < 160) {
                prydki_index += prydki_del;
                pomoshnik.style.left = pomoshnik.style.left.slice(0, pomoshnik.style.left.length - 2) -0+ prydki_del + 'px';
                line_pomoshnik.style.width = prydki_index + 'px';
                ten_line_pomoshnik.style.width = prydki_index + 10 + 'px';
                ten_kn_prydki.style.left = kn_prydki.style.left = line_pomoshnik.clientWidth + 'px';
            }
            else {
                kn_prydki.style.left = 160 + 'px';
                kn_prydki.innerHTML = '<';
                kn_prydki_start = false;
                ten_kn_prydki.style.visibility= kn_prydki.style.visibility = 'hidden';
                ten_kn_prydki.style.left = '160px';
                pomoshnik.style.left = '40px';
                localStorage.setItem('l_p', 0);
                prydki_rabota = false;
                prydki_variant=0;
            }
            break;
    }
    if (prydki_rabota) setTimeout('prydki_()', 50);
}
//=================================================================================================
function kn_prydki_(deistvie) {
    color_kn = '#b0d0f0';
    color_strelka = '#104070';
    color_kn_vibrana = '#70f0b0';
    switch (deistvie) {
        case 1://over
            kn_prydki.style.cursor = 'default';
            kn_prydki.style.backgroundColor = color_kn_vibrana;
            break;
        case 2://out
            kn_prydki.style.backgroundColor = color_kn;
            break;
        case 3://move
            break;
        case 4://down
            prydki_rabota = true;
            if (localStorage.getItem('l_p') == 0) prydki_variant = 0; else prydki_variant = 2;
            prydki_();
            break;
    }
}
//=================================================================================================
function kn_dvig_panel(deistvie) {
    color_kn = '#5080b0';
    color_videl = '#80b0e0';
    switch (deistvie) {
        case 1://over
            dvigenie_paneli.style.backgroundColor = color_videl;
            dvigenie_paneli.style.cursor = 'ew-resize';
            break;
        case 2://out
            dvigenie_paneli.style.backgroundColor = color_kn;
            break;
        case 3://move

            break;
        case 4://douwn
            peremeshenie_okon_down = true;
            peremeshenie_okon_fiksaciy = event.clientX;
            event.returnValue = false;
            break;
        case 5://up
            peremeshenie_okon_down = false;
            if (peremeshenie_okon_fiksaciy == event.clientX) {
                dvig_pan_rabota = true;
                //dvig_pan_variant = 0;
                setTimeout('dvig_panel()', 50);
                ten_kn_nazad.style.left = kn_nazad.style.left = stranica.clientWidth + stranica_left + 'px';
            }
            event.returnValue = true;
            break;
    }
}
//=================================================================================================
function dvig_panel() {
    switch (dvig_pan_variant) {
        case 0:
            dvig_pan_del = okna.clientWidth / 10;
            dvig_pan_index = osnova.clientWidth - okna.clientWidth + dvig_pan_del;
            dvig_pan_variant++;
            okna.style.left = dvig_pan_index + 'px';
            okna.style.width = okna.clientWidth - dvig_pan_del + 'px';
            ten_stranici.style.width = stranica.style.width = stranica.clientWidth + dvig_pan_del -5+ 'px';
            dvigenie_paneli.style.left = dvig_pan_index - 10 + 'px';
            ten_kn_nazad.style.left =kn_nazad.style.left = dvig_pan_index - 30 + 'px';
            break;
        case 1:
            if (okna.clientWidth - dvig_pan_del > 20) {
                dvig_pan_index += dvig_pan_del;
               
                okna.style.left = dvig_pan_index + 'px';
                perem = okna.style.left.slice(0, okna.style.left.length - 2) - 0;
                okna.style.width = osnova.clientWidth - perem + 'px';
                ten_stranici.style.width = stranica.style.width = perem-stranica_left -10 + 'px';
                dvigenie_paneli.style.left = dvig_pan_index - 10 + 'px';
                ten_kn_nazad.style.left= kn_nazad.style.left = dvig_pan_index - 30 + 'px';
            } else {
                    okna.style.left = osnova.clientWidth - 20 + 'px';
                okna.style.width = '20px';
                dvigenie_paneli.style.left = osnova.clientWidth - 30 + 'px';
                ten_kn_nazad.style.left = kn_nazad.style.left = osnova.clientWidth - 50 + 'px';
                ten_stranici.style.width = stranica.style.width = osnova.clientWidth - stranica_left - 30 + 'px';
                dvig_pan_rabota = false;
                dvig_pan_variant = 2;
                peremeshenie_okon_svernut = true;
            }

            
            break;
        case 2:
            dvig_pan_del = 27;
            dvig_pan_index = osnova.clientWidth - 20 - dvig_pan_del;
            dvig_pan_variant++;
            okna.style.left = dvig_pan_index + 'px';
            okna.style.width = osnova.clientWidth - okna.style.left.slice(0, okna.style.left.length - 2) - 0 + 'px';
            ten_stranici.style.width = stranica.style.width = stranica.clientWidth - dvig_pan_del + 10 + 'px';
            dvigenie_paneli.style.left = dvig_pan_index - 10 + 'px';
            ten_kn_nazad.style.left = kn_nazad.style.left = dvig_pan_index - 30 + 'px';
            break;
        case 3:
            if (okna.clientWidth + dvig_pan_del < 260) {
                dvig_pan_index -= dvig_pan_del;

                okna.style.left = dvig_pan_index + 'px';
                perem = okna.style.left.slice(0, okna.style.left.length - 2) - 0;
                okna.style.width = osnova.clientWidth - perem + 'px';
                okno_besedi.style.width = okno_novosti.style.width = okno_zametki.style.width = okna.clientWidth - 30 + 'px';
                ten_stranici.style.width = stranica.style.width = perem - stranica_left - 10 + 'px';
                dvigenie_paneli.style.left = dvig_pan_index - 10 + 'px';
                ten_kn_nazad.style.left = kn_nazad.style.left = dvig_pan_index - 30 + 'px';
            } else {
                okna.style.left = osnova.clientWidth - 270 + 'px';
                okna.style.width = '270px';
                okno_besedi.style.width = okno_novosti.style.width = okno_zametki.style.width = okna.clientWidth - 30 + 'px';
                dvigenie_paneli.style.left = osnova.clientWidth - 280 + 'px';
                ten_kn_nazad.style.left = kn_nazad.style.left = osnova.clientWidth - 300 + 'px';
                ten_stranici.style.width = stranica.style.width = osnova.clientWidth - stranica_left - 280 + 'px';
                dvig_pan_rabota = false;
                dvig_pan_variant = 0;
                peremeshenie_okon_svernut = false;
            }


            break;
    }
    if (dvig_pan_rabota) setTimeout('dvig_panel()', 50);
    
}
//=================================================================================================
function kn_za_str_(deistvie) {
    color_kn = '#b0c0f0';
    color_ris = '#304050';
    color_videl = '#6080c0';
    color_videl_ris = '#c0ffe0';
    switch (deistvie) {
        case 1://over
            kn_za_str.style.backgroundColor = color_videl;
            ris_min.style.backgroundColor = color_videl;
            ris_min.style.borderColor = color_videl_ris;
            ris_v.style.color = color_videl_ris;
            ris_kn_za_str.style.borderColor = color_videl_ris;
            ris_str.style.backgroundColor = color_videl_ris;
            kn_za_str.style.cursor = 'default';
            break;
        case 2://out
            kn_za_str.style.backgroundColor = color_kn;
            ris_min.style.backgroundColor = color_kn;
            ris_min.style.borderColor = color_ris;
            ris_v.style.color = color_ris;
            ris_kn_za_str.style.borderColor = color_ris;
            ris_str.style.backgroundColor = color_ris;
            break;
        case 3://move

            break;
        case 4://douwn
            scroll(0, 0);
            if (localStorage.getItem('l_p') == 0) {
                prydki_variant = 0;
                prydki_();
            }
            ten2_gl_p.style.visibility = gl_p.style.visibility = 'visible';
            dvig_pan_rabota = true;
            dvig_pan_variant = 0;
            setTimeout('dvig_panel()', 20);
            soderg_rabota = true;
            setTimeout('soderg_control()', 10);
            break;

    }
}
//=================================================================================================
function kn_za_str2_(deistvie) {
    color_kn = '#b0c0f0';
    color_ris = '#304050';
    color_videl = '#6080c0';
    color_videl_ris = '#c0ffe0';
    switch (deistvie) {
        case 1://over
            kn_za_str2.style.backgroundColor = color_videl;
            ris_min2.style.backgroundColor = color_videl;
            ris_min2.style.borderColor = color_videl_ris;
            ris_v2.style.color = color_videl_ris;
            ris_kn_za_str2.style.borderColor = color_videl_ris;
            ris_str2.style.backgroundColor = color_videl_ris;
            kn_za_str2.style.cursor = 'default';
            break;
        case 2://out
            kn_za_str2.style.backgroundColor = color_kn;
            ris_min2.style.backgroundColor = color_kn;
            ris_min2.style.borderColor = color_ris;
            ris_v2.style.color = color_ris;
            ris_kn_za_str2.style.borderColor = color_ris;
            ris_str2.style.backgroundColor = color_ris;
            break;
        case 3://move

            break;
        case 4://douwn
            soderg_rabota = true;
            soderg_variant = 2;
            setTimeout('soderg_control()', 50);
            break;

    }
}
//=================================================================================================
function soderg_control() {
    switch (soderg_variant) {
        case 0: if (soderg_index < 10) {
            soderg_index++;
            soderg_izmen -= soderg_del;
            ten1_gl_p.style.left = ten2_gl_p.style.left = gl_p.style.left = soderg_izmen + 'px';
            perem = soderg_izmen + 30 + 'px';
            perem2 = soderg_razdela_1.clientWidth-100 + soderg_izmen + 14 + 'px';
            for (i = 0; i < array_razd_p[localStorage.getItem('p_m')][localStorage.getItem('r_p') - 1].length; i++) {
                if (ogl_vibrono != i) {
                    document.getElementById('p_' + i).style.left = perem;
                    document.getElementById('tp_' + i).style.left = perem2;
                }
            }
            stranica_left -= 5;
            ten_stranici.style.left = stranica.style.left = stranica_left + 'px';
            ten_stranici.style.width = stranica.style.width = stranica.clientWidth + 5 + 'px';
        } else {
            soderg_variant++;
            soderg_index = 0;
            soderg_razdela_2.style.width = stranica_left + 'px';
            soderg_razdela_2.style.top = '180px';
            ten2_gl_p.style.visibility = 'hidden';
            ten1_gl_p.style.visibility = 'visible';
            ten1_gl_p.style.filter = 'blur(4px)';
            ten1_gl_p.style.top = '180px';
            kn_za_str2.innerHTML = "<div id='ris_kn_za_str2'></div><div id='ris_min2'></div><div id='ris_v2'></div><div id='ris_str2'></div>";
            ris_v2.innerHTML = 'v';
            kn_za_str2.style.left = gl_p.clientWidth - 70 + 'px';
            localStorage.setItem('ogl_v', document.getElementById('p_' + ogl_vibrono).style.top);
            pamyt_ogl_vibr = soderg_izmen2 = ogl_vibrono_copiy.style.top.slice(0, ogl_vibrono_copiy.style.top.length - 2) - 0;
            pamyt_stran = 125;
            soderg_del2 = (soderg_izmen2 - 230) / 5;
            soderg_izmen2 -= soderg_del2;
            ogl_vibrono_copiy.style.top = soderg_izmen2 + 'px';
            ten_vibronogo_p.style.top = soderg_izmen2 + 1 + 'px';
            pamyt_pad = soderg_izmen_pad = text_stranici.style.paddingTop.slice(0, text_stranici.style.paddingTop.length - 2) - 0;

            soderg_del_pad = (soderg_izmen_pad - 50) / 5;
            gl_p_za_str.style.visibility = 'visible';
        } break;
        case 1: if (soderg_index < 10) {
            soderg_index++;
            soderg_izmen += soderg_del;
            ten1_gl_p.style.left = gl_p.style.left = gl_p_za_str.style.left = soderg_izmen + 'px';
            perem = soderg_izmen + 30 + 'px';
            perem2 = soderg_razdela_1.clientWidth-100 + soderg_izmen + 14 + 'px';
            for (i = 0; i < array_razd_p[localStorage.getItem('p_m')][localStorage.getItem('r_p') - 1].length; i++) {
                if (ogl_vibrono != i) {
                    document.getElementById('p_' + i).style.left = perem;
                    document.getElementById('tp_' + i).style.left = perem2;
                }
            }
            if (soderg_izmen2 > 240) {
                soderg_izmen2 -= soderg_del2;
                ogl_vibrono_copiy.style.top = soderg_izmen2 + 'px';
                ten_vibronogo_p.style.top = soderg_izmen2 + 1 + 'px';
            }
            if (soderg_izmen_pad > 70) {
                soderg_izmen_pad -= soderg_del_pad;
                text_stranici.style.paddingTop = soderg_izmen_pad + 'px';
            }
            if (stranica_left > 50) {
                stranica_left -= 5;
                ten_stranici.style.left = stranica.style.left = soderg_razdela_2.style.width = stranica_left + 'px';
                ten_stranici.style.width = stranica.style.width = stranica.clientWidth + 5 + 'px';
            }
        } else {
            
            soderg_index = soderg_variant = 0;
            soderg_izmen = 30;
            soderg_rabota = false;
        } break;
        case 2:
            if (soderg_index < 10) {
                soderg_index++;
                soderg_izmen -= soderg_del;
                ten1_gl_p.style.left = gl_p.style.left = gl_p_za_str.style.left = soderg_izmen + 'px';
                perem = soderg_izmen + 30 + 'px';
                perem2 = soderg_razdela_1.clientWidth-100 + soderg_izmen + 14 + 'px';
                for (i = 0; i < array_razd_p[localStorage.getItem('p_m')][localStorage.getItem('r_p') - 1].length; i++) {
                    if (ogl_vibrono != i) {
                        document.getElementById('p_' + i).style.left = perem;
                        document.getElementById('tp_' + i).style.left = perem2;
                    }
                }
                if (soderg_izmen2 < pamyt_ogl_vibr) {
                    soderg_izmen2 += soderg_del2;
                    ogl_vibrono_copiy.style.top = soderg_izmen2 + 'px';
                    ten_vibronogo_p.style.top = soderg_izmen2 + 1 + 'px';
                }
                if (soderg_izmen_pad < pamyt_pad) {
                    soderg_izmen_pad += soderg_del_pad;
                    text_stranici.style.paddingTop = soderg_izmen_pad + 'px';
                }
                if (stranica_left < pamyt_stran) {
                    stranica_left += 5;
                    ten_stranici.style.left = stranica.style.left = soderg_razdela_2.style.width = stranica_left + 'px';
                    ten_stranici.style.width = stranica.style.width = stranica.clientWidth - 5 + 'px';
                }

            }
            else {
                soderg_variant++;
                soderg_index = 0;
                gl_p_za_str.style.visibility = 'hidden';
                ten1_gl_p.style.filter = 'blur(10px)';
                ten1_gl_p.style.top = '202px';
                soderg_razdela_2.style.top = '200px';
                soderg_razdela_2.style.width = soderg_razdela_1.clientWidth + 'px';
                ten2_gl_p.style.left = gl_p.style.left;
                ten2_gl_p.style.visibility = 'visible';

            } break;
        case 3:
            if (soderg_index < 10) {
                soderg_index++;
                if (soderg_izmen < 30) {
                    soderg_izmen += soderg_del;
                    ten1_gl_p.style.left = ten2_gl_p.style.left = gl_p.style.left = soderg_izmen + 'px';

                    perem = soderg_izmen + 30 + 'px';
                    perem2 = soderg_razdela_1.clientWidth - 100 + soderg_izmen + 14 + 'px';
                    for (i = 0; i < array_razd_p[localStorage.getItem('p_m')][localStorage.getItem('r_p') - 1].length; i++) {
                        if (ogl_vibrono != i) {
                            document.getElementById('p_' + i).style.left = perem;
                            document.getElementById('tp_' + i).style.left = perem2;
                        }
                    }

                }
                if (stranica_left < pamyt_stran) {
                    stranica_left += 5;
                    ten_stranici.style.left = stranica.style.left = stranica_left + 'px';
                    ten_stranici.style.width = stranica.style.width = stranica.clientWidth - 5 + 'px';
                }
            }
            else {
                soderg_index = soderg_variant = 0;
                soderg_rabota = false;
            }
            break;
    }
    if (soderg_rabota) setTimeout('soderg_control()', 50);

}


//=================================================================================================
function all_control(deistvie) {

    if (m_g_0.style.visibility == 'visible' || m_y_0.style.visibility == 'visible' || m_os_0.style.visibility == 'visible' || m_s_0.style.visibility == 'visible') {
        if (m_g_0.style.visibility == 'visible') menu_(3, 1, 0);
        if (m_y_0.style.visibility == 'visible') menu_(3, 1, 1);
        if (m_os_0.style.visibility == 'visible') menu_(3, 1, 2);
        if (m_s_0.style.visibility == 'visible') menu_(3, 1, 3);
    } else {
        switch (deistvie) {
            //---------------------------------------------------------------------------------------------
            case 3://move
                if (event.clientX < osnova.clientWidth - okna.clientWidth) panel_izmen(5);
                if (peremeshenie_okon_down) {
                    if (event.clientX < soderg_razdela_1.clientWidth - 30) {
                        perem = soderg_razdela_1.clientWidth-95;
                        stranica.style.width = ten_stranici.style.width = perem+ 'px';
                        dvigenie_paneli.style.left = perem + 50 + 'px';
                        okna.style.left = perem + 60 + 'px';
                        okna.style.width = osnova.clientWidth - perem - 60 + 'px';
                        okno_besedi.style.width = okno_novosti.style.width = okno_zametki.style.width = okna.clientWidth - 30 + 'px';
                    } else {

                        if (event.clientX > osnova.clientWidth - 20) {
                            okna.style.left = osnova.clientWidth - 20 + 'px';
                            okna.style.width = '20px';
                            dvigenie_paneli.style.left = osnova.clientWidth - 30 + 'px';
                            ten_stranici.style.width = stranica.style.width = osnova.clientWidth - stranica_left + 'px';

                        }
                        else {
                            if (event.clientX > osnova.clientWidth - 130) {
                                peremeshenie_okon_svernut = true;
                            }

                            okna.style.width = osnova.clientWidth - event.clientX + 'px';
                            okna.style.left = osnova.clientWidth - okna.clientWidth + 'px';
                            dvigenie_paneli.style.left = osnova.clientWidth - okna.clientWidth - 10 + 'px';

                            if (event.clientX < osnova.clientWidth - 150)
                            {
                                okno_besedi.style.width = okno_novosti.style.width = okno_zametki.style.width = okna.clientWidth - 30 + 'px';
                            }
                        }
                    }
                    stranica.style.width = ten_stranici.style.width = osnova.clientWidth - okna.clientWidth - stranica_left - 10 + 'px';
                    ten_kn_nazad.style.left = kn_nazad.style.left = stranica_left-20 + stranica.clientWidth + 'px';
                }
                //---------------------------------------------------------------------------------------------
                break;
            //---------------------------------------------------------------------------------------------
            case 4://down
                //  if (localStorage.getItem('l_p')==0)
                {
                    if (kn_prydki_start == false) {
                        if (kn_prydki_skrita && event.clientX < 162 && event.clientY > innerHeight - 30) {
                        //bob.innerHTML = 'yra';
                        ten_kn_prydki.style.visibility = kn_prydki.style.visibility = 'visible';
                        kn_prydki_skrita = false;

                    } else {
                       // if (event.clientX > 160 && event.clientX < 160 + kn_prydki.clientWidth && event.clientY > innerHeight - 20 - kn_prydki.clientHeight && event.clientY < innerHeight - 20) kn_prydki_(4);
                         //   else 
                     
                            ten_kn_prydki.style.visibility = kn_prydki.style.visibility = 'hidden';
                            kn_prydki_skrita = true;
                        }
                    }
                    //}
                }
                break;
            //---------------------------------------------------------------------------------------------
            case 5://up
                if (peremeshenie_okon_down) kn_dvig_panel(5);
                break;
            //-----------------------------------------------------------------------------------------
        }
    }

}
//=================================================================================================
function okno_izmen(idnomer, deistvie) {
    switch (deistvie) {
        case 3://move
            // bob.innerHTML = event.clientY;

            if (event.clientX > osnova.clientWidth - okno_besedi.clientWidth && event.clientX < osnova.clientWidth - 10 && idnomer == 0 && event.clientY > okb + okno_besedi.clientHeight - 5) okno_besedi.style.cursor = 'ns-resize';
            else okno_besedi.style.cursor = 'default';
            if (event.clientX > osnova.clientWidth - okno_besedi.clientWidth && event.clientX < osnova.clientWidth - 10 && idnomer == 1 && event.clientY > okn + okno_novosti.clientHeight - 5) okno_novosti.style.cursor = 'ns-resize';
            else okno_novosti.style.cursor = 'default';
            if (event.clientX > osnova.clientWidth - okno_besedi.clientWidth && event.clientX < osnova.clientWidth - 10 && idnomer == 2 && event.clientY > okz + okno_zametki.clientHeight - 5) okno_zametki.style.cursor = 'ns-resize';
            else okno_zametki.style.cursor = 'default';

            if (deform_okno_besedi_down) panel_izmen(3);
            if (deform_okno_novosti_down) panel_izmen(3);
            if (deform_okno_zametki_down) panel_izmen(3);

            break;
        case 4://down
            panel_izmen(4);
            break;
        case 5://up
            panel_izmen(5);
            break;
    }
}
//=================================================================================================
function panel_izmen(deistvie) {
    switch (deistvie) {

        case 3://move
            if (event.clientX > osnova.clientWidth - okno_besedi.clientWidth && event.clientX < osnova.clientWidth - 10 &&
                okno_besedi.style.visibility == 'visible' && ((event.clientY > okb - scrollY + okno_besedi.clientHeight - 5 && event.clientY < okb - scrollY + okno_besedi.clientHeight + 5) ||
                    (event.clientY > okn - scrollY + okno_novosti.clientHeight - 5 && event.clientY < okn - scrollY + okno_novosti.clientHeight + 5) ||
                    (event.clientY > okz - scrollY + okno_zametki.clientHeight - 5 && event.clientY < okz - scrollY + okno_zametki.clientHeight + 5))) okna.style.cursor = 'ns-resize';
            else okna.style.cursor = 'default';
            if (deform_okno_besedi_down) {

                if (event.clientY - okb + scrollY < okgran) okno_besedi.style.height = okgran + 'px';
                else {
                    if (event.clientY - okb + scrollY > osnova.clientHeight + scrollY - okno_top - okno_novosti.clientHeight - okno_zametki.clientHeight - 30) okno_besedi.style.height = osnova.clientHeight + scrollY - okno_top - okno_novosti.clientHeight - okno_zametki.clientHeight - 30 + 'px';
                    else okno_besedi.style.height = event.clientY - okb + scrollY + 'px';
                }
                okn = okb + okno_besedi.clientHeight + 10;
                okno_novosti.style.top = okn + 'px';
                okz = okn + okno_novosti.clientHeight + 10;
                okno_zametki.style.top = okz + 'px';
            } else if (deform_okno_novosti_down) {
                if (event.clientY - okn + scrollY < okgran) okno_novosti.style.height = okgran + 'px';
                else {
                    if (event.clientY - okn + scrollY > osnova.clientHeight + scrollY - okno_top - okno_besedi.clientHeight - okno_zametki.clientHeight - 30) okno_novosti.style.height = osnova.clientHeight + scrollY - okno_top - okno_besedi.clientHeight - okno_zametki.clientHeight - 30 + 'px';
                    else okno_novosti.style.height = event.clientY - okn + scrollY + 'px';
                }
                okz = okn + okno_novosti.clientHeight + 10;
                okno_zametki.style.top = okz + 'px';
            } else if (deform_okno_zametki_down) {
                if (event.clientY - okz + scrollY < okgran) okno_zametki.style.height = okgran + 'px';
                else {
                    if (event.clientY - okz + scrollY > osnova.clientHeight + scrollY - okno_top - okno_besedi.clientHeight - okno_novosti.clientHeight - 30) okno_zametki.style.height = osnova.clientHeight + scrollY - okno_top - okno_besedi.clientHeight - okno_novosti.clientHeight - 30 + 'px';
                    else okno_zametki.style.height = event.clientY - okz + scrollY + 'px';
                }

            }

            break;
        case 4://down
            if (event.clientX > osnova.clientWidth - okno_besedi.clientWidth && event.clientX < osnova.clientWidth - 10) {
                if (event.clientY > okb - scrollY + okno_besedi.clientHeight - 5 && event.clientY < okb - scrollY + okno_besedi.clientHeight + 5) deform_okno_besedi_down = true;
                else if (event.clientY > okn - scrollY + okno_novosti.clientHeight - 5 && event.clientY < okn - scrollY + okno_novosti.clientHeight + 5) deform_okno_novosti_down = true;
                else if (event.clientY > okz - scrollY + okno_zametki.clientHeight - 5 && event.clientY < okz - scrollY + okno_zametki.clientHeight + 5) deform_okno_zametki_down = true;
                event.returnValue = false;
            }
            break;
        case 5://up

            if (deform_okno_besedi_down) {
                deform_okno_besedi_down = false;
                localStorage.setItem('o_b', okno_besedi.style.height);
            }
            if (deform_okno_novosti_down) {
                deform_okno_novosti_down = false;
                localStorage.setItem('o_n', okno_novosti.style.height);
            }
            if (deform_okno_zametki_down) {
                deform_okno_zametki_down = false;
                localStorage.setItem('o_z', okno_zametki.style.height);
            }
            event.returnValue = true;
            break;
    }
}
//=================================================================================================
function top_ok(idnomer) {
    switch (idnomer) {
        //besedi
        case 0: idnomer = okno_besedi.style.top.slice(0, okno_besedi.style.top.length - 2); break;
        //novosti
        case 1: idnomer = okno_novosti.style.top.slice(0, okno_novosti.style.top.length - 2); break;
        //pometki
        case 2: idnomer = okno_zametki.style.top.slice(0, okno_zametki.style.top.length - 2); break;

    }
    idnomer -= 0;
    return idnomer;
}
//=================================================================================================
function okno_vidimost(vidimo) {
    //okno_besedi.style.visibility = okno_name_besedi.style.visibility = okno_text_besedi.style.visibility =
    //    okno_novosti.style.visibility = okno_name_novosti.style.visibility = okno_text_novosti.style.visibility =
    //    okno_zametki.style.visibility = okno_name_zametki.style.visibility = okno_text_zametki.style.visibility = vidimo == 0 ? 'visible' : 'hidden';

}
//=================================================================================================
function kn_nazad_(deistvie) {
    color_kn = '#5080b0';
    color_videl = '#80b0e0';
    switch (deistvie) {
        case 1://over
            kn_nazad.style.backgroundColor = color_videl;
            kn_nazad.style.cursor = 'default';
            break;
        case 2://out
            kn_nazad.style.backgroundColor = color_kn;
            break;
        case 3://move

            break;
        case 4://douwn
            kn_nazad.style.visibility = 'hidden';
            scroll(0, 0);


            break;

    }
}

//=================================================================================================
function kn_okna_videlen(deistvie, idnomer) {
    ne_videl_kn = '#40a0d0';
    videl_kn = '#90e0ff';
    nagatay_kn = '#ffe0a0';
    ne_videl_ris = '#c0ffe0';
    switch (idnomer) {
        case 0: odin_kn = svert_1; odin_dr = svert_1_a; break;
        case 1: odin_kn = svert_2; odin_dr = svert_2_a; break;
        case 2: odin_kn = svert_3; odin_dr = svert_3_a; break;
        case 3: odin_kn = na_meste_1; odin_dr = na_meste_1_a; break;
        case 4: odin_kn = na_meste_2; odin_dr = na_meste_2_a; break;
        case 5: odin_kn = na_meste_3; odin_dr = na_meste_3_a; break;
    }
    switch (deistvie) {
        //-----------------------------------------------------------------------------------------
        case 1://over
            odin_kn.style.backgroundColor = videl_kn;
            odin_dr.style.backgroundColor = ne_videl_kn;
            break;
        //-----------------------------------------------------------------------------------------
        case 2://out
            odin_kn.style.backgroundColor = ne_videl_kn;
            odin_dr.style.backgroundColor = ne_videl_ris;
            break;
        //-----------------------------------------------------------------------------------------
        case 4://down
            okno_svert = 210;

            break;
        //-----------------------------------------------------------------------------------------
    }
}
//=================================================================================================
function p_videlen(deystvie, idnomer) {
    videl_chast = '#6080c0';
    ne_videl_chast = '#a0c0ff';
    videl_text = '#c0e0ff';
    ne_videl_text = '#104070';
    odin_og = document.getElementById("p_" + idnomer);
    switch (deystvie) {
        //-----------------------------------------------------------------------------------------
        case 1://over
            odin_og.style.cursor = 'pointer';
                odin_og.style.backgroundColor = videl_chast;
                odin_og.style.color = videl_text;
            break;
        //-----------------------------------------------------------------------------------------
        case 2://out
                odin_og.style.backgroundColor = ne_videl_chast;
                odin_og.style.color = ne_videl_text;
            break;
        //-----------------------------------------------------------------------------------------
        case 4://down

                event.returnValue = false;

                perem = odin_og.style.top.slice(0, odin_og.style.top.length - 2)-0+200;
                ten_vibronogo_p.style.top = perem - 5 + 'px';
               perem -= 6;
               ogl_vibrono_copiy.style.top = perem + 'px';
               ogl_vibrono_copiy.innerHTML = odin_og.innerHTML;
                localStorage.setItem('n_r', (idnomer));
                document.getElementById('t_s').innerHTML = array_text[localStorage.getItem('p_m')][localStorage.getItem('r_p')-1][localStorage.getItem('n_r')][0];
            array_text[0][5][0][0] = "<p>" + localStorage.getItem('n_n') + "</p> <div id='pamyt_" + localStorage.getItem('n_n') + "' class='reshenie'onmousedown='on_pamyt(" + localStorage.getItem('p_m') + "," + localStorage.getItem('r_p') + "," + idnomer + ")'> " + array_menu[0][localStorage.getItem('p_m')] + ' / ' + array_menu[localStorage.getItem('p_m') - 0 + 1][localStorage.getItem('r_p') - 1] + ' / ' + array_razd_p[localStorage.getItem('p_m')][localStorage.getItem('r_p') - 1][idnomer] + '</div>' + array_text[0][5][0][0];
                localStorage.setItem('n_n', localStorage.getItem('n_n') - 0 + 1);

                okna.style.height = limit + stranica.clientHeight + 'px';
                odin_og = document.getElementById('p_' + ogl_vibrono);
                odin_og.style.visibility = 'visible';
                odin_og.style.backgroundColor = ne_videl_chast;
                odin_og.style.color = ne_videl_text;
                ogl_vibrono = idnomer;
            break;
        //-----------------------------------------------------------------------------------------   
    }
}
//=================================================================================================

random_plus = 0;
function self_random(nachalo = 1, konec = 2) {
    d = new Date();
    otvet = konec - nachalo;
    otvet = nachalo + d.getSeconds() % otvet;
    //if (random_plus == 0) random_plus = 1; else random_plus = 0;
    return otvet;
}
//=================================================================================================
function menu_vis(id_el, deistvie) {
    

    if (deistvie == 0) deistvie = 'hidden'; else deistvie = 'visible';
    for (i = 0; i < ms[id_el][1]; i++) document.getElementById(ms[id_el][0] + '_' + i).style.visibility = deistvie;
        
    for (i = 0; i < ms[id_el][3]; i++) { document.getElementById(ms[id_el][0] + '_l_' + i).style.visibility = deistvie;  }
    
    ten_m.style.height = (ms[id_el][1] - 1) * text_size - 5 + 'px';
    ten_m.style.left = ms[id_el][2] + 'px';
    ten_m.style.width = document.getElementById(ms[id_el][0] + '_0').clientWidth + 2 + 'px';
    ten_m.style.visibility = deistvie;
}
//=================================================================================================
function menu_(deistvie, nomer, idnomer) {
    //---------------------------------------------------------------------------------------------
    color_okna = "#a0d0ff";
    color_nadpisi = "#607090";
    color_videl = "#f0ffc0";
    color_menu = menu.style.backgroundColor;
    //---------------------------------------------------------------------------------------------
    m = [];
    event.returnValue = true;
    m[0] = document.getElementById(ms[idnomer][0]);
    for (i = 1; i < ms[idnomer][1] + 1; i++) m[i] = document.getElementById(ms[idnomer][0] + '_' + (i - 1));
    //---------------------------------------------------------------------------------------------
    switch (deistvie) {
        //-----------------------------------------------------------------------------------------
        case 1://over
            if (nomer == 0) {

                m[0].style.cursor = 'pointer';
                m[0].style.backgroundColor = color_nadpisi;
                m[0].style.color = color_videl;
                if (idnomer != 0 && m_g_0.style.visibility == 'visible') menu_vis(0,0);
                else if (idnomer != 1 && m_y_0.style.visibility == 'visible') menu_vis(1,0);
                else if (idnomer != 2 && m_os_0.style.visibility == 'visible') menu_vis(2,0);
                else if (idnomer != 3 && m_s_0.style.visibility == 'visible') menu_vis(3,0);
                menu_vis(idnomer, 1);
            }
            else if (nomer == 1) {
                m[1].style.cursor = 'pointer';
                m[0].style.backgroundColor = color_nadpisi;
                m[0].style.color = color_videl;
            }
            else m[nomer].style.backgroundColor = color_videl;
            break;
        //-----------------------------------------------------------------------------------------
        case 2://out
            if (nomer < 2) {
                m[0].style.cursor = 'default';
                m[0].style.color = 'black';
                m[0].style.backgroundColor = color_menu;
                if (event.clientY < 44) menu_vis(idnomer,0);
            }
            else {
                m[nomer].style.backgroundColor = color_okna;
                m[nomer].style.color = 'black';
            }
            break;
        //-----------------------------------------------------------------------------------------
        case 3://move
            if (nomer == 0) {
                if (idnomer == 0 && m_g_0.style.visibility == 'hidden') menu_vis(0, 1);
                else if (idnomer == 1 && m_y_0.style.visibility == 'hidden') menu_vis(1, 1);
                else if (idnomer == 2 && m_os_0.style.visibility == 'hidden') menu_vis(2, 1);
                else if (idnomer == 3 && m_s_0.style.visibility == 'hidden') menu_vis(3, 1);
            }
            else {
                if (m_g_0.style.visibility == 'visible') { if (event.clientY > (ms[0][1] + 1) * text_size - 28 || event.clientX < ms[0][2] + 2 || event.clientX > ms[0][2] + document.getElementById(ms[0][0] + '_0').clientWidth - 4) menu_vis(0,0); }
                if (m_y_0.style.visibility == 'visible') { if (event.clientY > (ms[1][1] + 1) * text_size - 28 || event.clientX < ms[1][2] + 2 || event.clientX > ms[1][2] + document.getElementById(ms[1][0] + '_0').clientWidth - 4) menu_vis(1,0); }
                if (m_os_0.style.visibility == 'visible') { if (event.clientY > (ms[2][1] + 1) * text_size - 28 || event.clientX < ms[2][2] + 2 || event.clientX > ms[2][2] + document.getElementById(ms[2][0] + '_0').clientWidth - 4) menu_vis(2,0); }
                if (m_s_0.style.visibility == 'visible') { if (event.clientY > (ms[3][1] + 1) * text_size - 28 || event.clientX < ms[3][2] + 2 || event.clientX > ms[3][2] + document.getElementById(ms[3][0] + '_0').clientWidth - 4) menu_vis(3,0); }
            }
            break;
        //-----------------------------------------------------------------------------------------
        case 4://down
            m[nomer].style.backgroundColor = 'black';
            m[nomer].style.color = color_videl;
            if (idnomer < 4) localStorage.setItem('p_m', idnomer);
            

            localStorage.setItem('r_p', nomer - 1);
            localStorage.setItem('n_r', 0);
            

            ogl_vibrono = 0;
            menu_vis(idnomer, 0);
            
            
            document.getElementById('t_s').innerHTML = array_text[idnomer][nomer-2][0][0];
            //bob.innerHTML = 'aaa';
            array_text[0][5][0][0] = "<p>" + localStorage.getItem('n_n') + "</p> <div id='pamyt_" + localStorage.getItem('n_n') + "' class='reshenie'onmousedown='on_pamyt(" + localStorage.getItem('p_m') + "," + localStorage.getItem('r_p') + "," + localStorage.getItem('n_r') + ")'>" + array_menu[0][idnomer] + ' / ' + array_menu[idnomer + 1][nomer - 2] + ' / ' + array_razd_p[idnomer][nomer - 2][0] + '</div > ' + array_text[0][5][0][0];
            localStorage.setItem('n_n', localStorage.getItem('n_n') - 0 + 1);
            
            if (idnomer == 0 && nomer == 7) {
                array_text[0][5][0][0] = nachalo_istorii + array_text[0][5][0][0];
                nachalo_napisano = true;
            }
            soderg_razdela();
            document.getElementById('razdel_teni').innerHTML = document.getElementById('razdel').innerHTML = array_menu[idnomer + 1][nomer - 2];
            break;
        //-----------------------------------------------------------------------------------------
    }
}
//=================================================================================================
function on_pamyt(elm, elp, elr) {


    if (elm == 0 && elp == 6 && elr == 0) { } else {
        array_text[0][5][0][0] = "<p>" + localStorage.getItem('n_n') + "</p> <div id='pamyt_" + localStorage.getItem('n_n') + "' class='reshenie'onmousedown='on_pamyt(" + elm + "," + elp + "," + elr + ")'>" + array_menu[0][elm] + ' / ' + array_menu[elm - 0 + 1][elp - 1] + ' / ' + array_razd_p[elm][elp - 1][elr] + '</div > ' + array_text[0][5][0][0];
        localStorage.setItem('n_n', localStorage.getItem('n_n') - 0 + 1);
        localStorage.setItem('p_m', elm);
        localStorage.setItem('r_p', elp);
        localStorage.setItem('n_r', elr);
        soderg_razdela();
        document.getElementById('razdel_teni').innerHTML = document.getElementById('razdel').innerHTML = array_menu[elm - 0 + 1][elp - 1];
        scroll(0, 0);
        document.getElementById('t_s').innerHTML = array_text[elm][elp-1][elr][0];
    }
}
//=================================================================================================
function on_paragraf_time(deistvie,n_menu,n_punkt,n_razdel,nomer) {
    switch (deistvie)
    {
        case 0://over
            document.getElementById('tt_' + n_menu + '_' + n_punkt + '_' + n_razdel + '_' + nomer).style.display = 'block';
            document.getElementById('tt_' + n_menu + '_' + n_punkt + '_' + n_razdel + '_' + nomer + '_telo').innerHTML = '';
            break;
        case 4:
            document.getElementById('tt_' + n_menu + '_' + n_punkt + '_' + n_razdel + '_' + nomer).style.display = 'block';
            document.getElementById('tt_' + n_menu + '_' + n_punkt + '_' + n_razdel + '_' + nomer +'_telo').innerHTML = '';
            break;
    }
}

//=================================================================================================
function on_paragraf(deistvie, n_menu,n_punkt,n_razdel,nomer) {
    n_menu_punkt_razdel = '_' + n_menu + '_' + n_punkt + '_' + n_razdel + '_'+nomer;
    idnom = document.getElementById('tt' + n_menu_punkt_razdel);
    switch (deistvie) {
        case 1://over
            idnom.style.background = '#ffd0c0';
            idnom.style.color = '#a01000';
            break;
        case 2://out
            idnom.style.background = '#ffb0a0';
            idnom.style.color = 'black';
            break;
        case 3://over v
            document.getElementById('tt' + n_menu_punkt_razdel + '_v').style.background = '#605040';
            break;
        case 4://out v
            document.getElementById('tt' + n_menu_punkt_razdel + '_v').style.background = 'black';
            break;
    }
}
//=================================================================================================
function on_tt_0_0_2(nomer) {
    str = "<hr width='100%'size='2'color='black'/>";
    if (nomer < 6) {
        for (i = 0; i < 6; i++) {
            if (nomer != i)
            {//здесь надо вставить медленное убирание открытого блока 'tt_'+i+'_telo'
                on_paragraf_time(0,0,0,2, i);
            }
        }

        if (nomer < 4) {
            switch (nomer) {
                case 0: paragraf_nachalo = 6; break;
                case 1: paragraf_nachalo = 13; break;
                case 2: paragraf_nachalo = 33; break;
                case 3: paragraf_nachalo = 36; break;
            }
            pamyt_paragraf_nachalo = paragraf_nachalo;
            for (i = 0; i < array_menu[nomer + 1].length; i++) {
                str += "<ul><li><div id='tt_0_0_2_" + paragraf_nachalo + "' class='paragraf' onmousedown='on_tt_0_0_2(" + paragraf_nachalo + ")'onmouseover='on_paragraf(1,0,0,2," + paragraf_nachalo + ")'onmouseout='on_paragraf(2,0,0,2," + paragraf_nachalo + ")'>" + array_menu[nomer + 1][i] + "</div><div id='tt_0_0_2_" + paragraf_nachalo + "_telo'></div></li></ul><p>";
                paragraf_nachalo++;
            }
            paragraf_konec = paragraf_nachalo;
            paragraf_nachalo = pamyt_paragraf_nachalo;
        } else str += array_text[0][0][2][36+nomer] + "</p>";
    } else {
        for (i = paragraf_nachalo; i < paragraf_konec; i++) {
              if (nomer != i) {//здесь надо вставить медленное убирание открытого блока 'tt_'+i+'_telo'
                on_paragraf_time(0,0,0,2, i);
            }
        }
        str += array_text[0][0][2][nomer-5] + "</p>";
    }
    str += "<hr width='100%'size='2'color='black'/>"
    document.getElementById('tt_0_0_2_' + nomer + '_telo').innerHTML = "<div id='tt_0_0_2_" + nomer + "_v' class='paragraf_v'onmouseover='on_paragraf(3,0,0,2," + nomer + ")'onmouseout='on_paragraf(4,0,0,2," + nomer + ")' onmousedown='on_paragraf_time(4,0,0,2," + nomer + ")'>" + document.getElementById('tt_0_0_2_' + nomer).innerText + "</div>" + str;
    document.getElementById('tt_0_0_2_' + nomer).style.display = 'none';
}
//=================================================================================================
function on_tt_0_0_3(nomer) {
}
//=================================================================================================
function on_reshenie(nomer) {
    if (nomer < 11) { elm = 0; elp = nomer - 3; }
    else if (nomer < 31) { elm = 1; elp = nomer - 10; }
    else if (nomer < 34) { elm = 2; elp = nomer - 30; }
    else { elm = 3; elp = nomer - 33; }
    elr = 0;
    array_text[0][5][0][0] = "<p>" + localStorage.getItem('n_n') + "</p> <div id='pamyt_" + localStorage.getItem('n_n') + "' class='reshenie'onmousedown='on_pamyt(" + elm + "," + elp + "," + elr + ")'>" + array_menu[0][elm] + ' / ' + array_menu[elm - 0 + 1][elp - 1] + ' / ' + array_razd_p[elm][elp - 1][elr] + '</div > ' + array_text[0][5][0][0];
    localStorage.setItem('n_n', localStorage.getItem('n_n') - 0 + 1);
    localStorage.setItem('p_m', elm);
    localStorage.setItem('r_p', elp);
    localStorage.setItem('n_r', elr);
    soderg_razdela();
    document.getElementById('razdel_teni').innerHTML = document.getElementById('razdel').innerHTML = array_menu[elm - 0 + 1][elp - 1];
    scroll(0, 0);
    document.getElementById('t_s').innerHTML = array_text[elm][elp-1][elr][0];
}
//=================================================================================================
function soderg_razdela() {
    t = 50;
    text_size = 35;
    if (localStorage.getItem('n_r')) { } else localStorage.setItem('n_r', 0);
    ogl_vibrono = localStorage.getItem('n_r');
    //---------------------------------------------------------------------------------------------
    str = "";
    //---------------------------------------------------------------------------------------------
    //кнопка для возвращения назад на верх страницы
    str += "<div id='ten_kn_nazad'></div><div id='kn_nazad'onmouseover='kn_nazad_(1)'onmouseout='kn_nazad_(2)'onmousedown='kn_nazad_(4)'></div>";
    //---------------------------------------------------------------------------------------------
    //подсветка и сами названия содержания страниц
    str += "<div id='soderg_razdela_2'><div id='ten2_gl_p'></div><div id='gl_p'class='c_gl_p'></div>";
    for (i = 0; i < array_razd_p[localStorage.getItem('p_m')][localStorage.getItem('r_p') - 1].length; i++) str += "<div id='tp_" + i + "'class='c_ten_p'></div><div id='p_" + i + "'class='c_p' onmouseover='p_videlen(1, " + i + ")' onmouseout='p_videlen(2," + i + ")' onmousedown='p_videlen(4," + i + ")'></div>";
    str += "<div id='ten2'></div></div><div id='ten_vibronogo_p'></div><div id='ogl_vibrono_copiy'></div>";
    //---------------------------------------------------------------------------------------------
    in_load_2.innerHTML = str;
    if (localStorage.getItem('s_l')) {

    } else localStorage.setItem('s_l', 0);
    stranica_left = localStorage.getItem('s_l')-0 > 0 ? 50 : 125;
    //---------------------------------------------------------------------------------------------
    //кнопка для возвращения назад на верх страницы
    kn_nazad.innerHTML = '^';
    ten_kn_nazad.style.visibility = kn_nazad.style.visibility = 'hidden';
    ten_kn_nazad.style.left = kn_nazad.style.left = stranica.clientWidth + 105 + 'px';
    ten_kn_nazad.style.top = kn_nazad.style.top = osnova.clientHeight - 80 + 'px';
    //---------------------------------------------------------------------------------------------
    //содержимое раздела по пунктам
    for (i = 0; i < array_razd_p[localStorage.getItem('p_m')][localStorage.getItem('r_p')-1].length; i++) {
        odin_og = document.getElementById("p_" + i);
        odin_og.innerHTML = array_razd_p[localStorage.getItem('p_m')][localStorage.getItem('r_p')-1][i];
        if (ogl_vibrono == i) {
            ogl_vibrono_copiy.innerHTML = odin_og.innerHTML;
            ogl_vibrono_copiy.style.top = 200 + t - 4 + 'px';
            ogl_vibrono_copiy.style.width = soderg_razdela_1.clientWidth -80 + 'px';
            ten_vibronogo_p.style.left = ogl_vibrono_copiy.style.left;
            ten_vibronogo_p.style.width = soderg_razdela_1.clientWidth - 70 + 'px';
            ten_vibronogo_p.style.top =200+ t -3+ 'px';
            ten_vibronogo_p.style.height = ogl_vibrono_copiy.clientHeight + 5 + 'px';
            perem = t + 5 + 'px';
            
        } 
        perem = odin_og.style.top = t + 'px';
        odin_og.style.width = soderg_razdela_1.clientWidth - 120 + 'px';
            
        
        odin_ogt = document.getElementById("tp_" + i);
        odin_ogt.style.top = perem;
        odin_ogt.style.left = soderg_razdela_1.clientWidth - 56 + 'px';
        t += odin_og.clientHeight + 15;
    }

    gl_p.innerHTML = "Содержимое раздела: <div id='kn_za_str' onmouseover='kn_za_str_(1)' onmouseout='kn_za_str_(2)' onmousedown='kn_za_str_(4)'></div>";
    gl_p.style.visibility = 'visible';
    gl_p_za_str.style.visibility = 'hidden';
    gl_p_za_str.style.height = gl_p.style.height = t  + 'px';
    soderg_razdela_2.style.height = soderg_razdela_1.style.height = gl_p_za_str.clientHeight + 10 + 'px';
    gl_p.style.width = soderg_razdela_1.clientWidth-100 + 'px';
    soderg_razdela_2.style.width = soderg_razdela_1.clientWidth+100 + 'px';
    text_stranici.style.paddingTop = gl_p.clientHeight / 2 + 100 + 'px';
    ten1_gl_p.style.position = ten2_gl_p.style.position = 'absolute';
    ten1_gl_p.style.left = ten2_gl_p.style.left = '30px';
    ten1_gl_p.style.top = '202px';
    ten2_gl_p.style.top = '2px';
    ten1_gl_p.style.width = ten2_gl_p.style.width = gl_p.clientWidth + 2 + 'px';
    ten1_gl_p.style.height = ten2_gl_p.style.height = gl_p.clientHeight + 'px';
    ten1_gl_p.style.backgroundColor = ten2_gl_p.style.backgroundColor = 'black';
    ten1_gl_p.style.borderRadius = ten2_gl_p.style.borderRadius = '10px';
    ten1_gl_p.style.filter = 'blur(12px)';
    ten2_gl_p.style.filter = 'blur(2px)';
    //---------------------------------------------------------------------------------------------
    //кнопка прячущая за страницу
    kn_za_str.innerHTML = "<div id='ris_kn_za_str'></div><div id='ris_min'></div><div id='ris_v'></div><div id='ris_str'></div>";
    ris_v.innerHTML ='v';
    kn_za_str.style.left = gl_p.clientWidth - 70 + 'px';
}
//=================================================================================================
function okna_umen() {
    if (osnova.clientHeight < okno_top + okno_besedi.clientHeight + okno_novosti.clientHeight + okno_zametki.clientHeight + 30 - scrollY) {
        minus = (okno_top + okno_besedi.clientHeight + okno_novosti.clientHeight + okno_zametki.clientHeight + 30 - osnova.clientHeight - scrollY) / ((okno_besedi.clientHeight <= okgran ? 0 : 1) + (okno_novosti.clientHeight <= okgran ? 0 : 1) + (okno_zametki.clientHeight <= okgran ? 0 : 1));
        plus = 0;
        if (okno_besedi.clientHeight > okgran) {
            if (okno_besedi.clientHeight - minus < okgran) {
                plus = okno_besedi + minus - okgran;
                okno_besedi.style.height = okgran + 'px';
            } else okno_besedi.style.height = okno_besedi.clientHeight - minus + 'px';
        }
        if (okno_novosti.clientHeight > okgran) {
            if (okno_novosti.clientHeight - minus < okgran) {
                plus += okno_novosti + minus - okgran;
                okno_novosti.style.height = okgran + 'px';
            } else okno_novosti.style.height = okno_novosti.clientHeight - minus + 'px';
        }
        if (okno_zametki.clientHeight > okgran) {
            if (okno_zametki.clientHeight - minus < okgran) {
                plus += okno_zametki + minus - okgran;
                okno_zametki.style.height = okgran + 'px';
            } else okno_zametki.style.height = okno_zametki.clientHeight - minus + 'px';
        }
        if (plus != 0) plus /= ((okno_besedi.clientHeight <= okgran ? 0 : 1) + (okno_novosti.clientHeight <= okgran ? 0 : 1) + (okno_zametki.clientHeight <= okgran ? 0 : 1));
        if (okno_besedi.clientHeight > okgran) okno_besedi.style.height = okno_besedi.clientHeight - plus + 'px';
        if (okno_novosti.clientHeight > okgran) okno_novosti.style.height = okno_novosti.clientHeight - plus + 'px';
        if (okno_zametki.clientHeight > okgran) okno_zametki.style.height = okno_zametki.clientHeight - plus + 'px';
    }
    okb = okno_top;
    okno_besedi.style.top = okb + 'px';
    okn = okb + okno_besedi.clientHeight + 10;
    okno_novosti.style.top = okn + 'px';
    okz = okn + okno_novosti.clientHeight + 10;
    okno_zametki.style.top = okz + 'px';
}
//=================================================================================================
function izmen_win() {

    if (staroe_x != innerWidth) {

        m2_left = m1_left + m_g.clientWidth + m_razdelitel.clientWidth + 4;
        m3_left = m2_left + m_y.clientWidth + m_razdelitel.clientWidth + 4;
        m4_left = m3_left + m_os.clientWidth + m_razdelitel.clientWidth + 4;
        ms[1][2] = m2_left;
        ms[2][2] = m3_left;
        ms[3][2] = m4_left;
        //--------------------------------
        m_y_0.style.left = m2_left + 'px';
        m_os_0.style.left = m3_left + 'px';
        m_s_0.style.left = m4_left + 'px';
        if (m_g_0.clientWidth <= m_g.clientWidth) m_g_0.style.width = m_g.clientWidth + 10 + 'px';
        else if (m_g_0.clientWidth > menu_width) m_g_0.style.width = menu_width + 'px';
        if (m_y_0.clientWidth <= m_y.clientWidth) m_y_0.style.width = m_y.clientWidth + 10 + 'px';
        else if (m_y_0.clientWidth > menu_width) m_y_0.style.width = menu_width + 'px';
        if (m_os_0.clientWidth <= m_os.clientWidth) m_os_0.style.width = m_os.clientWidth + 10 + 'px';
        else if (m_os_0.clientWidth > menu_width) m_os_0.style.width = menu_width + 'px';
        if (m_s_0.clientWidth <= m_s.clientWidth) m_s_0.style.width = m_s.clientWidth + 10 + 'px';
        else if (m_s_0.clientWidth > menu_width) m_s_0.style.width = menu_width + 'px';
        //-----------------------------------------------------------------------------------

        stranica.style.width = osnova.clientWidth - okna.clientWidth - 135 + 'px';
        ten_stranici.style.width = stranica.clientWidth + 'px';
        dvigenie_paneli.style.left = osnova.clientWidth - okna.clientWidth - 10 + 'px';
        
        ten_kn_nazad.style.left = kn_nazad.style.left = stranica.clientWidth + 105 + 'px';
        okna.style.left = stranica.clientWidth + 135 + 'px';
        //-----------------------------------------------------------------------------------
        staroe_x = innerWidth;
    }
    if (staroe_y != innerHeight) {
        if (staroe_y > innerHeight) {
            okna_umen();
        } else if (osnova.clientHeight > 165 + okno_top - scrollY && okno_besedi.style.visibility == 'hidden') {
            if (okno_besedi.clientHeight < 45) okno_besedi.style.height = '45px';
            if (okno_novosti.clientHeight < 45) okno_novosti.style.height = '45px';
            if (okno_zametki.clientHeight < 45) okno_zametki.style.height = '45px';
        }
        if (localStorage.getItem('l_p')) {
            if (localStorage.getItem('l_p') == 0) ten_kn_prydki.style.visibility = kn_prydki.style.visibility = 'hidden';
            else ten_kn_prydki.style.visibility = kn_prydki.style.visibility = 'visible';
        } else {
            ten_kn_prydki.style.visibility = kn_prydki.style.visibility = 'hidden'; localStorage.setItem('l_p', 0);
        }
        ten_line_pomoshnik.style.visibility = 'visible';
        line_pomoshnik.style.visibility = 'visible';
        ten_pomoshnika.style.visibility = 'visible';
        pomoshnik.style.visibility = 'visible';

        ten_kn_nazad.style.top = kn_nazad.style.top = osnova.clientHeight - 80 + scrollY + 'px';
        line_pomoshnik.style.top = innerHeight - 60 + 'px';
        ten_line_pomoshnik.style.top = innerHeight - 70 + 'px';
        sleva.style.top = innerHeight - 220 + 'px';
        ten_kn_prydki.style.top = innerHeight - 60 + 'px';
        kn_prydki.style.top = innerHeight - 64 + 'px';
        staroe_y = innerHeight;
    }
    if (scrollY) {
        if (scrollY > 100 && kn_nazad_vidna == false) {
            kn_nazad_vidna = true;
            ten_kn_nazad.style.visibility = kn_nazad.style.visibility = 'visible';
        }
        if (kn_nazad_vidna) ten_kn_nazad.style.top = kn_nazad.style.top = osnova.clientHeight - 80 + scrollY + 'px';
        line_pomoshnik.style.top = innerHeight- 73 + scrollY + 'px';
        ten_line_pomoshnik.style.top = innerHeight - 60 + scrollY + 'px';
        sleva.style.top = innerHeight -220+ scrollY + 'px';
        ten_kn_prydki.style.top = innerHeight - 60 + scrollY + 'px';
            kn_prydki.style.top = innerHeight - 64 + scrollY + 'px';
        ten_stranici.style.height = stranica.clientHeight + 'px';
        okna.style.height = limit + stranica.clientHeight + 'px';

        if (scrollY > 150) {
            okno_top = 60 + scrollY;
            dvigenie_paneli.style.top = okno_top - 50 + 'px';
            okb = okno_top;
            okno_besedi.style.top = okb + 'px';
            okn = okb + okno_besedi.clientHeight + 10;
            okno_novosti.style.top = okn + 'px';
            okz = okn + okno_novosti.clientHeight + 10;
            okno_zametki.style.top = okz + 'px';
        } else {
            okno_top = 210;
            dvigenie_paneli.style.top = okno_top - 60 + 'px';
            okna_umen();
        }
        if (localStorage.getItem('l_p')) {
            if (localStorage.getItem('l_p') == 0) ten_kn_prydki.style.visibility = kn_prydki.style.visibility = 'hidden';
            else ten_kn_prydki.style.visibility = kn_prydki.style.visibility = 'visible';
        } else {
            ten_kn_prydki.style.visibility = kn_prydki.style.visibility = 'hidden'; localStorage.setItem('l_p', 0);
        }
        ten_line_pomoshnik.style.visibility = 'visible';
        line_pomoshnik.style.visibility = 'visible';
        ten_pomoshnika.style.visibility = 'visible';
        pomoshnik.style.visibility = 'visible';

        posle_scroll = true;
    } else if (posle_scroll && scrollY < 2) {
        posle_scroll = false;
        kn_nazad_vidna = false;
        ten_kn_nazad.style.visibility = kn_nazad.style.visibility = 'hidden';
        ten_kn_prydki.style.top = innerHeight - 60 + scrollY + 'px';
        kn_prydki.style.top = innerHeight - 64 + scrollY + 'px';

        line_pomoshnik.style.top = innerHeight - 73 + 'px';
        ten_line_pomoshnik.style.top = innerHeight - 60 + 'px';

        sleva.style.top = innerHeight -220 + 'px';
        menu_line.style.height = '55px';

        okno_top = 210;
        okna.style.top = menu.style.top = '0px';
        m_g_0.style.top = m_y_0.style.top = m_os_0.style.top = m_s_0.style.top = '44px';
        ten_m.style.top = '60px';
        ten_menu.style.top = '55px';
        name_sait1.style.top = name_sait1_teni.style.top = '60px';
        name_sait2.style.top = name_sait2_teni.style.top = '120px';
        dvigenie_paneli.style.top = '160px';
        okno_besedi.style.top = '210px';
        okno_novosti.style.top = okno_top + okno_besedi.clientHeight + 10 + scrollY + 'px';
        okno_zametki.style.top = okno_top + okno_besedi.clientHeight + okno_novosti.clientHeight + 20 + scrollY + 'px';
        if (localStorage.getItem('l_p')) {
            if (localStorage.getItem('l_p') == 0) ten_kn_prydki.style.visibility = kn_prydki.style.visibility = 'hidden';
            else ten_kn_prydki.style.visibility = kn_prydki.style.visibility = 'visible';
        } else { ten_kn_prydki.style.visibility = kn_prydki.style.visibility = 'hidden'; localStorage.setItem('l_p', 0); }
        ten_line_pomoshnik.style.visibility = 'visible';
        line_pomoshnik.style.visibility = 'visible';
        ten_pomoshnika.style.visibility = 'visible';
        pomoshnik.style.visibility = 'visible';

    }
    setTimeout('izmen_win()', 4);
}
//=================================================================================================
