
//=================================================================================================
array_name_sait = ["Творчество", "во всём!"];
predupregd = 'Сайт находится в разработке';
//=================================================================================================
array_menu = [["Главное", "Обучение", "Обсуждение", "Справка"],
["От создателя сайта", "Чего новенького", "Люди-умельцы", "Творческие работы", "Поиск по сайту", "История просмотра", "Регистрация"],
["Обучение от умельцев", "Творчество", "Программирование", "Алгебра и Геометрия", "Физика", "Химия", "Биология", "История", "География", "Обществознание", "Экономика", "Литература", "Языки стран мира", "Астрономия", "Черчение", "Музыка", "Физкультура", "Для дошколят", "Энциклопедии","Атласы","Законы и кодексы", "Заметки"],
["Беседы", "Предложения/критика", "Написать письмо"],
["Инструкция по сайту", "Донаты", "Об авторе сайта"]];
//=================================================================================================
array_razd_p = [[
    ['Приветствие', 'Особенности сайта', 'Содержимое сайта', 'Настройки сайта'],
    ['Все новости', 'Об умельцах', 'Об обучении', 'По выбранной категории'],
    ['Список с начала', 'Список с конца', 'Список по алфавиту', 'По скорости выполнения работ', 'Как стать участником нашей группы', 'Запись в группу "Люди-умельцы"'],
    ['Все изделия', 'Работы по категории творчества', 'Категории применяемости в быту', 'Выстовочные работы'],
    ['Искать везде', 'Только среди умельцев', 'Среди творческих работ', 'По названию статей и параграфов', 'По тексту','Результаты поиска за посещение'],
    ['Ваша история просмотра страниц', 'Уточнения по данному вопросу'],
    ['Зачем нужна регистрация', 'Что входит в регистрацию', 'Регистрация']
], [
    ['Обучающие уроки по мере поступления', 'Обучение от конкретного мастера', 'Обучение по категориям творчества', 'Схемы и картинки от умельцев', 'Особености данного обучения'],
    ['Все, освоенные мною, виды творчества', 'Необходимое для занятий', 'Термины', 'Рисунки, фото, схемы с расшифровкой', 'Особенности данного обучения', 'Используемая литература'],
    ['Всё, что я знаю из программирования', 'Основные понятия языка', 'Директивы, операторы, команды, теги', 'Примеры программ', 'Интересные факты', 'Выдающиеся личности', 'Задачи для самооценки', 'Вопросы для самопроверки', 'Используемая литература', 'Мои мысли о программировании'],
    ['Обучающий курс', 'Теоремы, определения, формулы', 'Графики, таблицы, рисунки', 'Интересные факты', 'Выдающиеся личности', 'Задачи для самооценки', 'Вопросы для самопроверки', 'Используемая литература'],
    ['Обучающий курс', 'Теоремы, определения, формулы', 'Графики, таблицы, рисунки', 'Интересные факты', 'Выдающиеся личности', 'Задачи для самооценки', 'Лабораторные работы', 'Вопросы для самопроверки', 'Используемая литература'],
    ['Обучающий курс', 'Теоремы, определения, формулы', 'Графики, таблицы, рисунки', 'Вещества, их структура и особенности', 'Интересные факты', 'Выдающиеся личности', 'Задачи для самооценки', 'Лабораторные работы', 'Вопросы для самопроверки', 'Используемая литература'],
    ['Обучающий курс', 'Теоремы, определения, формулы', 'Графики, таблицы, рисунки', 'Вещества, их структура и особенности', 'Животные, птицы, пресноводные, насекомые', 'Растения, грибы', 'Интересные факты', 'Выдающиеся личности', 'Задачи для самооценки', 'Лабораторные работы', 'Вопросы для самопроверки', 'Используемая литература'],
    ['Обучающий курс', 'Хронология важнейших событий', 'Политические и военные личности', 'Творческие и научные личности', 'Реформы, войны', 'Культура, быт, религия и обучение', 'Условные обозначения и сокращения', 'Карты', 'Вопросы для самопроверки', 'Используемая литература'],
    ['Обучающий курс', 'Определения, понятия', 'Графики, таблицы, рисунки', 'Обитатели', 'Растения', 'Полезные ископаемые', 'Интересные факты', 'Выдающиеся личности', 'Вопросы для самопроверки', 'Используемая литература'],
    ['Обучающий курс', 'Определения, понятия', 'Графики, таблицы, рисунки', 'Обитатели', 'Растения', 'Полезные ископаемые', 'Интересные факты', 'Выдающиеся личности', 'Вопросы для самопроверки', 'Используемая литература'],
    ['Обучающий курс', 'Определения, понятия, формулы', 'Графики, таблицы, рисунки', 'Денежные курсы', 'Интересные факты', 'Выдающиеся личности', 'Вопросы для самопроверки', 'Используемая литература'],
    ['Обучающий курс', 'Определения', 'Даты и события', 'Стихи и произведения классиков', 'Интересные факты', 'Выдающиеся личности', 'Вопросы для самопроверки', 'Используемая литература'],
    ['Обучающий курс', 'Алфавит, произношения буквосочетаний', 'Правила', 'Местоимения, глаголы, причастия', 'Словарь', 'Интересные факты', 'Выдающиеся личности', 'Вопросы для самопроверки', 'Используемая литература'],
    ['Обучающий курс', 'Теоремы, определения, формулы', 'Атлас неба', 'Планеты', 'Звезды', 'Интересные факты', 'Выдающиеся личности', 'Вопросы для самопроверки', 'Используемая литература'],
    ['Обучающий курс', 'Теоремы, определения, формулы', 'Образцы чертежей', 'Необходимое для черчения', 'Интересные факты', 'Выдающиеся личности', 'Вопросы для самопроверки', 'Используемая литература'],
    ['Обучающий курс', 'Определения', 'Правила держания рук', 'Правила чтение для нот', 'Мелодии классики и эстрады', 'Интересные факты', 'Выдающиеся личности', 'Вопросы для самопроверки', 'Используемая литература'],
    ['Основные правила зарядки', 'Зарядка', 'Правила для игр'],
    ['Обучающие игры для детей', 'Чтение вслух с картинками', 'Родителям на заметку'],
    ['Алфавитный указатель', 'По категориям', 'Толковый словарь'],
    ['Исторический глобус','Географический глобус','Атлас звездного неба','Атлас анатомии человека'],
    ['Конституция Российской Федерации','nkz'],
    ['Все заметки', 'Зачем нужны заметки']
], [
    ['Все беседы', 'Беседы по категориям', 'Ответы от автора сайта'],
    ['Предложения', 'Критика'],
    ['Бланк отправки']
], [
    ['Вся инструкция', 'Меню сайта', 'Содержимое раздела', 'Страница', 'Боковая панель с окнами', 'Смайлик'],
    ['Что такое донаты', 'Отчёт о полученных донатах'],
    ['Вся история', 'Детство и школа', 'Переломный момент', 'Карьерный взлёт']
]

];
array_kn=[
'Поиск будет проводится только в пункте <b>"'+array_razd_p[localStorage.getItem('nm')][localStorage.getItem('nr')-1][localStorage.getItem('np')]+'"</b>: <span id="tm_0"class="metka">(...)</span><p><table width="100%"><tr><td><div id="poisk_str"></div></td><td width="20%"><span id="isk"class="kn_stran"><span id="svet_kn_isk"class="c_svet_okna"></span><span id="svet_nadpisi_isk"class="svet_nadpisi">Искать</span>Искать<span id="ten_kn_isk"class="c_ten_okna"style="top:40px;"></span></span></td></tr></table>'
,' Если необходим более широкий круг поиска, то зайдите в раздел <span id="ts_0_0_0_1"class="ssilka"><b>"Главное > Поиск по сайту".'    
]

array_text =
    [
        [//Главное
            [//0 От создателя сайта
                [//Приветствие
                    //Начальная страница
                    
                    '<h2><b><i>Приветик всем, кто зашёл на мой сайт!</i></b></h2>' +
                    '<table id="ym_0_0_0_0" class="ymelec"onmouseover="on_ym(1,0,0,0,0)"onmouseout="on_ym(2,0,0,0,0)"onmousedown="on_ym_0_0_0(0)"><tr><td><img class="foto_ymelca" src="ym_1_foto_1.jpg"></td><td id="lud_1_name">Меня зовут <big><b>Ильина Людмила.</b></big><p> Я являюсь самостоятельно обученным (без репетиторов) <b><i>программистом, художником и рукодельницей</i></b> (вязание, валяние, резьба по дереву и так далее). </td></tr></table>' +
                    '<p>Создавала этот сайт с нуля для <b>творческого развития</b> и  бесплатного <b>обучения пользователей</b>. Здесь Вы несомненно найдёте много интересной и полезной для себя информации.</p>' +
                    '<p>Этот сайт, скорее всего, не похож на другие. Он полностью соответствует <b>моему</b> представлению о комфортном обучении и наблюдении за творчеством мастеров. </p>' +
                    '<p>В тексте сайта будут встречаться надписи на цветном фоне. Это сделано для большего удобства при чтении. Чтобы ознакомиться с этой нестандартностью более подробно обязательно загляните в пункт <span id="ts_0_0_0_1"class="ssilka" onmouseover="on_ts(1,1)"onmouseout="on_ts(2,1)"onmousedown="on_ts_0_0_0(1)"><b> "Особенности сайта"</b></span> данного раздела.</p> ' +
                    '<p>В кратце расскажу, что обозначают разные цвета фона в тексте с возможностью попробовать их в деле:'+
                    '<ul><li><div id="tp_0_0_0_0_telo"><div id="tp_0_0_0_0" class="paragraf" onmouseover="on_tp(1,0)"onmouseout="on_tp(2,0)"onmousedown="on_tp_0_0_0(0)"><b>розовый</b></div></div> предназначен скрывать пункты списка или текст,</li>'+
                    '<li><span id="tr_0_0_0_0_telo"><span id="tr_0_0_0_0" class="reshenie" onmouseover="on_tr(1,0)"onmouseout="on_tr(2,0)"onmousedown="on_tr_0_0_0(0)"><b>фиолетовый</b></span></span> показывает задания, ответы, пошаговое решение,</li>'+
                    '<li><span id="ts_0_0_0_0_telo"><span id="ts_0_0_0_0" class="ssilka" onmouseover="on_ts(1,0)"onmouseout="on_ts(2,0)"onmousedown="on_ts_0_0_0(0)"><b>голубой</b></span></span> перемещает пользователя в другие разделы (в данном примере не работает),</li>'+
                    '<li><span id="tm_0_0_0_0_telo"><span id="tm_0_0_0_0" class="metka" onmouseover="on_tm(1,0)"onmouseout="on_tm(2,0)"onmousedown="on_tm_0_0_0(0)"><b>салатовый</b></span></span> нужен для пояснения текста, расшифровки сокращений, шпоргалки, </li>'+
                    '<li><span id="ti_0_0_0_0_telo"><span id="ti_0_0_0_0" class="interes" onmouseover="on_ti(1,0)"onmouseout="on_ti(2,0)"onmousedown="on_ti_0_0_0(0)"><b>жёлтый</b></span></span> рассказывает об интересных людях, событиях и фактах.</li></ul>' +
                    
                    '<p>Теперь окунемся в процесс ознакомления с проделанной мною работой.</p>' +
                    '<p>В меню <b>"Главное"</b> создала разделы <span id="ts_0_0_0_2"class="ssilka" onmouseover="on_ts(1,2)"onmouseout="on_ts(2,2)"onmousedown="on_ts_0_0_0(2)"><b>"Люди-умельцы"</b></span> и <span id="ts_0_0_0_3"class="ssilka"onmouseover="on_ts(1,3)"onmouseout="on_ts(2,3)"onmousedown="on_ts_0_0_0(3)"><b>"Творческие работы"</b></span>. Уверена, что ознакомление с ними пробудит в Вас любовь к творчеству. Посещение страниц умельцев в этих разделах может привести к рождению орегинальных идей. По-крайней мере, со мной это точно срабатывает.</p>' +
                    '<p>Здесь Вы сможете найти: </p><p><b><ul><li>различные аккаунты этих людей,</li><li>личные фотографии,</li><li>их работы,</li> <li>обучающие уроки,</li><li>различные, выложенные ими, схемы и рисунки.</li></ul></b></p>' +
                    '<p>Вы узнаете много нового от мастеров своего дела. Труды, маленькие хитрости и другая полезная информация ждут своего пользователя. Ещё предоставляется возможность перейти по ссылкам в аккаунты этих умельцев, чтобы заказать понравившиеся Вам вещи у самих авторов и лично обговорить их цену. </p> ' +
                    '<p>Вы не только будете созирцать на творения других людей, но и сами сможете опубликовывать свои работы. Для этого в разделе <span id="ts_0_0_0_4"class="ssilka"onmouseover="on_ts(1,4)"onmouseout="on_ts(2,4)"onmousedown="on_ts_0_0_0(4)"><b>"Люди-умельцы"</b></span> имеется <span id="ts_0_0_0_5"class="ssilka"onmouseover="on_ts(1,5)"onmouseout="on_ts(2,5)"onmousedown="on_ts_0_0_0(5)">запись в эту группу</span>. От Вас требуется сделать хотя бы одну вещь своими руками и можете вступать в наш дружный коллектив. Но не забывайте, что вся информация от мастеров проходит через меня, и <b>рекламы</b>, не связанной с Вашими работами, <b>я публиковать не буду!</b></p>' +
                    '<p>Проверьте свои знания или научитесь чему-то новому в меню <b>"Обучение"</b>. Здесь находятся:'+
                    '<p><ul><li><span id="ts_0_0_0_6"class="ssilka"onmouseover="on_ts(1,6)"onmouseout="on_ts(2,6)"onmousedown="on_ts_0_0_0(6)"><b>уроки от умельцев,</b></span></li>'+
                    '<li><b> материал, изученный мной в школе и для саморазвития, по книгам и через интернет,</b></li>'+
                    '<li><span id="ts_0_0_0_7"class="ssilka"onmouseover="on_ts(1,7)"onmouseout="on_ts(2,7)"onmousedown="on_ts_0_0_0(7)"><b>литературные произведения,</b></span></li>'+
                    '<li><span id="ts_0_0_0_8"class="ssilka"onmouseover="on_ts(1,8)"onmouseout="on_ts(2,8)"onmousedown="on_ts_0_0_0(8)"><b>энциклопедии,</b></span></li>'+
                    '<li><span id="ts_0_0_0_9"class="ssilka"onmouseover="on_ts(1,9)"onmouseout="on_ts(2,9)"onmousedown="on_ts_0_0_0(9)"><b>атласы и глобусы,</b></span></li>'+
                    '<li><span id="ts_0_0_0_10"class="ssilka"onmouseover="on_ts(1,10)"onmouseout="on_ts(2,10)"onmousedown="on_ts_0_0_0(10)"><b>конституция Российской Федерации, законы, кодексы, правила дорожного движения, составление жалоб</b></span></li>'+
                    '<li><span id="ts_0_0_0_11"class="ssilka"onmouseover="on_ts(1,11)"onmouseout="on_ts(2,11)"onmousedown="on_ts_0_0_0(11)">созданные мной <b>обучающие игры для самых маленьких.</b></span></li></ul></p>' +
                    '<p>Вы должны знать, что я очень люблю учиться. Хочу показать всем, что это не так уж и сложно, и <big><b><i>знаниям все возросты покорны.</i></b></big></p > ' +
                    '<p>Но у меня не совсем обычная структура повествования. Как я писала выше, для удобства обучения, будет попадаться текст написанный на цветном фоне. При нажатии на него открывается дополнительная информация или пользователь переносится в указанное место. </p>' +
                    '<p>Я это сделала для того, чтобы: <p><ol><li><b>уменьшить объём изучаемой информации</b>, сосредоточив внимание на основном тексте,</li><li><b>получить нужные пояснения, шпоргалки</b> именно там, где это необходимо.</li></ol> </p > ' +
                    '<p>Теоремы, законы, определения, формуры и так далее, естественно, остались неизменны. Остальная часть текста изменялась мной для удобства. Если кому-то такой подход непонраву, то прошу прощения. Я не мостак умно изъяснятся и не претендую на авторство, только пересказываю.</p>' +
                    '<p>В каждом разделе из меню <b>"Обучение"</b> имеется пункт <b>"Используемая литература"</b>, где указаны названия прочитанных по теме книг, их авторы и статьи из интернета. Настоятельно рекомендую ознакомится с ними.</p>' +
                    '<p>Сама работаю с большим количеством информации, поэтому прошу меня также простить за:<p><ul><li><b>ошибки,</b> о которых, я надеюсь, Вы сразу  сообщите мне,</li><li><b>незавершённость тем по предметам,</b> которые буду дописывать сразу, как появится на это время,</li><li><b>задержку при вступлении в группу новеньких,</b></li><li><b>замедление в выкладывании свежего материала от умельцев.</b></li></ul></p>' +
                    '<p>Я не метеор, а простая женщина, загруженная другими делами, поэтому всё успевать не смогу. Вы должны меня понять. Все изменения по сайту и его разделам будут отмечаться в меню <span id="ts_0_0_0_12"class="ssilka"onmouseover="on_ts(1,12)"onmouseout="on_ts(2,12)"onmousedown="on_ts_0_0_0(12)"><b>"Главное / Чего новенького"</b></span>.</p>' +
                    '<p>Если появятся вопросы, предложения или критика, то милости прошу в меню <b>"Обсуждение"</b>. Здесь Вы сможете <span id="ts_0_0_0_13"class="ssilka"onmouseover="on_ts(1,13)"onmouseout="on_ts(2,13)"onmousedown="on_ts_0_0_0(13)">пообщаться</span> с другими пользователями или <span id="ts_0_0_0_14"class="ssilka"onmouseover="on_ts(1,14)"onmouseout="on_ts(2,14)"onmousedown="on_ts_0_0_0(14)">написать письмо</span> лично мне. При наборе текста в разделе <span id="ts_0_0_0_15"class="ssilka"onmouseover="on_ts(1,15)"onmouseout="on_ts(2,15)"onmousedown="on_ts_0_0_0(15)"><b>"Беседы"</b></span>, пожалуйста, фильтруйте свою речь, так как Ваше высказывание автоматически записывается в файл и не контролируется мной. Зато шифрование здесь тоже не используется, и Ваша запись легко может быть проверена правохранительными органами, если поступит на Вас жалоба в соответствующие инстанции. <b>Поэтому сильно не балуйтесь!!! /:(</b></p>' +
                    '<p>Были описаны не все разделы меню. Если хотите получить более подробную информацию, то перейдите в пункты <span id="ts_0_0_0_16"class="ssilka"onmouseover="on_ts(1,16)"onmouseout="on_ts(2,16)"onmousedown="on_ts_0_0_0(16)"><b>"Особенности сайта"</b></span> и <span id="ts_0_0_0_17"class="ssilka"onmouseover="on_ts(1,17)"onmouseout="on_ts(2,17)"onmousedown="on_ts_0_0_0(17)"><b>"Содержимое сайта"</b></span> данного раздела. Если же Вас интересует как работает весь сайта, то Вы можете зайти в меню <span id="ts_0_0_0_18"class="ssilka"onmouseover="on_ts(1,18)"onmouseout="on_ts(2,18)"onmousedown="on_ts_0_0_0(18)"><b>"Справка / Инструкция по сайту"</b></span>.</p>' +
                    '<p>Отдельно хочу остановиться на моём помошнике <b>Смайлике</b>. Этот солнечный блинчик можно перетаскивать по браузеру, отпускать и смотреть что будет... А если пользователь задержится на сайте дольше часа, то... Впринципе... Оставлю без внимания, потому что Вы и сами можете это увидеть! Такая, своего рода, разгрузка для мозгов читателя. <b>;)</b></p>' +
                    '<h2><b><i>Желаю Вам приятного путешествия по страницам этого сайта и, надеюсь, что мой труд окажется полезным для Вас!</i></b></h2>'
                    ,'Для убирания данного текста необходимо нажать на розовую надпись на чёрном фоне.'
                    ,'Для исчезновения данной информации надо нажать на заголовок фиолетовой рамки, в которой находится этот текст.'
                    ,'Для убирания появившейся салатовой подсказки нужно нажать на любую надпись на цветном фоне за пределами этой рамки.'  
                    ,'Для закрытия бежевого окна нужно нажать вне его текста на любую надпись на цветном фоне.'
                    
                    
                ],
                [//Особенности сайта
                    //Начальная страница
                    '<h2><b><i>Для более полезного использования сайта, ознакомтесь с данным пунктом!</i></b></h2>' +
                    '<p>Возможно, Вы уже заметили, что текст напичкан надписями на фоне разного цвета. Это сделанно для удобного сокращения статей, пояснения надписей и быстрого перемещения пользователя по сайту.' +
                    '<p>Объясню, что обозначают разные цвета заднего фона, а Вы можете лично проверить работу этих надписей.' +
                    '<ul><li><div id="tp_0_0_1_1_telo"><div id="tp_0_0_1_1_v"class="paragraf_v"onmouseover="on_tp(3,1)"onmouseout="on_tp(4,1)"onmousedown="on_tp(5,1)">Здесь перечисленны цвета, действие которых возможно на всём сайте:</div><hr width="100%"size="2"color="black"/>'+
                    
                    '<ul><li><div id="tp_0_0_1_0_telo"><div id="tp_0_0_1_0" class="paragraf"onmouseover="on_tp(1,0)"onmouseout="on_tp(2,0)"onmousedown="on_tp_0_0_1(0)"><b>Розовым цветом</b></div></div> выделяются надписи, открывающие списки, содержание или сам текст, отделённые от остального материала отступом и чёрными линиями вначале и вконце. </li>' +
                    '<p><li><span id="tr_0_0_1_0_telo"><span id="tr_0_0_1_0" class="reshenie"onmouseover="on_tr(1,0)"onmouseout="on_tr(2,0)"onmousedown="on_tr_0_0_1(0)"><b>Фиолетовым цветом</b></span></span> указана надпись, открывающая задания, вопросы, текст с ответами, подробные решения или поэтапное прохождение различных задач. Данная информация отделяется от других надписей фиолетовой рамкой. </li>' +
                    '<p><li><span id="ts_0_0_1_0_telo"><span id="ts_0_0_1_0" class="ssilka"onmouseover="on_ts(1,0)"onmouseout="on_ts(2,0)"onmousedown="on_ts_0_0_1(0)"><b>Голубым цветом</b></span></span> выделена надпись, переносящая пользователя в упомянутый раздел сайта. Для примера при нажатии на данную надпись Вы попадёте в пункт <b>"Приветствие"</b> этого раздела.</li>' +
                    '<p><li><span id="tm_0_0_1_0_telo"><span id="tm_0_0_1_0" class="metka"onmouseover="on_tm(1,0)"onmouseout="on_tm(2,0)"onmousedown="on_tm_0_0_1(0)"><b>Салатовый цвет</b></span></span> указывает на то, что есть пояснение, шпаргалка, коментарий для данной надписи или расшифровка сокращений. </li>' +
                    '<p><li><span id="ti_0_0_1_0_telo"><span id="ti_0_0_1_0" class="interes"onmouseover="on_ti(1,0)"onmouseout="on_ti(2,0)"onmousedown="on_ti_0_0_1(0)"><b>Жёлтым цветом</b></span></span> выделена надпись, содержащяя интересные факты, достижения или биографии людей связаные с данной темой.</li></ul>'+
                    '<hr width="100%"size="2"color="black"/></div>' +
                    '</li><p><li><div id="tp_0_0_1_2_telo"><div id="tp_0_0_1_2" class="paragraf"onmouseover="on_tp(1,2)"onmouseout="on_tp(2,2)"onmousedown="on_tp_0_0_1(2)">Здесь перечисленны конкретные разделы содержащие списки из цветных контейнеров с текстом и, если нужно, фотографиями: </div></div></li></ul>' +
                    '<p>В пунктах меню, расположенном изначально с верху, находятся соответствующие темам разделы. Например, в меню <b>"Обучение"</b> можно найти обучающую литературу по различным предметам. '+
                    '<p>Во всех разделах имеется своё содержание состоящее из пунков. Выбрав один из них Вы переходите на новую страничку по данной теме. Но если Вам мешает перечень этих пунктов, то можно спрятать его за страницу с текстом, нажав на кнопку ... Востановить "Содержимое раздела:" в прежнем виде можно нажав снова на неё же.' +
                    '<p>Так же Вы сможете записать любую, понравившуюся вам, информацию с этого сайта, если выделете текст и нажмёте на кнопку ... в окне <b>"Заметки"</b>. Копируемое отразится там же в виде нескольких начальных слов. Содержимое окна <b>"Заметки"</b> можно увидеть в более развёрнутом виде, нажав на его экран или зайдя в меню <span id="ts_0_0_1_1" class="ssilka"onmouseover="on_ts(1,0,0,1,1)"onmouseout="on_ts(2,0,0,1,1)"onmousedown="on_ts_0_0_1(1)"><b>"Обучение / Заметки"</b></span>. Когда захотите перенести эти записи к себе на компьютер, воспользуйтесь кнопкой ...' +
                    '<p>На боковой панели, кроме окна <b>"Заметки"</b>, имеются ещё два - <b>"Беседы"</b> и <b>"Новости"</b>. В них отражается переписка других пользователей на общие темы, не касающихся отдельных предметов, и что произошло за последнее время на сайте и среди умельцев. Чтобы узнать более подробную информацию отражённую в окнах, нажмите на одно из них. Вы перейдёте в <span id="ts_0_0_1_2" class="ssilka"onmouseover="on_ts(1,0,0,1,2)"onmouseout="on_ts(2,0,0,1,2)"onmousedown="on_ts_0_0_1(2)"><b>"Обсуждение / Беседы / Все беседы"</b></span>, либо <span id="ts_0_0_1_3" class="ssilka"onmouseover="on_ts(1,0,0,1,3)"onmouseout="on_ts(2,0,0,1,3)"onmousedown="on_ts_0_0_1(3)"><b>"Главное / Чего новенького / Все новости"</b></span>.' +
                    '<p>Если Вам надоест постоянно меняющийся текст в окнах, то панель, на которой они находятся, можно закрыть, нажав на кнопку ... А если Вы работаете за компьютером, то ещё Вам доступно изменение высоты и ширины окон. Для более подробной информации заходите в <span id="ts_0_0_1_4" class="ssilka"onmouseover="on_ts(1,0,0,1,4)"onmouseout="on_ts(2,0,0,1,4)"onmousedown="on_ts_0_0_1(4)"><b>"Справка / Инструкция по сайту / Боковая панель с окнами"</b></span>.' +
                    '<p>Если вам мешает сосредoточиться на изучении предмета мой помошник Смайлик, то можно его отодвинуть. Для смещения его жёрдочки воспользуйтесь всплывающей кнопкой ... Если сам Смайлик не на ней, то он всё равно откатиться за левую границу браузера. Для востановления положения жёрдочки и моего помошника наведитесь снова на левый нижний край браузера и нажмите на всплывающую кнопку.'+
                    '<p>Для более подробной информации зайдите в меню <span id="ts_0_0_1_5" class="ssilka"onmouseover="on_ts(1,0,0,1,5)"onmouseout="on_ts(2,0,0,1,5)"onmousedown="on_ts_0_0_1(5)"><b>"Справка / Инструкция по сайту"</b></span>.'+
                    '<h2>Успехов Вам в освоении новых знаний!</h2>'
                    
                    ,'<ul><li><div id="tp_0_0_1_0_telo"><div id="tp_0_0_1_0" class="paragraf"onmouseover="on_tp(1,0)"onmouseout="on_tp(2,0)"onmousedown="on_tp_0_0_1(0)"><b>Розовым цветом</b></div></div> выделяются надписи, открывающие списки или сам текст, отделённые от остального материала отступом и чёрными линиями вначале и вконце. </li>' +
                    '<p><li><span id="tr_0_0_1_0_telo"><span id="tr_0_0_1_0" class="reshenie"onmouseover="on_tr(1,0)"onmouseout="on_tr(2,0)"onmousedown="on_tr_0_0_1(0)"><b>Фиолетовым цветом</b></span></span> указана надпись, открывающая текст с ответами, подробным решением или поэтапным прохождением различных задач. Данная информация отделяется от других надписей фиолетовой рамкой.</li>' +
                    '<p><li><span id="ts_0_0_1_0_telo"><span id="ts_0_0_1_0" class="ssilka"onmouseover="on_ts(1,0)"onmouseout="on_ts(2,0)"onmousedown="on_ts_0_0_1(0)"><b>Голубым цветом</b></span></span> выделена надпись, переносящая пользователя в упомянутый раздел сайта. Для примера при нажатии на данную надпись Вы попадёте в пункт "Приветствие" этого раздела.</li>' +
                    '<p><li><span id="tm_0_0_1_0_telo"><span id="tm_0_0_1_0" class="metka"onmouseover="on_tm(1,0)"onmouseout="on_tm(2,0)"onmousedown="on_tm_0_0_1(0)"><b>Салатовый цвет</b></span></span> указывает на то, что есть пояснение, шпаргалка, коментарий для данной надписи или расшифровка сокращений. </li>' +
                    '<p><li><span id="ti_0_0_1_0_telo"><span id="ti_0_0_1_0" class="interes"onmouseover="on_ti(1,0)"onmouseout="on_ti(2,0)"onmousedown="on_ti_0_0_1(0)"><b>Жёлтым цветом</b></span></span> выделена надпись, содержащяя интересные факты, достижения или биографии людей связаные с данной темой.</li></ul>' 
                                        
                    ,'<ul><p><li><div id="tp_0_0_1_3_telo"><div id="tp_0_0_1_3" class="paragraf"onmouseover="on_tp(1,0,0,1,3)"onmouseout="on_tp(2,0,0,1,3)"onmousedown="on_tp_0_0_1(3)">Раздел <b>"Чего новенького"</b> содержит список новостей.</div></div></li>' +
                    '<p><li><div id="tp_0_0_1_4_telo"><div id="tp_0_0_1_4" class="paragraf"onmouseover="on_tp(1,0,0,1,4)"onmouseout="on_tp(2,0,0,1,4)"onmousedown="on_tp_0_0_1(4)">Раздел <b>"Люди-умельцы"</b> содержит список учасников группы.</div></div></li>'+ 
                    '<p><li><div id="tp_0_0_1_5_telo"><div id="tp_0_0_1_5" class="paragraf"onmouseover="on_tp(1,0,0,1,5)"onmouseout="on_tp(2,0,0,1,5)"onmousedown="on_tp_0_0_1(5)">Раздел <b>"Творческие работы"</b> содержит список изделий от авторов.</div></div></li>' +
                    '<p><li><div id="tp_0_0_1_6_telo"><div id="tp_0_0_1_6" class="paragraf"onmouseover="on_tp(1,0,0,1,6)"onmouseout="on_tp(2,0,0,1,6)"onmousedown="on_tp_0_0_1(6)">Раздел <b>"История просмотра"</b> содержит пополняемый список Ваших передвижений по сайту при данном посящении.</div></div></li>' +
                    '<p><li><div id="tp_0_0_1_7_telo"><div id="tp_0_0_1_7" class="paragraf"onmouseover="on_tp(1,0,0,1,7)"onmouseout="on_tp(2,0,0,1,7)"onmousedown="on_tp_0_0_1(7)">Раздел <b>"Обучение от умельцев"</b> содержит список уроков от мастеров.</div></div></li>' +
                    '<p><li><div id="tp_0_0_1_8_telo"><div id="tp_0_0_1_8" class="paragraf"onmouseover="on_tp(1,0,0,1,8)"onmouseout="on_tp(2,0,0,1,8)"onmousedown="on_tp_0_0_1(8)">Раздел <b>"Обучение от умельцев"</b> содержит пункт <b>"Обучение от конкретного мастера"</b>, где указывается список умельцев, способных обучить определённым навыкам пользователя.</div></div></li>' +
                    '<p><li><div id="tp_0_0_1_9_telo"><div id="tp_0_0_1_9" class="paragraf"onmouseover="on_tp(1,0,0,1,9)"onmouseout="on_tp(2,0,0,1,9)"onmousedown="on_tp_0_0_1(9)">Раздел <b>"Обучение от умельцев"</b> еще содержит пункт <b>"Схемы и картинки от умельцев"</b>, в котором представлены коллекции различного фото-материала.</div></div></li></ul>' 
                   
                    ,'<dd>Цвет фона выделенного заголовка меняется на чёрный, а надпись становится розовой. Это сделанно для того, чтобы пользователь не терялся и легко ориентировался на странице. При повторном нажатии по данной  надписи открывшаяся информация исчезает, а цвет её фона становится опять розовым.<p>Обычно, я скрываю таким образом списки, разделы содержания, тексты или мои ответы на вопросы. Также может присутствовать рядом с текстом на розовом фоне подходящая картинка.</dd>'
                    
                    ,'<p>Кыждая задача сопровождается такой же фиолетовой надписью со скрытым ответом, подробным решением. При её нажатии открывается новая вложеная рамка.'
                    ,'<p> Это очень удобно, когда после самостоятельного решения, хочется проверить свой ответ или ознакомиться с иными способами.'
                    
                    ,'Она открывается поверх другой информации.'
                    ,'<p>Очень удобно присутствие подобного рода "напоминалки" в тексте.'

                    ,'Данные открываются поверх другой информации.'
                    ,'<p>Это полезно для тех, кто хочет расширить свой кругозор и увеличить уровень знаний.'
                    
                    ,'<dd><p>При нажатии на выбранный заголовок новости откроется текст статьи. Ниже представлен образец одной из полос:<p><div id="tn_0_telo"><table id="tn_0" class="nowosti" onmousedown="on_tn(3,0)"onmouseout="on_tn(2,0)"onmouseover="on_tn(1,0)"><tr><td id="tn_0_z" class="nowosti_zagolovok"><big><i><b>Загаловок новости.</b></i></big></td><td id="tn_0_d"class="nowosti_data">Дата и время события.</td></tr><tr><td colspan=2 style="background: #fff8e0;"> </td></tr></table></div></dd>'
                    ,'<dd><p>При нажатии на выбранного мастера Вы переходите на его страничку. Ниже представлен образец одной из полос, при нажатии на которую откроется окно умельца: <p><table id="tym_0" class="ymelec" onmousedown="on_tym(3,0)"><tr ><td width="250px"align="center"><img id="ym_0_foto" src="ym_0_foto_1.jpg" class="foto_ymelca"><br><small>(фотография умельца)</small></td><td><div id="tym_0_name"><big><b>Фамелия, имя или псевдоним мастера</b></big></div> <p>Перечисляются все виды творчества, которыми он увлекается.</td></tr></table></dd>'
                    ,'<dd><p>При нажатии на выбранный вариант Вы переноситесь на страничку мастера к этой работе. Ниже представлен лишь образец одной из полос:<p><table id="tt"class="rabota_ymelca"><tr><td class="rabota_izdelie"><img src="ym_0_rab_0.jpg" class="rabota"><br><small>(фотография изделия)</small><p> Вид творчества <i>"Название работы".</i></td><td class="rabota_ym"><img src="ym_0_foto_1.jpg" class="foto_ymelca_min"><br><small>(мини-фото умельца)</small><p><b>Фамелия, имя или псевдоним мастера</b></td></tr></table></dd>'
                    ,'<dd><p>При нажатии на выбранную полосу Вы переноситесь на записанный в ней раздел. Ниже представлен лишь образец одной из полос:<p><table id="tt"class="istoriy"><tr><td width="10%"rowspan="2" align="center" class="istoriy_nomer">Номер шага.</td><td class="istoriy_vizit"colspan="2">Записывает <big><b>меню / раздел / пункт</b></big> визита</td></tr><tr><td class="istoriy_time">Дата и время открытия данного пункта и его закрытия</td><td  class="istoriy_time">Общее время нахожнения здесь</td></tr></table></dd>'
                    ,'<dd><p>При нажатии на выбранный вариант Вы переноситесь на страничку мастера к началу данной темы. Ниже представлен лишь образец одной из полос:<p><table id="tt"class="yrok_ymelca"><tr><td class="yrok"><big><i><u>Вид творчества.</u></i></big><br>Видио или текстовый формат. <p><br>Номер урока <i><b>"Название урока".</b><p>Краткое описание занятия.</i></td><td class="yrok_ym"><img src="ym_0_foto_1.jpg" class="foto_ymelca_min"><br><small>(мини-фото умельца)</small><p><b>Фамелия, имя или псевдоним мастера-учителя</b></td></tr></table></dd>'
                    ,'<dd><p>При нажатии на выбранный вариант Вы переноситесь на страничку мастера в раздел "Обучение". Ниже представлен лишь образец одной из полос:<p><table id="tt"class="yroks_ymelca"><tr><td class="yroks_ym"><img  src="ym_0_foto_1.jpg"class="foto_ymelca_min"><br><small>(мини-фото умельца)</small><p><b>Фамелия, имя или псевдоним мастера-учителя</b></td><td class="yroks"><p>Перечисление творческих направлений, по которым умелец может обучить.</td></tr></table></dd>'
                    ,'<dd><p>Изображения у разных мастеров может совпадать или принадлежать другим авторам, так как здесь выставляется материал взятый с общего доступа в Интернете. При нажатии на выбранную коллекцию Вы переноситесь на страничку мастера к соответствуещему разделу. Ниже представлен лишь образец одной из полос:<p><table id="tt"class="shema_ymelca"><tr><td align="center"><img  src="ym_0_foto_1.jpg" class="foto_ymelca_min"><br><small>(мини-фото умельца)</small><p><b>Фамелия, имя или псевдоним мастера</b></td><td style="background:#303060"></td><td class="shema"><p>Количество представленных схем и рисунков.<p><img src="ym_0_rab_0.jpg"class="shema_img4"><img src="ym_0_rab_0.jpg"class="shema_img3"><img src="ym_0_rab_0.jpg"class="shema_img2"><img src="ym_0_rab_0.jpg"class="shema_img1"></td></tr></table></dd>'
                    
                    ,'Отразится текст новости. Иногда он будет сопровождаться картинкой.<p>Чтобы свернуть текст необходимо нажать на заголовок данной новости.'

                ],
                [//Содержимое сайта
                    //Начальная страница
                    '<p>Здесь содержится описание каждого пункта меню, с возможностью перехода в сами разделы, а так же ответы на волнующие меня вопросы.</p>' +
                    '<p><b><big>Меню сайта:</big></b></p>' +
                    '<ul><li><div id = "tp_0_0_2_0_telo"><div id="tp_0_0_2_0" class="paragraf" onmousedown="on_tp_0_0_2(0)"onmouseover="on_tp(1,0)"onmouseout="on_tp(2,0)"><b>"Главное"</b> содержит разделы:</div></div></li></ul>' +
                    '<ul><li><div id="tp_0_0_2_1_telo"><div id="tp_0_0_2_1" class="paragraf" onmousedown="on_tp_0_0_2(1)" onmouseover="on_tp(1,1)" onmouseout="on_tp(2,1)"><b>"Обучение"</b> содержит разделы:</div></div></li></ul>' +
                    '<ul><li><div id="tp_0_0_2_2_telo"><div id="tp_0_0_2_2" class="paragraf" onmousedown="on_tp_0_0_2(2)" onmouseover="on_tp(1,2)" onmouseout="on_tp(2,2)"><b>"Обсуждение"</b> содержит разделы:</div></div></li></ul>' +
                    '<ul><li><div id="tp_0_0_2_3_telo"><div id="tp_0_0_2_3" class="paragraf" onmousedown="on_tp_0_0_2(3)" onmouseover="on_tp(1,3)" onmouseout="on_tp(2,3)"><b>"Справка"</b> содержит разделы:</div></div></li></ul>' +
                    '<p><b>Ответы на некоторые вопросы:</b></p>' +
                    '<ul><li><div id="tp_0_0_2_4_telo"><div id="tp_0_0_2_4" class="paragraf" onmousedown="on_tp_0_0_2(4)" onmouseover="on_tp(1,4)" onmouseout="on_tp(2,4)">Почему сделала участие в группе Люди-умельцы бесплатным?</div></div></li></ul>' +
                    '<ul><li><div id="tp_0_0_2_5_telo"><div id="tp_0_0_2_5" class="paragraf" onmousedown="on_tp_0_0_2(5)" onmouseover="on_tp(1,5)" onmouseout="on_tp(2,5)"> Почему заостила внимание в обучении на школьной программе?</div></div></li></ul>'
                    ,
                    //1
                    '<span id="ts_0_0_2_0" class="ssilka" onmousedown = "on_ts_0_0_2(0)" onmouseover="on_ts(1,5)" onmouseout="on_ts(2,0,0,2,5)">Перейти в раздел</span><p>Ещё не написан'
                    ,'<span id="ts_0_0_2_1" class="ssilka" onmousedown = "on_ts_0_0_2(1)" onmouseover="on_ts(1,5)" onmouseout="on_ts(2,0,0,2,5)">Перейти в раздел</span><p>Ещё не написан'
                    ,'<span id="ts_0_0_2_2" class="ssilka" onmousedown = "on_ts_0_0_2(2)" onmouseover="on_ts(1,0,0,2,5)" onmouseout="on_ts(2,0,0,2,5)">Перейти в раздел</span><p>Ещё не написан'
                    ,'<span id="ts_0_0_2_3" class="ssilka" onmousedown = "on_ts_0_0_2(3)" onmouseover="on_ts(1,0,0,2,5)" onmouseout="on_ts(2,0,0,2,5)">Перейти в раздел</span><p>Ещё не написан'
                    ,'<span id="ts_0_0_2_4" class="ssilka" onmousedown = "on_ts_0_0_2(4)" onmouseover="on_ts(1,0,0,2,5)" onmouseout="on_ts(2,0,0,2,5)">Перейти в раздел</span><p>Ещё не написан'
                    ,'<span id="ts_0_0_2_5" class="ssilka" onmousedown = "on_ts_0_0_2(5)" onmouseover="on_ts(1,0,0,2,5)" onmouseout="on_ts(2,0,0,2,5)">Перейти в раздел</span><p>Ещё не написан'
                    ,'<span id="ts_0_0_2_6" class="ssilka" onmousedown = "on_ts_0_0_2(6)" onmouseover="on_ts(1,0,0,2,5)" onmouseout="on_ts(2,0,0,2,5)">Перейти в раздел</span><p>Ещё не написан'
                    ,'<span id="ts_0_0_2_7" class="ssilka" onmousedown = "on_ts_0_0_2(7)" onmouseover="on_ts(1,0,0,2,5)" onmouseout="on_ts(2,0,0,2,5)">Перейти в раздел</span><p>Ещё не написан'
                    ,'<span id="ts_0_0_2_8" class="ssilka" onmousedown = "on_ts_0_0_2(8)" onmouseover="on_ts(1,0,0,2,5)" onmouseout="on_ts(2,0,0,2,5)">Перейти в раздел</span><p>Ещё не написан'
                    ,'<span id="ts_0_0_2_9" class="ssilka" onmousedown = "on_ts_0_0_2(9)" onmouseover="on_ts(1,0,0,2,5)" onmouseout="on_ts(2,0,0,2,5)">Перейти в раздел</span><p>Ещё не написан'
                    ,'<span id="ts_0_0_2_10" class="ssilka" onmousedown = "on_ts_0_0_2(10)" onmouseover="on_ts(1,0,0,2,5)" onmouseout="on_ts(2,0,0,2,5)">Перейти в раздел</span><p>Ещё не написан'
                    ,'<span id="ts_0_0_2_11" class="ssilka" onmousedown = "on_ts_0_0_2(11)" onmouseover="on_ts(1,0,0,2,5)" onmouseout="on_ts(2,0,0,2,5)">Перейти в раздел</span><p>Ещё не написан'
                    ,'<span id="ts_0_0_2_12" class="ssilka" onmousedown = "on_ts_0_0_2(12)" onmouseover="on_ts(1,0,0,2,5)" onmouseout="on_ts(2,0,0,2,5)">Перейти в раздел</span><p>Ещё не написан'
                    ,'<span id="ts_0_0_2_13" class="ssilka" onmousedown = "on_ts_0_0_2(13)" onmouseover="on_ts(1,0,0,2,5)" onmouseout="on_ts(2,0,0,2,5)">Перейти в раздел</span><p>Ещё не написан'
                    ,'<span id="ts_0_0_2_14" class="ssilka" onmousedown = "on_ts_0_0_2(14)" onmouseover="on_ts(1,0,0,2,5)" onmouseout="on_ts(2,0,0,2,5)">Перейти в раздел</span><p>Ещё не написан'
                    ,'<span id="ts_0_0_2_15" class="ssilka" onmousedown = "on_ts_0_0_2(4)" onmouseover="on_ts(1,0,0,2,5)" onmouseout="on_ts(2,0,0,2,5)">Перейти в раздел</span><p>Ещё не написан'
                    ,'<span id="ts_0_0_2_16" class="ssilka" onmousedown = "on_ts_0_0_2(4)" onmouseover="on_ts(1,0,0,2,5)" onmouseout="on_ts(2,0,0,2,5)">Перейти в раздел</span><p>Ещё не написан'
                    ,'<span id="ts_0_0_2_17" class="ssilka" onmousedown = "on_ts_0_0_2(4)" onmouseover="on_ts(1,0,0,2,5)" onmouseout="on_ts(2,0,0,2,5)">Перейти в раздел</span><p>Ещё не написан'
                    ,'<span id="ts_0_0_2_18" class="ssilka" onmousedown = "on_ts_0_0_2(4)" onmouseover="on_ts(1,0,0,2,5)" onmouseout="on_ts(2,0,0,2,5)">Перейти в раздел</span><p>Ещё не написан'
                    ,'<span id="ts_0_0_2_19" class="ssilka" onmousedown = "on_ts_0_0_2(4)" onmouseover="on_ts(1,0,0,2,5)" onmouseout="on_ts(2,0,0,2,5)">Перейти в раздел</span><p>Ещё не написан'
                    ,'<span id="ts_0_0_2_20" class="ssilka" onmousedown = "on_ts_0_0_2(4)" onmouseover="on_ts(1,0,0,2,5)" onmouseout="on_ts(2,0,0,2,5)">Перейти в раздел</span><p>Ещё не написан'
                    ,'<span id="ts_0_0_2_21" class="ssilka" onmousedown = "on_ts_0_0_2(4)" onmouseover="on_ts(1,0,0,2,5)" onmouseout="on_ts(2,0,0,2,5)">Перейти в раздел</span><p>Ещё не написан'
                    ,'<span id="ts_0_0_2_22" class="ssilka" onmousedown = "on_ts_0_0_2(4)" onmouseover="on_ts(1,0,0,2,5)" onmouseout="on_ts(2,0,0,2,5)">Перейти в раздел</span><p>Ещё не написан'
                    ,'<span id="ts_0_0_2_23" class="ssilka" onmousedown = "on_ts_0_0_2(4)" onmouseover="on_ts(1,0,0,2,5)" onmouseout="on_ts(2,0,0,2,5)">Перейти в раздел</span><p>Ещё не написан'
                    ,'<span id="ts_0_0_2_24" class="ssilka" onmousedown = "on_ts_0_0_2(4)" onmouseover="on_ts(1,0,0,2,5)" onmouseout="on_ts(2,0,0,2,5)">Перейти в раздел</span><p>Ещё не написан'
                    ,'<span id="ts_0_0_2_25" class="ssilka" onmousedown = "on_ts_0_0_2(4)" onmouseover="on_ts(1,0,0,2,5)" onmouseout="on_ts(2,0,0,2,5)">Перейти в раздел</span><p>Ещё не написан'
                    ,'<span id="ts_0_0_2_26" class="ssilka" onmousedown = "on_ts_0_0_2(4)" onmouseover="on_ts(1,0,0,2,5)" onmouseout="on_ts(2,0,0,2,5)">Перейти в раздел</span><p>Ещё не написан'
                    ,'<span id="ts_0_0_2_27" class="ssilka" onmousedown = "on_ts_0_0_2(4)" onmouseover="on_ts(1,0,0,2,5)" onmouseout="on_ts(2,0,0,2,5)">Перейти в раздел</span><p>Ещё не написан'
                    ,'<span id="ts_0_0_2_28" class="ssilka" onmousedown = "on_ts_0_0_2(4)" onmouseover="on_ts(1,0,0,2,5)" onmouseout="on_ts(2,0,0,2,5)">Перейти в раздел</span><p>Ещё не написан'
                    ,'<span id="ts_0_0_2_29" class="ssilka" onmousedown = "on_ts_0_0_2(4)" onmouseover="on_ts(1,0,0,2,5)" onmouseout="on_ts(2,0,0,2,5)">Перейти в раздел</span><p>Ещё не написан'
                    ,'<span id="ts_0_0_2_30" class="ssilka" onmousedown = "on_ts_0_0_2(4)" onmouseover="on_ts(1,0,0,2,5)" onmouseout="on_ts(2,0,0,2,5)">Перейти в раздел</span><p>Ещё не написан'
                    ,'<span id="ts_0_0_2_31" class="ssilka" onmousedown = "on_ts_0_0_2(4)" onmouseover="on_ts(1,0,0,2,5)" onmouseout="on_ts(2,0,0,2,5)">Перейти в раздел</span><p>Ещё не написан'
                    ,'<span id="ts_0_0_2_32" class="ssilka" onmousedown = "on_ts_0_0_2(4)" onmouseover="on_ts(1,0,0,2,5)" onmouseout="on_ts(2,0,0,2,5)">Перейти в раздел</span><p>Ещё не написан'
                    ,'<span id="ts_0_0_2_33" class="ssilka" onmousedown = "on_ts_0_0_2(4)" onmouseover="on_ts(1,0,0,2,5)" onmouseout="on_ts(2,0,0,2,5)">Перейти в раздел</span><p>Ещё не написан'
                    ,'<span id="ts_0_0_2_34" class="ssilka" onmousedown = "on_ts_0_0_2(4)" onmouseover="on_ts(1,0,0,2,5)" onmouseout="on_ts(2,0,0,2,5)">Перейти в раздел</span><p>Ещё не написан'
                    ,'<span id="ts_0_0_2_35" class="ssilka" onmousedown = "on_ts_0_0_2(4)" onmouseover="on_ts(1,0,0,2,5)" onmouseout="on_ts(2,0,0,2,5)">Перейти в раздел</span><p>Ещё не написан'
                    ,'<span id="ts_0_0_2_36" class="ssilka" onmousedown = "on_ts_0_0_2(4)" onmouseover="on_ts(1,0,0,2,5)" onmouseout="on_ts(2,0,0,2,5)">Перейти в раздел</span><p>Ещё не написан'
                    ,'<span id="ts_0_0_2_37" class="ssilka" onmousedown = "on_ts_0_0_2(4)" onmouseover="on_ts(1,0,0,2,5)" onmouseout="on_ts(2,0,0,2,5)">Перейти в раздел</span><p>Ещё не написан'
                    ,'<span id="ts_0_0_2_38" class="ssilka" onmousedown = "on_ts_0_0_2(4)" onmouseover="on_ts(1,0,0,2,5)" onmouseout="on_ts(2,0,0,2,5)">Перейти в раздел</span><p>Ещё не написан'
                    ,'<span id="ts_0_0_2_39" class="ssilka" onmousedown = "on_ts_0_0_2(4)" onmouseover="on_ts(1,0,0,2,5)" onmouseout="on_ts(2,0,0,2,5)">Перейти в раздел</span><p>Ещё не написан'
                    , 'Ещё не написан'
                    , 'Ещё не написан'

                ],
                [//Настройки сайта
                    '<p>Позволяет изменить окраску или дизайн сайта, положение Смайлика или панелей. Для этого нажмите на нужный Вам раздел и выберите один из представленных вариантов.</p>' +
                    '<div id="tp_0_0_3_0"class= "paragraf" onmousedown="on_tp_0_0_3(0)"onmouseover="on_tp(1,0,0,3,0)"onmouseout="on_tp(2,0,0,3,0)"style="text-align:center"> Определить сторону размещения Смайлика и его скрытость</div><p>' +
                    '<div id="tp_0_0_3_1"class= "paragraf" onmousedown="on_tp_0_0_3(1)"onmouseover="on_tp(1,0,0,3,1)"onmouseout="on_tp(2,0,0,3,1)"style="text-align:center"> Указать начальное положение панели "Содержимое раздела"</div><p>' +
                    '<div id="tp_0_0_3_2"class= "paragraf" onmousedown="on_tp_0_0_3(2)"onmouseover="on_tp(1,0,0,3,2)"onmouseout="on_tp(2,0,0,3,2)"style="text-align:center"> Определить положение панели "Окна" и значение её выдвижения</div><p>' +
                    '<div id="tp_0_0_3_3"class= "paragraf" onmousedown="on_tp_0_0_3(3)"onmouseover="on_tp(1,0,0,3,3)"onmouseout="on_tp(2,0,0,3,3)"style="text-align:center"> Сменить дизайн сайта</div><p>' +
                    '<div id="tp_0_0_3_4"class= "paragraf" onmousedown="on_tp_0_0_3(4)"onmouseover="on_tp(1,0,0,3,4)"onmouseout="on_tp(2,0,0,3,4)"style="text-align:center"> Указать цветовую гамму сайта</div><p>'


                ]
            ],
            [//1 Чего новенького
                
                [//Все новости
                    '<p>Новости идут в свёрнутом виде. Показан только загаловок и дата. Если захотите прочитать всю статью, то нажмите на интересующую Вас новость. Так же Вы сможите перейти в то место на сайте, о котором расказывается.</p>' +
                    '<table id="tt" class="nowosti"><tr><td class="nowosti_zagolovok"><big><i><b>Загаловок новости.</b></i></big></td><td class="nowosti_data">Дата и время события.</td></tr><tr><td class="nowosti_text" colspan="2" align="left"> </td></tr></table>' +
                    '<table id="tt" class="nowosti"><tr><td class="nowosti_zagolovok"><big><i><b>Загаловок новости.</b></i></big></td><td class="nowosti_data">Дата и время события.</td></tr><tr><td class="nowosti_text" colspan="2" align="left"> </td></tr></table>' +
                    '<table id="tt" class="nowosti"><tr><td class="nowosti_zagolovok"><big><i><b>Загаловок новости.</b></i></big></td><td class="nowosti_data">Дата и время события.</td></tr><tr><td class="nowosti_text" colspan="2" align="left"> </td></tr></table>' 
                ],
                
                [//Об умельцах
                
                '<p>Здесь представлены новости, касающиеся только умельцев. А именно: вхождение их в нашу группу, новые работы, планы на будущее и обучающие уроки.</p>'
                ],
                [//Об обучении
                    '<p>Новости касающиеся обучения, в том числе от умельцев, с возможностью посмотреть на данные разделы и параграфы.</p>'
                ],
                [//По выбранной категории
                    '<p>Выберите из списка нужную категорию, по которой Вы хотели бы увидеть новости:</p>' +

                    '<ul><li><div id="tp_0_1_3_0"class="paragraf" onmousedown="on_tp_0_1_3(0)"onmouseover="on_tp(1,0,1,3,0)"onmouseout="on_tp(2,0,1,3,0)">"Люди-умельцы"</div></li><p>' +
                    '<li><div id="tp_0_1_3_1" class="paragraf" onmousedown="on_tp_0_1_3(1)" onmouseover="on_tp(1,0,1,3,1)" onmouseout="on_tp(2,0,1,3,1)">Обучение</div></li><p>' +
                    '<li><div id="tp_0_1_3_2"class="paragraf" onmousedown="on_tp_0_1_3(2)"onmouseover="on_tp(1,0,1,3,2)"onmouseout="on_tp(2,0,1,3,2)">Ответы на предложения</div></li></ul>'
                ]
            ],
            [//2 Люди-умельцы
                [//Список с начала
                    '<p><div class="ymelec"><table><tr><td><img class="foto_ymelca" src="ym_1_foto_1.jpg"></td><td><div id="lud_1_name"><big><b>Ильина (Ковалёва) Людмила.</b></big></div><p> <i>Программист, художник и рукодельница.</i> </td></tr></table></div>' +
                    '<p><div class="ymelec"><table><tr><td><img class="foto_ymelca" src="ym_1_foto_1.jpg"></td><td><div id="lud_1_name"><big><b>Ильина (Ковалёва) Людмила.</b></big></div><p> <i>Программист, художник и рукодельница.</i> </td></tr></table></div>' +
                    '<p><div class="ymelec"><table><tr><td><img class="foto_ymelca" src="ym_1_foto_1.jpg"></td><td><div id="lud_1_name"><big><b>Ильина (Ковалёва) Людмила.</b></big></div><p> <i>Программист, художник и рукодельница.</i> </td></tr></table></div>'
                  

                ],
                [//Список с конца

                ],
                [//Список по алфавиту

                ],
                [//По скорости выполнения работ

                ],
                [//Как стать участником нашей группы
                    '<p>Если Вы хотите стать участником группы "Люди-умельцы", то Вы должны сделать хотя бы две вещи своими руками, отвечающие заявленной Вами специализации. Например, художник - фотографии написанных им картин, вязальщица - сделанные вещи и так далее.</p>' +
                    '<p>Зарегистрироваться в группе "Люди-умельцы", указав свой ник или Фамелию, Имя, Отчество (по желанию), адрес электронной почты, через которую я смогу связаться с Вами.</p>' +
                    '<p>Проверять адрес не буду. Если он окажется фейком, то я просто не внесу Вас в группу. </p>' + '<p>Не забудте написать ссылки на аккаунты, в которых можно будет ознакомиться с Вашим творчеством. </p>' +
                    '<p>Так же должна проинформировать Вас, что на сайт могут проникнуть хакеры, поэтому будте бдительны и заведите отдельный адрес электронной почты, по которому мы будем общаться!</p>' +
                    '<p>Скорость ответа на Ваш запрос будет медленной, потому как я не метиор, проверяю заявки только раз в сутки. Прошу меня понять и простить. </p>'
                ],
                [//Запись в группу "Люди-умельцы"
                    '<div id="imy"class="spisok">Ник или Фамелию, Имя, Отчество (по желанию)</div>'

                ],
                [//Каждый человек-умелец
                    
                    [//0
                        '<p><table width="100%"><tr ><td align="center" colspan=2><h1>Фамелия, имя или псевдоним мастера</h1></td></tr>'+
                    '<tr><td>Указываются весь список контактов, по которым можно подписаться на его работы, отправить запрос на дружбу или связаться с ним по поводу заказа изделия(й)</td><td width="250px"align="center"><img src="ym_0_foto_1.jpg" class="foto_ymelca"><br><small>(фотография умельца)</small></td></tr>'+
                    '<tr><td colspan=2><p>Если мастер пожелает, то указываются его:<ul><li>день рождения,</li><li>возрост</li><li>место проживания</li></ul>'+
                    '<p>Перечисляются все виды творчества, которыми он увлекается.<ul><li>Например,<b> вязание крючком кукол</b>;</li><li>или <b>игра на гитаре</b>.</li></ul>'+
                    '<b><p><div id="tp_0_2_0_0_telo"><div id="tp_0_2_0_0"class="paragraf"onmouseover="on_tp(1,0)"onmouseout="on_tp(2,0)"onmousedown="on_tp_0_2_0(0)">Все работы</div></div>'+
                    '<p><div id="tp_0_2_0_1_telo"><div id="tp_0_2_0_1"class="paragraf"onmouseover="on_tp(1,1)"onmouseout="on_tp(2,1)"onmousedown="on_tp_0_2_0(1)">Все уроки</div></div>'+
                    '<p><div id="tp_0_2_0_2_telo"><div id="tp_0_2_0_2"class="paragraf"onmouseover="on_tp(1,2)"onmouseout="on_tp(2,2)"onmousedown="on_tp_0_2_0(2)">Схемы и рисунки</div></div>'+
                    '<p><div id="tp_0_2_0_2_telo"><div id="tp_0_2_0_3"class="paragraf"onmouseover="on_tp(1,3)"onmouseout="on_tp(2,3)"onmousedown="on_tp_0_2_0(3)">Полезные советы</div></div>'+
                    '<p><div id="tp_0_2_0_3_telo"><div id="tp_0_2_0_4"class="paragraf"onmouseover="on_tp(1,4)"onmouseout="on_tp(2,4)"onmousedown="on_tp_0_2_0(4)">Личные фотографии и видео</div></div></b><p>'+
                    '<p>Если мастер сам пожелает, то может написать:<p><ul><li>о себе, </li><li>о своей семье,</li><li>о своих хобби и работах, </li><li>об историях их начала,</li><li>о домашних питомцах,</li><li>о разных предпочтениях</li><li> или о своих взглядах на жизнь.</li> <p></td></tr></table><p>'
                    ,'nnn'
                    ],
                    [//1
                    ]
                ]
            ],
            [//Творческие работы
                [//Все изделия

                ],
                [//Работы по категории творчества
                    '<p>Многие из представленных работ находяться сразу в нескольких категориях. Выберите нужный Вам вид творчества: <p>' +
                    '<ul><li><div id="tp_0_3_1_0"class="paragraf"onmousedown="on_tp_0_3_1(0)"onmouseover="on_tp(1,0,3,1,0)"onmouseout="on_tp(2,0,3,1,0)">Рисование</div></li><p>' +
                    '<li><div id="tp_0_3_1_1"class="paragraf"onmousedown="on_tp_0_3_1(1)"onmouseover="on_tp(1,0,3,1,1)"onmouseout="on_tp(2,0,3,1,1)">Лепка скульптур</div></li><p>' +
                    '<li><div id="tp_0_3_1_2"class="paragraf"onmousedown="on_tp_0_3_1(2)"onmouseover="on_tp(1,0,3,1,2)"onmouseout="on_tp(2,0,3,1,2)">Резьба по дереву</div></li><p>' +
                    '<li><div id="tp_0_3_1_3"class="paragraf"onmousedown="on_tp_0_3_1(3)"onmouseover="on_tp(1,0,3,1,3)"onmouseout="on_tp(2,0,3,1,3)">Вязание</div></li><p>' +
                    '<li><div id="tp_0_3_1_4"class="paragraf"onmousedown="on_tp_0_3_1(4)"onmouseover="on_tp(1,0,3,1,4)"onmouseout="on_tp(2,0,3,1,4)">Шитьё</div></li><p>' +
                    '<li><div id="tp_0_3_1_1"class="paragraf"onmousedown="on_tp_0_3_1(1)"onmouseover="on_tp(1,0,3,1,1)"onmouseout="on_tp(2,0,3,1,1)">Плетение из бисера</div></li><p>' +
                    '<li><div id="tp_0_3_1_5"class="paragraf"onmousedown="on_tp_0_3_1(5)"onmouseover="on_tp(1,0,3,1,5)"onmouseout="on_tp(2,0,3,1,5)">Музыка</div></li><p>' +
                    '<li><div id="tp_0_3_1_6"class="paragraf"onmousedown="on_tp_0_3_1(6)"onmouseover="on_tp(1,0,3,1,6)"onmouseout="on_tp(2,0,3,1,6)">Литература</div></li><p>' +
                    '<li><div id="tp_0_3_1_7"class="paragraf"onmousedown="on_tp_0_3_1(7)"onmouseover="on_tp(1,0,3,1,7)"onmouseout="on_tp(2,0,3,1,7)">Программирование</div></li><p>' +
                    '<li><div id="tp_0_3_1_8"class="paragraf"onmousedown="on_tp_0_3_1(8)"onmouseover="on_tp(1,0,3,1,8)"onmouseout="on_tp(2,0,3,1,8)">Электроника</div></li><p>' +
                    '</ul>'
                ],
                [//Категории применяемости в быту
                    '<p>Многие из представленных работ находяться сразу в нескольких категориях. Выберите нужный Вам пункт:<p>' +
                    '<ul><li><div id="tp_0_3_2_0"class="paragraf"onmousedown="on_tp_0_3_2(0)"onmouseover="on_tp(1,0,3,2,0)"onmouseout="on_tp(2,0,3,2,0)">Дизайн интеръера</div></li><p>' +
                    '<li><div id="tp_0_3_2_1"class="paragraf"onmousedown="on_tp_0_3_2(1)"onmouseover="on_tp(1,0,3,2,1)"onmouseout="on_tp(2,0,3,2,1)">Ковры и дорожки</div></li><p>' +
                    '<li><div id="tp_0_3_2_2"class="paragraf"onmousedown="on_tp_0_3_2(2)"onmouseover="on_tp(1,0,3,2,2)"onmouseout="on_tp(2,0,3,2,2)">Покрывала и седушки</div></li><p>' +
                    '<li><div id="tp_0_3_2_3"class="paragraf"onmousedown="on_tp_0_3_2(3)"onmouseover="on_tp(1,0,3,2,3)"onmouseout="on_tp(2,0,3,2,3)">Кухонная утварь</div></li><p>' +
                    '<li><div id="tp_0_3_2_4"class="paragraf"onmousedown="on_tp_0_3_2(4)"onmouseover="on_tp(1,0,3,2,4)"onmouseout="on_tp(2,0,3,2,4)">Мебель</div></li><p>' +
                    '<li><div id="tp_0_3_2_5"class="paragraf"onmousedown="on_tp_0_3_2(5)"onmouseover="on_tp(1,0,3,2,5)"onmouseout="on_tp(2,0,3,2,5)">Картины</div></li><p>' +
                    '<li><div id="tp_0_3_2_6"class="paragraf"onmousedown="on_tp_0_3_2(6)"onmouseover="on_tp(1,0,3,2,6)"onmouseout="on_tp(2,0,3,2,6)">Скульптуры</div></li><p>' +
                    '<li><div id="tp_0_3_2_7"class="paragraf"onmousedown="on_tp_0_3_2(7)"onmouseover="on_tp(1,0,3,2,7)"onmouseout="on_tp(2,0,3,2,7)">Часы</div></li><p>' +
                    '<li><div id="tp_0_3_2_8"class="paragraf"onmousedown="on_tp_0_3_2(8)"onmouseover="on_tp(1,0,3,2,8)"onmouseout="on_tp(2,0,3,2,8)">Светильники</div></li><p>' +
                    '<li><div id="tp_0_3_2_9"class="paragraf"onmousedown="on_tp_0_3_2(9)"onmouseover="on_tp(1,0,3,2,9)"onmouseout="on_tp(2,0,3,2,9)">Горшки и коробы</div></li><p>' +
                    '<li><div id="tp_0_3_2_10"class="paragraf"onmousedown="on_tp_0_3_2(10)"onmouseover="on_tp(1,0,3,2,10)"onmouseout="on_tp(2,0,3,2,10)">Бижутерии</div></li><p>' +
                    '<li><div id="tp_0_3_2_11"class="paragraf"onmousedown="on_tp_0_3_2(11)"onmouseover="on_tp(1,0,3,2,11)"onmouseout="on_tp(2,0,3,2,11)">Одежда</div></li><p>' +
                    '<li><div id="tp_0_3_2_12"class="paragraf"onmousedown="on_tp_0_3_2(12)"onmouseover="on_tp(1,0,3,2,12)"onmouseout="on_tp(2,0,3,2,12)">Обувь</div></li><p>' +
                    '<li><div id="tp_0_3_2_13"class="paragraf"onmousedown="on_tp_0_3_2(13)"onmouseover="on_tp(1,0,3,2,13)"onmouseout="on_tp(2,0,3,2,13)">Мягкие игрушки</div></li><p>' +
                    '<li><div id="tp_0_3_2_14"class="paragraf"onmousedown="on_tp_0_3_2(14)"onmouseover="on_tp(1,0,3,2,14)"onmouseout="on_tp(2,0,3,2,14)">Поделки</div></li><p>' +
                    '<li><div id="tp_0_3_2_15"class="paragraf"onmousedown="on_tp_0_3_2(15)"onmouseover="on_tp(1,0,3,2,15)"onmouseout="on_tp(2,0,3,2,15)">Книги</div></li><p>' +
                    '<li><div id="tp_0_3_2_16"class="paragraf"onmousedown="on_tp_0_3_2(16)"onmouseover="on_tp(1,0,3,2,16)"onmouseout="on_tp(2,0,3,2,16)">Для сада и огорода</div></li><p>' +
                    '<li><div id="tp_0_3_2_17"class="paragraf"onmousedown="on_tp_0_3_2(17)"onmouseover="on_tp(1,0,3,2,17)"onmouseout="on_tp(2,0,3,2,17)">Электронные приборы</div></li><p>' +
                    '<li><div id="tp_0_3_2_18"class="paragraf"onmousedown="on_tp_0_3_2(18)"onmouseover="on_tp(1,0,3,2,18)"onmouseout="on_tp(2,0,3,2,18)">Компьютерные программы</div></li><p>' +
                    '</ul>'
                ],
                [//Выстовочные работы
                ],
            ],
            [//Поиск по сайту
                [//Искать везде
                    '<p>Поисковик не обращает внимание на заглавные буквы и читает их как прописные<p>Введите искомый текст:<p> ' +
                    'Искать<p>' +
                    'Результаты поиска с возможностью перейти в данный раздел:<p>'
                ],
                [//Только среди умельцев
                    '<p>Поисковик ищет только среди умельцев!<p>'
                ],
                [//Среди творческих работ
                    '<p>Поисковик ищет только среди представленных здесь работ умельцев и их описании!<p>'
                ],
                [//По названию статей и параграфов
                    '<p>Поисковик ищет только среди оглавлений и параграфов!<p>'
                ],
                [//По тексту
                    '<p>Поисковик ищет только лишь по тексту статей!<p>'
                ],
                [//Результаты поиска за посещение
                    'Здесь находяться результаты поиска за последнее посещение сайта "Творчество во всём": '
                ]
            ],
            [//История просмотра
                [//Ваша история просмотра страниц

                ],
                [//Уточнения по данному вопросу
                    '<p>Представленный здесь путь Вашего следования будет доступен только Вам. После обнавления сайта или нажатия на кнопку "Обнулить" путь сотрётся и будет записываться с чистого листа.<p> ' +
                    'В пункте "Ваша история просмотра страниц" содержаться все Ваши перемещения по сайту с датой и временем захождения и выхода в разделы. Вы можете перейти в указанный раздел снова, нажав на данную надпись.'
                ]
            ],
            [//Регистрация
                [//Зачем нужна регистрация
                    '<p>Я не сторонник слежки за своими пользователями и не люблю когда принуждают к регистрации на некоторых сайтах. <p>Данная регистрация нужна Вам, если хотите получать новости об изменениях на сайте, или по определённым разделам.'
                ],
                [//Что входит в регистрацию
                    '<p>Для регистрации будет запрашиваться:<p><ul>' +
                    '<li>Ваш ник или Фамелия, Имя, отчество</li><p>' +
                    '<li>Адрес электронной почты.</li><p>Проверять на подленность данного адреса не буду. Вы просто не будете получать новости, если окажется фейковая почта.<p>' +
                    '<li>Будет предоставлен выбор между новостями по всему сайту или только определённым разделам</li><p>' +
                    '<li>Если вы выберете второй пункт, то откроется список интересующих Вас разделов. Вы сможете назначить сразу несколько категорий из представленных.</li><p>' +
                    '</ul>'
                ],
                [//Регистрация
                    '<p>Для получения новостей лучше завести отдельно новый адрес электронной почты для своей же безопасности. '
                ]
            ]
        ],
        [//Обучение
            [//Обучение от умельцев
                [//Обучающие уроки по мере поступления
                    '<p>Здесь видны толь загаловок с кратким описанием и автор. Если захотите увидеть полностью занятие, то нажмите на его оглавление.<p> ' +
                    '<p><table id="tt"class="yrok_ymelca"><tr><td class="yrok"><big><i>Вязание спицами.</big></i><p>Текстовый формат.<p>Урок 1 <i><b>"Название урока".</b><p>Краткое описание занятия.</i></td><td style="background:#901010"></td><td align="center"><img src="ym_1_fotos_1.jpg" class="foto_ymelca_min"><p><b>Ильина (Ковалёва) Людмила</b></td></tr></table>'+
                    '<div class="yrok_ymelca"><table><tr><td> <big><b>Заголовок занятия</b></big> <p>Краткое описание урока с указанием его направления в творчестве</td><td align="center"width="30%"><img class="foto_ymelca_min" src="ym_1_fotos_1.jpg"><div id="name_ymelca"><big><b>Ильина (Ковалёва) Людмила.</b></big></div></td></tr></table></div><p>' +
                    '<div class="yrok_ymelca"><table><tr><td> <big><b>Заголовок занятия</b></big> <p>Краткое описание урока с указанием его направления в творчестве</td><td align="center"width="30%"><img class="foto_ymelca_min" src="ym_1_fotos_1.jpg"><div id="name_ymelca"><big><b>Ильина (Ковалёва) Людмила.</b></big></div></td></tr></table></div><p>' +
                    '<div class="yrok_ymelca"><table><tr><td> <big><b>Заголовок занятия</b></big> <p>Краткое описание урока с указанием его направления в творчестве</td><td align="center"width="30%"><img class="foto_ymelca_min" src="ym_1_fotos_1.jpg"><div id="name_ymelca"><big><b>Ильина (Ковалёва) Людмила.</b></big></div></td></tr></table></div><p>' +
                    '<div class="yrok_ymelca"><table><tr><td> <big><b>Заголовок занятия</b></big> <p>Краткое описание урока с указанием его направления в творчестве</td><td align="center"width="30%"><img class="foto_ymelca_min" src="ym_1_fotos_1.jpg"><div id="name_ymelca"><big><b>Ильина (Ковалёва) Людмила.</b></big></div></td></tr></table></div><p>' +
                    '<div class="yrok_ymelca"><table><tr><td> <big><b>Заголовок занятия</b></big> <p>Краткое описание урока с указанием его направления в творчестве</td><td align="center"width="30%"><img class="foto_ymelca_min" src="ym_1_fotos_1.jpg"><div id="name_ymelca"><big><b>Ильина (Ковалёва) Людмила.</b></big></div></td></tr></table></div><p>' +
                    '<div class="yrok_ymelca"><table><tr><td> <big><b>Заголовок занятия</b></big> <p>Краткое описание урока с указанием его направления в творчестве</td><td align="center"width="30%"><img class="foto_ymelca_min" src="ym_1_fotos_1.jpg"><div id="name_ymelca"><big><b>Ильина (Ковалёва) Людмила.</b></big></div></td></tr></table></div><p>' +
                    '<div class="yrok_ymelca"><table><tr><td> <big><b>Заголовок занятия</b></big> <p>Краткое описание урока с указанием его направления в творчестве</td><td align="center"width="30%"><img class="foto_ymelca_min" src="ym_1_fotos_1.jpg"><div id="name_ymelca"><big><b>Ильина (Ковалёва) Людмила.</b></big></div></td></tr></table></div><p>'
                ],
                [//Обучение от конкретного мастера
                    '<p>Выберите нужного Вам мастера:<p>' +
                    '<div class="izobr"><table><tr><td align="center"width="30%"><img class="foto_ymelca_min" src="ym_1_fotos_1.jpg"><div id="name_ymelca"><big><b>Ильина (Ковалёва) Людмила.</b></big></div></td><td> Перечисления направления занятий.</td></tr></table></div><p>' +
                    '<div class="izobr"><table><tr><td align="center"width="30%"><img class="foto_ymelca_min" src="ym_1_fotos_1.jpg"><div id="name_ymelca"><big><b>Ильина (Ковалёва) Людмила.</b></big></div></td><td> Перечисления направления занятий.</td></tr></table></div><p>' +
                    '<div class="izobr"><table><tr><td align="center"width="30%"><img class="foto_ymelca_min" src="ym_1_fotos_1.jpg"><div id="name_ymelca"><big><b>Ильина (Ковалёва) Людмила.</b></big></div></td><td> Перечисления направления занятий.</td></tr></table></div><p>' +
                    '<div class="izobr"><table><tr><td align="center"width="30%"><img class="foto_ymelca_min" src="ym_1_fotos_1.jpg"><div id="name_ymelca"><big><b>Ильина (Ковалёва) Людмила.</b></big></div></td><td> Перечисления направления занятий.</td></tr></table></div><p>' +
                    '<div class="izobr"><table><tr><td align="center"width="30%"><img class="foto_ymelca_min" src="ym_1_fotos_1.jpg"><div id="name_ymelca"><big><b>Ильина (Ковалёва) Людмила.</b></big></div></td><td> Перечисления направления занятий.</td></tr></table></div><p>'

                ],
                [//Обучение по категориям творчества
                    '<p>Выберите категорию творчества, по которой Вы хотели бы получить обучение от наших умельцев:<p>' +
                    '<ul><li><div id="tp_0_3_1_0"class="paragraf"onmousedown="on_tp_0_3_1(0)"onmouseover="on_tp(1,0,3,1,0)"onmouseout="on_tp(2,0,3,1,0)">Рисование</div></li><p>' +
                    '<li><div id="tp_0_3_1_1"class="paragraf"onmousedown="on_tp_0_3_1(1)"onmouseover="on_tp(1,0,3,1,1)"onmouseout="on_tp(2,0,3,1,1)">Лепка скульптур</div></li><p>' +
                    '<li><div id="tp_0_3_1_2"class="paragraf"onmousedown="on_tp_0_3_1(2)"onmouseover="on_tp(1,0,3,1,2)"onmouseout="on_tp(2,0,3,1,2)">Резьба по дереву</div></li><p>' +
                    '<li><div id="tp_0_3_1_3"class="paragraf"onmousedown="on_tp_0_3_1(3)"onmouseover="on_tp(1,0,3,1,3)"onmouseout="on_tp(2,0,3,1,3)">Вязание</div></li><p>' +
                    '<li><div id="tp_0_3_1_4"class="paragraf"onmousedown="on_tp_0_3_1(4)"onmouseover="on_tp(1,0,3,1,4)"onmouseout="on_tp(2,0,3,1,4)">Шитьё</div></li><p>' +
                    '<li><div id="tp_0_3_1_1"class="paragraf"onmousedown="on_tp_0_3_1(1)"onmouseover="on_tp(1,0,3,1,1)"onmouseout="on_tp(2,0,3,1,1)">Плетение из бисера</div></li><p>' +
                    '<li><div id="tp_0_3_1_5"class="paragraf"onmousedown="on_tp_0_3_1(5)"onmouseover="on_tp(1,0,3,1,5)"onmouseout="on_tp(2,0,3,1,5)">Музыка</div></li><p>' +
                    '<li><div id="tp_0_3_1_6"class="paragraf"onmousedown="on_tp_0_3_1(6)"onmouseover="on_tp(1,0,3,1,6)"onmouseout="on_tp(2,0,3,1,6)">Литература</div></li><p>' +
                    '<li><div id="tp_0_3_1_7"class="paragraf"onmousedown="on_tp_0_3_1(7)"onmouseover="on_tp(1,0,3,1,7)"onmouseout="on_tp(2,0,3,1,7)">Программирование</div></li><p>' +
                    '<li><div id="tp_0_3_1_8"class="paragraf"onmousedown="on_tp_0_3_1(8)"onmouseover="on_tp(1,0,3,1,8)"onmouseout="on_tp(2,0,3,1,8)">Электроника</div></li><p>' +
                    '</ul>'
                ],
                [//Обучающие схемы от умельцев
                    '<p>Схемы могут совпадать или принадлежать другим, неисзестным, авторам. Вы должны понимать, что всё попавшее в Internet становится достоянием общества. Здесь указывается человек, который выложил материал, для общего обозрения<p>' +
                    '<div class="izobr"><table><tr><td align="center"width="30%"><img class="foto_ymelca_min" src="ym_1_fotos_1.jpg"><div id="name_ymelca"><big><b>Ильина (Ковалёва) Людмила.</b></big></div></td><td> Перечисления направления занятий.</td></tr></table></div><p>'
                ],
                [//Особенности данного обучения
                    '<p> '
                ],
            ],
            [//Творчество
                [//Все, освоенные мною, виды 
                    '<p>Я собрала здесь все, освоенные мною, виды творчества, не включая программирования и электроники. Выберите подходящий Вам раздел:<p>' +
                    '<ul><li><div id="tp_0_3_1_0"class="paragraf"onmousedown="on_tp_0_3_1(0)"onmouseover="on_tp(1,0,3,1,0)"onmouseout="on_tp(2,0,3,1,0)">Рисование</div></li><p>' +
                    '<li><div id="tp_0_3_1_1"class="paragraf"onmousedown="on_tp_0_3_1(1)"onmouseover="on_tp(1,0,3,1,1)"onmouseout="on_tp(2,0,3,1,1)">Лепка из глины</div></li><p>' +
                    '<li><div id="tp_0_3_1_4"class="paragraf"onmousedown="on_tp_0_3_1(4)"onmouseover="on_tp(1,0,3,1,4)"onmouseout="on_tp(2,0,3,1,4)">Лепка из Папье-маше</div></li><p>' +
                    '<li><div id="tp_0_3_1_4"class="paragraf"onmousedown="on_tp_0_3_1(4)"onmouseover="on_tp(1,0,3,1,4)"onmouseout="on_tp(2,0,3,1,4)">Плетение из лозы</div></li><p>' +
                    '<li><div id="tp_0_3_1_2"class="paragraf"onmousedown="on_tp_0_3_1(2)"onmouseover="on_tp(1,0,3,1,2)"onmouseout="on_tp(2,0,3,1,2)">Резьба по дереву</div></li><p>' +
                    '<li><div id="tp_0_3_1_3"class="paragraf"onmousedown="on_tp_0_3_1(3)"onmouseover="on_tp(1,0,3,1,3)"onmouseout="on_tp(2,0,3,1,3)">Вязание крючком</div></li><p>' +
                    '<li><div id="tp_0_3_1_3"class="paragraf"onmousedown="on_tp_0_3_1(3)"onmouseover="on_tp(1,0,3,1,3)"onmouseout="on_tp(2,0,3,1,3)">Вязание спицами</div></li><p>' +
                    '<li><div id="tp_0_3_1_3"class="paragraf"onmousedown="on_tp_0_3_1(3)"onmouseover="on_tp(1,0,3,1,3)"onmouseout="on_tp(2,0,3,1,3)">Фриволите</div></li><p>' +
                    '<li><div id="tp_0_3_1_3"class="paragraf"onmousedown="on_tp_0_3_1(3)"onmouseover="on_tp(1,0,3,1,3)"onmouseout="on_tp(2,0,3,1,3)">Бисироплитение</div></li><p>' +
                    '<li><div id="tp_0_3_1_3"class="paragraf"onmousedown="on_tp_0_3_1(3)"onmouseover="on_tp(1,0,3,1,3)"onmouseout="on_tp(2,0,3,1,3)">Воляние из шерсти</div></li><p>' +
                    '<li><div id="tp_0_3_1_3"class="paragraf"onmousedown="on_tp_0_3_1(3)"onmouseover="on_tp(1,0,3,1,3)"onmouseout="on_tp(2,0,3,1,3)">Вышивка</div></li><p>' +
                    '<li><div id="tp_0_3_1_4"class="paragraf"onmousedown="on_tp_0_3_1(4)"onmouseover="on_tp(1,0,3,1,4)"onmouseout="on_tp(2,0,3,1,4)">Шитьё</div></li><p>' +
                    '</ul>' +



                    '<p>Многие виды творчества изучались мною по книгам, приведенным в подразделе "Используемая литература". Я заказывала большинство из них на "Ozon"'
                ],
                [//Необходимое для занятий
                ],
                [//Термины
                ],
                [//Рисунки, фото, схемы с расшифровкой
                ],
                [//Особенности данного обучения
                ],
                [//Используемая литература
                ],
            ],
            [//Программирование
                [//Всё, что я знаю из программирования

                ],
                [//Основные понятия языка
                ],
                [//Директивы, операторы, команды, теги
                ],
                [//Примеры программ
                ],
                [//Интересные факты
                ],
                [//Выдающиеся личности
                ],
                [//Задачи для самооценки
                ],
                [//Вопросы для самопроверки
                ],
                [//Используемая литература
                ],
                [//Мои мысли о программировании
                ],
            ],
            [//Алгебра и Геометрия
                [//Обучающий курс
                ],
                [//Теоремы, определения, формулы 
                ],
                [//Графики, таблицы, рисунки
                ],
                [//Интересные факты
                ],
                [//Выдающиеся личности
                ],
                [//Задачи для самооценки
                ],
                [//Вопросы для самопроверки
                ],
                [//Используемая литература
                ],
            ],
            [//Физика
                [//Обучающий курс
                ],
                [//Теоремы, определения, формулы
                ],
                [//Графики, таблицы, рисунки
                ],
                [//Интересные факты
                ],
                [//Выдающиеся личности
                ],
                [//Задачи для самооценки
                ],
                [//Лабораторные работы
                ],
                [//Вопросы для самопроверки
                ],
                [//Используемая литература
                ],
            ],
            [//Химия
                [//Обучающий курс
                ],
                [//Теоремы, определения, формулы
                ],
                [//Графики, таблицы, рисунки
                ],
                [//Вещества, их структура и особенности
                ],
                [//Интересные факты
                ],
                [//Выдающиеся личности
                ],
                [//Задачи для самооценки
                ],
                [//Лабораторные работы
                ],
                [//Вопросы для самопроверки
                ],
                [//Используемая литература
                ],
            ],
            [//Биология
                [//Обучающий курс
                ],
                [//Теоремы, определения, формулы
                ],
                [//Графики, таблицы, рисунки
                ],
                [//Вещества, их структура и особенности
                ],
                [//Животные, птицы, пресноводные, насекомые
                ],
                [//Растения, грибы
                ],
                [//Интересные факты
                ],
                [//Выдающиеся личности
                ],
                [//Задачи для самооценки
                ],
                [//Лабораторные работы
                ],
                [//Вопросы для самопроверки
                ],
                [//Используемая литература
                ],
            ],
            [//История
                [//Обучающий курс
                ],
                [//Хронология важнейших событий
                ],
                [//Политические и военные личности
                ],
                [//Творческие и научные личности
                ],
                [//Реформы, войны
                ],
                [//Культура, быт, религия и обучение
                ],
                [//Условные обозначения и сокращения
                ],
                [//Карты
                ],
                [//Вопросы для самопроверки
                ],
                [//Используемая литература
                ],
            ],
            [//География
                [//Обучающий курс
                ],
                [//Определения, понятия
                ],
                [//Графики, таблицы, рисунки
                ],
                [//Обитатели
                ],
                [//Растения
                ],
                [//Полезные ископаемые
                ],
                [//Интересные факты
                ],
                [//Выдающиеся личности
                ],
                [//Вопросы для самопроверки
                ],
                [//Используемая литература
                ],
            ],
            [//Обществознание
                [//Обучающий курс
                ],
                [//Определения, понятия
                ],
                [//Графики, таблицы, рисунки
                ],
                [//Обитатели
                ],
                [//Растения
                ],
                [//Полезные ископаемые
                ],
                [//Интересные факты
                ],
                [//Выдающиеся личности
                ],
                [//Вопросы для самопроверки
                ],
                [//Используемая литература
                ],
            ],
            [//Экономика
                [//Обучающий курс
                ],
                [//Определения, понятия, формулы
                ],
                [//Графики, таблицы, рисунки
                ],
                [//Денежные курсы
                ],
                [//Интересные факты
                ],
                [//Выдающиеся личности  
                ],
                [//Вопросы для самопроверки
                ],
                [//Используемая литература
                ],
            ],
            [//Литература
                [//Обучающий курс
                ],
                [//Определения
                ],
                [//Даты и события
                ],
                [//Стихи и произведения классиков
                ],
                [//Интересные факты
                ],
                [//Выдающиеся личности
                ],
                [//Вопросы для самопроверки
                ],
                [//Используемая литература
                ],
            ],
            [//Языки стран мира
                [//Обучающий курс
                ],
                [//Алфавит, произношение буквосочетаний
                ],
                [//Правила
                ],
                [//Местоимения, глаголы, причастия
                ],
                [//Словарь
                ],
                [//Интересные факты
                ],
                [//Выдающиеся личности
                ],
                [//Вопросы для самопроверки
                ],
                [//Используемая литература
                ],
            ],
            [//Астрономия
                [//Обучающий курс
                ],
                [//Теоремы, определения, формулы
                ],
                [//Атлас неба
                ],
                [//Планеты
                ],
                [//Звёзды
                ],
                [//Интересные факты 
                ],
                [//Выдающиеся личности
                ],
                [//Вопросы для самопроверки
                ],
                [//Используемая литература
                ],
            ],
            [//Черчение
                [//Обучающий курс
                ],
                [//Теоремы, определения, формулы
                ],
                [//Образцы чертежей
                ],
                [//Необходимое для черчения
                ],
                [//Интересные факты
                ],
                [//Выдающиеся личности
                ],
                [//Вопросы для самопроверки
                ],
                [//Используемая литература
                ],
            ],
            [//Музыка
                [//Обучающий курс
                ],
                [//Определения
                ],
                [//Правила держания рук
                ],
                [//Правила чтения для нот
                ],
                [//Мелодии классики и эстрады
                ],
                [//Интересные факты
                ],
                [//Выдающиеся личности
                ],
                [//Вопросы для самопроверки
                ],
                [//Используемая литература
                ],
            ],
            [//Физкультура
                [//Основные правила зарядки
                ],
                [//Зарядка
                ],
                [//Правила для игр
                ],
            ],
            [//Для дошколят
                [//Обучающие игры для детей
                ],
                [//Чтение вслух с картинками
                ],
                [//Родителям на заметку
                ],
            ],
            [//Энциклопедии
                [//Алфавитный указатель
                ],
                [//По категориям
                ],
                [//Толковый словарь
                ],
            ],
            [//Атласы
                [//
                    
                ],
                [//
                    
                ]
            ],
            [//Законы и кодексы
                [//
                    
                ],
                [//
                    
                ]
            ],
            [//Заметки
                [//Все заметки
                ],
                [//Зачем нужны заметки
                ],
            ]
        ],
        [//Обсуждение 
            [//Беседы
                [//Все беседы
                ],
                [//Беседы по категориям
                ],
                [//Ответы от автора сайта
                ],
            ],
            [//Предложения/критика
                [//Предложения 
                ],
                [//Критика
                ],
            ],
            [//Написать письмо
                [//Бланк отправки
                ]
            ]
        ],
        [//Справка
            [//Инструкция по сайту
                [//Вся инструкция
                ],
                [//Меню сайта
                ],
                [//Содержимое раздела
                ],
                [//Страница
                ],
                [//Боковая панель с окнами
                ],
                [//Смайлик
                ],
            ],
            [//Донаты
                [//Что такое донаты
                ],
                [//Отчёт о полученных донатах
                ],
            ],
            [//Об авторе сайта
                [//Вся история
                ],
                [//Детство и школа
                ],
                [//Переломный момент
                ],
                [//Карьерный взлёт
                ],
            ]
        ]
    ];
nachalo_istorii = '<h2>История Ваших путешествий начиная с конца:</h2>';

//=================================================================================================
function Sait_load() {
    bob.style.background = '#306090';
    bob.style.overflowX = 'hidden';


    okna_width = 20;
    pamyt_p_0_0_3 = 0;
    //---------------------------------------------------------------------------------------------
    str = "";
    //список содержимого раздела
    str += "<div id='okna'onmousemove='panel_izmen(3)'onmousedown='panel_izmen(4)'onmouseup='panel_izmen(5)'> ";
    //---------------------------------------------------------------------------------------------
    //кнопки на 3 окне 
    str_plus = "<td id='na_meste_3'class='c_okno_knopki'onmouseover = 'kn_okna_videlen(1,5)' onmouseout = 'kn_okna_videlen(2,5)'onmousedown='kn_okna_videlen(4,5)'><span id='na_meste_3_a'class='c_na_meste_a'></span><span id='na_meste_3_b'class='c_na_meste_b'></span><span id='na_meste_3_c'class='c_na_meste_c'></span></td>";
    str_plus += "<td id='svert_3'class='c_okno_knopki'onmouseover = 'kn_okna_videlen(1,2)' onmouseout = 'kn_okna_videlen(2,2)'onmousedown='kn_okna_videlen(4,2)'><span id='svert_3_a'class='c_svert_a'></span><span id='svert_3_b'class='c_svert_b'></span></td>";
    //свет и тень на заголовке 3 окна 
    str_plus += "<td><span id='svet_3_okna'class='c_svet_okna'></span><span id='ten_3_okna'class='c_ten_okna'></span></td>"
    //3 дополнительное окошко с закладками
    str += "<table id='okno_zametki' class='c_okno'onmousemove='okno_izmen(2,3)'onmousedown='okno_izmen(2,4)'onmouseup='okno_izmen(2,5)'><tr><td id='okno_name_zametki'class='c_okno_name'></td>" + str_plus + "</tr><tr><td id='okno_text_zametki' class='c_okno_text'></td></tr></table>";
    //свет и тень на заголовке 2 окна
    str_plus = "<td><span id='svet_2_okna'class='c_svet_okna'></span><span id='ten_2_okna'class='c_ten_okna'></span></td>"
    //2 дополнительное окошко с новостями
    str += "<table id='okno_novosti' class='c_okno'onmousemove='okno_izmen(1,3)'onmousedown='okno_izmen(1,4)'onmouseup='okno_izmen(1,5)'><tr><td id='okno_name_novosti'class='c_okno_name'></td>" + str_plus + "</tr><tr><td id='okno_text_novosti' class='c_okno_text'></td></tr></table>";
    //свет и тень на заголовке 1 окна
    str_plus = "<td><span id='svet_1_okna'class='c_svet_okna'></span><span id='ten_1_okna'class='c_ten_okna'></span></td>"
    //1 дополнительное окошко с беседами
    str += "<table id='okno_besedi' class='c_okno'onmousemove='okno_izmen(0,3)'onmousedown='okno_izmen(0,4)'onmouseup='okno_izmen(0,5)'><tr><td id='okno_name_besedi'class='c_okno_name'></td>" + str_plus + "</tr><tr><td id='okno_text_besedi' class='c_okno_text'></td></tr></table>";
    //---------------------------------------------------------------------------------------------
    //тень страницы
    str += "</div><div id='ten_stranici'></div><div id='ten'></div>";
    //---------------------------------------------------------------------------------------------
    //кнопка для двищения оконной панели
    str += "<div id='dvigenie_paneli'onmouseover='kn_dvig_panel(1)'onmouseout='kn_dvig_panel(2)'onmousemove='kn_dvig_panel(3)'onmousedown='kn_dvig_panel(4)'onmouseup='kn_dvig_panel(5)'><div id='dvig_ris'></div></div>";
    //---------------------------------------------------------------------------------------------
    //тень содержимого раздела 2
    str += "<div id='ten1_gl_p'></div>";
    str += "<div id='gl_p_za_str'></div>";
    //---------------------------------------------------------------------------------------------
    //кнопка "< Назад"
    str+="<div id='kn_stran_nazad'class='kn_stran'onmouseup='on_kn_stran_nazad(1)'onmousemove='on_kn_stran_nazad(1)' onmouseover='on_kn_stran_nazad(1)'onmouseout='on_kn_stran_nazad(2)'onmousedown='on_kn_stran_nazad(4)'><div id='svet_kn1'class='c_svet_okna'></div><div id='svet_nadpisi_1'class='svet_nadpisi'>< Назад</div>< Назад<div id='ten_kn1'class='c_ten_okna'style='top:40px;'></div></div>";
    //---------------------------------------------------------------------------------------------
    //кнопка "Поиск"
    str+="<div id='kn_poisk'class='kn_stran'onmouseup='on_kn_poisk(1)' onmousemove='on_kn_poisk(1)' onmouseover='on_kn_poisk(1)'onmouseout='on_kn_poisk(2)'onmousedown='on_kn_poisk(4)'><div id='svet_kn2'class='c_svet_okna'></div><div id='svet_nadpisi_2'class='svet_nadpisi'>Поиск</div>Поиск<div id='ten_kn2'class='c_ten_okna'style='top:40px;'></div></div>";
    //---------------------------------------------------------------------------------------------
    //кнопка "Мнения"
    str+="<div id='kn_mneniy'class='kn_stran'onmouseup='on_kn_mneniy(1)' onmousemove='on_kn_mneniy(1)' onmouseover='on_kn_mneniy(1)'onmouseout='on_kn_mneniy(2)'onmousedown='on_kn_mneniy(4)'><div id='svet_kn3'class='c_svet_okna'></div><div id='svet_nadpisi_3'class='svet_nadpisi'>Мнения</div>Мнения<div id='ten_kn3'class='c_ten_okna'style='top:40px;'></div></div>";
    //---------------------------------------------------------------------------------------------
    in_load_1.innerHTML = str;
    //---------------------------------------------------------------------------------------------
    if (screen.width < screen.height) {

    }
    svet_nadpisi_1.style.visibility=svet_nadpisi_2.style.visibility=svet_nadpisi_3.style.visibility='hidden';
    
    
    minus = plus = 0;
    okgran = 45;
    //---------------------------------------------------------------------------------------------
    //  if (localStorage.getItem('w_s')) { } else localStorage.setItem('w_s', 650);//width_soderganiy_razdela
    //---------------------------------------------------------------------------------------------
    if (localStorage.getItem('nm')) { }else
    localStorage.setItem('nm', 0);//nomer_menu (p_m)
    
   if (localStorage.getItem('nr')){}else 
        localStorage.setItem('nr', 1);//nomer_razdela_v_menu (r_p)
    if (localStorage.getItem('np')) { } else
        localStorage.setItem('np', 0);//nomer_punkta_v_razdele (n_r)
    if(localStorage.getItem('np_1')){}else
    localStorage.setItem('np_1',0);//nomer_paragraf_1_v_punkte
    if(localStorage.getItem('np_2')){}else
    localStorage.setItem('np_2',0);//nomer_paragraf_2_v_punkte
    if(localStorage.getItem('np_3')){}else
    localStorage.setItem('np_3',0);//nomer_paragraf_3_v_punkte
        localStorage.setItem('nn', 0);//nomer_name

    ogl_vibrono = localStorage.getItem('np');
    nm=localStorage.getItem('nm');
    nr=localStorage.getItem('nr');
    np=localStorage.getItem('np');
    np_1=localStorage.getItem('np_1');
    np_2=localStorage.getItem('np_2');
    np_3=localStorage.getItem('np_3');
   
    //---------------------------------------------------------------------------------------------
    document.getElementById('t_s').style.display = 'block';
    if (okna.clientWidth < 130) {
        peremeshenie_okon_svernut = true;
    } else {
        peremeshenie_okon_svernut = false;
    }
    if (scrollY > 150) okno_top = 60; else okno_top = 210 - scrollY;
    
    //---------------------------------------------------------------------------------------------
    if (localStorage.getItem('o_b')) { } else
        localStorage.setItem('o_b', 250);//okno_besedi
    if (localStorage.getItem('o_n')) { } else
        localStorage.setItem('o_n', 250);//okno_novosti
    if (localStorage.getItem('o_z')) { } else
        localStorage.setItem('o_z', 250);//okno_zametki
    //---------------------------------------------------------------------------------------------
    okno_besedi.style.height = localStorage.getItem('o_b');
    okno_novosti.style.height = localStorage.getItem('o_n');
    okno_zametki.style.height = localStorage.getItem('o_z');
    //---------------------------------------------------------------------------------------------
    if (innerHeight < okno_top + okno_besedi.clientHeight + okno_novosti.clientHeight + okno_zametki.clientHeight + 30) okna_umen();
    //---------------------------------------------------------------------------------------------
    perem = okno_top;
    okb = perem;
    okno_besedi.style.top = perem + 'px';
    perem += okno_besedi.clientHeight + 10;
    okn = perem;
    okno_novosti.style.top = perem + 'px';
    perem += okno_novosti.clientHeight + 10;
    okz = perem;
    okno_zametki.style.top = perem + 'px';
    //---------------------------------------------------------------------------------------------
    limit = 270;
    okna.style.height = limit + stranica.clientHeight + 'px';
    //---------------------------------------------------------------------------------------------
    soderg_width = 650;
    soderg_left=70;
    soderg_del = (650) / 10;
    //---------------------------------------------------------------------------------------------
    gl_p_za_str.style.width = soderg_width + 'px';
    gl_p_za_str.style.left = soderg_left + 'px';
    gl_p_za_str.innerHTML = "Содержимое раздела: <div id='kn_za_str2' onmouseover='kn_za_str2_(1)' onmouseout='kn_za_str2_(2)' onmousedown='kn_za_str2_(4)'></div>";
    //---------------------------------------------------------------------------------------------
    
    //// -------------УРА!!!! Зделала ;) -------------------
    if(nm==0&&nr==3&&(np>-1&&np<3)&&np_1>0){
        document.getElementById('t_s').innerHTML = array_text[nm][nr- 1][6][np_1-1][0];
master_ym=true;
    }else{
        document.getElementById('t_s').innerHTML = array_text[nm][nr- 1][np][np_1];
    
    
    master_ym=false;
    }

    //---------------------------------------------------------------------------------------------
    //кнопка для возвращения назад на верх страницы и содержимое раздела по пунктам
    
    soderg_razdela();

    //---------------------------------------------------------------------------------------------
    stranica.style.width = innerWidth - 152 - okna.clientWidth + 'px';
    ten_stranici.style.width = stranica.clientWidth + 'px';
    //---------------------------------------------------------------------------------------------
    //stranica_left = 130;
    stranica_top = 220;
    
    
    up();
    
    //---------------------------------------------------------------------------------------------
    if(nm==0&&nr==3&&(np>-1&&np<3)&&np_1>0){}else{
    
    }
    //---------------------------------------------------------------------------------------------
    na_meste_3.style.right = '40px';
    svert_3.style.right = '10px';
    //---------------------------------------------------------------------------------------------
    okno_name_besedi.innerHTML = 'Беседы';
    okno_name_novosti.innerHTML = 'Новости';
    okno_name_zametki.innerHTML = 'Заметки';

    //---------------------------------------------------------------------------------------------
    if (innerHeight < 840) okno_besedi.style.height = okno_novosti.style.height = okno_zametki.style.height = (innerHeight - 240) / 3 + 'px';
    //---------------------------------------------------------------------------------------------
    perem = 0;
    //---------------------------------------------------------------------------------------------
    
    //---------------------------------------------------------------------------------------------
    str="";
    //тень под названием раздела
    str += "<div id='razdel_teni'></div>";
    //---------------------------------------------------------------------------------------------
    //название раздела
    str += "<div id='razdel'></div>";
    //---------------------------------------------------------------------------------------------
    //создание кнопок, окон для метки и интеса
    str +="<div id='poisk'></div><div id='ym_foto'></div><div id='ten_interes'></div><div id='interes_div'></div><canvas id='interes_treug'></canvas><div id='ten_metka'></div><div id='metka_div'></div><canvas id='metka_treug'></canvas>";
    //---------------------------------------------------------------------------------------------
    //тень верхней полоски меню
    str += "<div id='ten_menu'></div>";
    //---------------------------------------------------------------------------------------------
    //верхняя полоска меню
    str += "<table><tr><td id='menu_line'onmouseout = 'menu_(2,0,0)'><table id = 'menu' onmouseout = 'menu_(2,0,0)'><tr><td id = 'm_g' class='c_m_g' onmouseover = 'menu_(1,0,0)' onmouseout = 'menu_(2,0,0)' onmousemove='menu_(3,0,0)'></td ><td id='m_razdelitel'align='center'>|</td><td id='m_y' class='c_m_g' onmouseover='menu_(1,0,1)' onmouseout='menu_(2,0,1)'onmousemove='menu_(3,0,1)'></td><td align='center'>|</td><td id='m_os' class='c_m_g' onmouseover='menu_(1,0,2)' onmouseout='menu_(2,0,2)'onmousemove='menu_(3,0,2)'></td><td align='center'>|</td><td id='m_s' class='c_m_g' onmouseover='menu_(1,0,3)' onmouseout='menu_(2,0,3)'onmousemove='menu_(3,0,3)'></td></tr></table ></td></tr></table>";
    //---------------------------------------------------------------------------------------------
    //тени названия сайта
    str += "<div id='name_sait1_teni' ></div><div id='name_sait2_teni'style='filter:blur(7px)'></div>";
    //название сайта
    str += "<div id='name_sait1'></div><div id='name_sait2'></div>";
    //---------------------------------------------------------------------------------------------
    //развёрнутые списки менюшек
    str += "<div id='m1'></div><div id='m2'></div><div id='m3'></div><div id='m4'></div>";
    
    //помошник

    str += "<div id='ten_line_pomoshnik'></div>";

    str += "<span id='pomoshnik'></span><hr id='line_pomoshnik' color='#80b0ff' />";

    //предупреждение
    //str += "<div id='predupr'>" + predupregd + "</div>";
    str += "<span id='ten_kn_prydki'></span><span id='kn_prydki'onmouseover='kn_prydki_(1)'onmouseout='kn_prydki_(2)'onmousedown='kn_prydki_(4)'></span>";
    
    in_load_3.innerHTML = str;
    //---------------------------------------------------------------------------------------------
    //имя с тенью раздела сайта на который перешли
    document.getElementById('razdel_teni').innerHTML = document.getElementById('razdel').innerHTML = array_menu[localStorage.getItem('nm') - 0 + 1][localStorage.getItem('nr') - 1];
    //---------------------------------------------------------------------------------------------
    //sleva.innerHTML = "";
    //line_pomoshnik.style.top = innerHeight - 60 + 'px';
    pomoshnik.innerHTML = "<span id='ten_pomoshnika'></span><span id='telo'></span><span id='svet_tela'></span><span id='glaz_l'></span><span id='glaz_r'></span><span id='guba'></span>";
    glaz_l.innerHTML = "<span id='svet_glaz_l' class='c_svet_glaz'></span><span id='sheka_l'></span>";
    glaz_r.innerHTML = "<span id='svet_glaz_r' class='c_svet_glaz'></span><span id='sheka_r'></span>";
    guba.innerHTML = "<span id='guba_1'></span><span id='guba_2'></span>";
    //---------------------------------------------------------------------------------------------
    //поиск на странице
    poisk.style.width=stranica.clientWidth-20+'px';
   // poisk.style.height='10px';
    poisk.style.left='122px';
    if(master_ym)poisk.style.top=kn_stran_nazad.clientHeight+  270+'px';
else poisk.style.top=gl_p.clientHeight+kn_poisk.clientHeight+  250+'px';
    
    poisk.innerHTML=array_kn[0];
    isk.style.left=poisk_str.clientWidth+25+'px';
    isk.style.top=poisk.clientHeight-60+'px';
    guba_2.style.visibility = 'hidden';
    //---------------------------------------------------------------------------------------------
    kn_prydki.innerHTML = '<';
    kn_prydki.style.top = innerHeight - 64 + 'px';
    ten_kn_prydki.style.top = innerHeight - 60 + 'px';
    ten_kn_prydki.style.visibility = kn_prydki.style.visibility = 'hidden';
    //---------------------------------------------------------------------------------------------
    //if (localStorage.getItem('l_p')) { } else
    localStorage.setItem('l_p', 0);  //left_pomoshnik
    
    ym_foto.style.visibility="hidden";
    
    pomoshnik_go(0);
    ten_line_pomoshnik.style.top=innerHeight-60+'px';
    line_pomoshnik.style.top=innerHeight-73+'px';
    //---------------------------------------------------------------------------------------------
    name_sait1.innerText = array_name_sait[0];
    name_sait1_teni.innerText = array_name_sait[0];
    name_sait2.innerText = array_name_sait[1];
    name_sait2_teni.innerText = array_name_sait[1];
    ns_a = 2; ns_b = 1; ns_i = 0;
    ns_c = ns_d = 0;
    //---------------------------------------------------------------------------------------------
    m_g.innerHTML = array_menu[0][0];
    m_y.innerHTML = array_menu[0][1];
    m_os.innerHTML = array_menu[0][2];
    m_s.innerHTML = array_menu[0][3];
    //---------------------------------------------------------------------------------------------

    setTimeout('sait_load_dopolnit()', 10);
}

//=================================================================================================
function sait_load_dopolnit() {
    menu_width = 300;
    m1_left = 22; m2_left = m1_left + m_g.clientWidth + m_razdelitel.clientWidth + 4; m3_left = m2_left + m_y.clientWidth + m_razdelitel.clientWidth + 4; m4_left = m3_left + m_os.clientWidth + m_razdelitel.clientWidth + 4; m_b = 1;
    ms = [["m_g", 8, m1_left, 4], ["m_y", 23, m2_left, 6], ["m_os", 4, m3_left, 2], ["m_s", 4, m4_left, 2]];
    //---------------------------------------------------------------------------------------------
    str = "<div id='ten_m'></div>";
    str += "<div id='m_g_0'class='c_m_o'onmouseover='menu_(1,1,0)'onmouseleave='menu_(2,1,0)'onmousemove='menu_(3,1,0)'>"
    for (i = 1; i < ms[0][1]; i++)str += "<div id='m_g_" + i + "'class='c_m'onmouseover='menu_(1," + (i + 1) + ",0)'onmouseout='menu_(2," + (i + 1) + ",0)'onclick='menu_(4," + (i + 1) + ",0)'></div>";
    str += "<hr id='m_g_l_0'class='c_m_line_0'color='black'size='1'/><hr id='m_g_l_1'class='c_m_line_1'color='white'size='1'/><hr id='m_g_l_2'class='c_m_line_2'color='black'size='1'/><hr id='m_g_l_3'class='c_m_line_3'color='white'size='1'/></div>";
    m1.innerHTML = str;
    for (i = 0; i < ms[0][1] - 1; i++)document.getElementById(ms[0][0] + '_' + (i + 1)).innerText = array_menu[1][i];
    //---------------------------------------------------------------------------------------------
    str = "<div id='m_y_0'class='c_m_o'onmouseover='menu_(1,1,1)'onmouseout='menu_(2,1,1)'onmousemove='menu_(3,1,1)'>"
    for (i = 1; i < ms[1][1]; i++)str += "<div id='m_y_" + i + "'class='c_m'onmouseover='menu_(1," + (i + 1) + ",1)'onmouseout='menu_(2," + (i + 1) + ",1)'onclick='menu_(4," + (i + 1) + ",1)'></div>";
    str += "<hr id='m_y_l_0' class='c_m_line_0' color='black' size='1'/><hr id='m_y_l_1' class='c_m_line_1' color='white' size='1'/><hr id='m_y_l_2'class='c_m_line_4' color='black' size='1'/><hr id='m_y_l_3'class='c_m_line_5' color='white' size='1'/><hr id='m_y_l_4'class='c_m_line_6' color='black' size='1'/><hr id='m_y_l_5'class='c_m_line_7' color='white' size='1'/></div > ";
    m2.innerHTML = str;
    for (i = 0; i < ms[1][1] - 1; i++)document.getElementById(ms[1][0] + '_' + (i + 1)).innerText = array_menu[2][i];
    //---------------------------------------------------------------------------------------------
    str = "<div id='m_os_0'class='c_m_o'onmouseover='menu_(1,1,2)'onmouseout='menu_(2,1,2)'onmousemove='menu_(3,1,2)'>"
    for (i = 1; i < ms[2][1]; i++)str += "<div id='m_os_" + i + "'class='c_m'onmouseover='menu_(1," + (i + 1) + ",2)'onmouseout='menu_(2," + (i + 1) + ",2)'onclick='menu_(4," + (i + 1) + ",2)'></div>";
    str += "<hr id='m_os_l_0' class='c_m_line_0' color='black' size='1'/><hr id='m_os_l_1' class='c_m_line_1' color='white' size='1'/></div > ";
    m3.innerHTML = str;
    for (i = 0; i < ms[2][1] - 1; i++)document.getElementById(ms[2][0] + '_' + (i + 1)).innerText = array_menu[3][i];
    //---------------------------------------------------------------------------------------------
    str = "<div id='m_s_0'class='c_m_o'onmouseover='menu_(1,1,3)'onmouseout='menu_(2,1,3)'onmousemove='menu_(3,1,3)'>"
    for (i = 1; i < ms[3][1]; i++)str += "<div id='m_s_" + i + "'class='c_m'onmouseover='menu_(1," + (i + 1) + ",3)'onmouseout='menu_(2," + (i + 1) + ",3)'onclick='menu_(4," + (i + 1) + ",3)'></div>";
    str += "<hr id='m_s_l_0'class='c_m_line_0' color='black' size='1'/><hr id='m_s_l_1'class='c_m_line_1' color='white' size='1'/></div > ";
    m4.innerHTML = str;
    for (i = 0; i < ms[3][1] - 1; i++)document.getElementById(ms[3][0] + '_' + (i + 1)).innerText = array_menu[4][i];
    //---------------------------------------------------------------------------------------------
    for (j = 0; j < 4; j++) {
        m = [];
        for (i = 0; i < ms[j][1]; i++) { m[i] = document.getElementById(ms[j][0] + "_" + i); }
        m[0].style.height = (ms[j][1] - 1) * text_size + 'px';
        m[0].style.left = ms[j][2] + 'px';
        mm = document.getElementById(ms[j][0]).clientWidth;
        if (m[0].clientWidth <= mm) m[0].style.width = mm + 10 + 'px';
        t = 2;
        for (i = 1; i < m.length; i++) {
            m[i].style.top = t + 'px';
            t += text_size;
        }
    }
    m_i = 0;
    //---------------------------------------------------------------------------------------------
    //interes_treug.style.visibility='hidden';
    in_tr=interes_treug.getContext('2d');
    
      interes_treug.width=20;
    interes_treug.height=20;
    in_tr.beginPath();  
    in_tr.fillStyle='#ffefe0';
    in_tr.fillRect(10,2,1,2);
    in_tr.fillRect(9,4,2,2);
    in_tr.fillRect(8,6,3,2);
    in_tr.fillRect(7,8,5,2);
    in_tr.fillRect(6,10,6,2);
    in_tr.fillRect(5,12,8,2);
    in_tr.fillRect(4,14,9,2);
    in_tr.fillRect(3,16,11,2);
    in_tr.fillRect(2,18,12,2);
    
    in_tr.strokeStyle='#604020';
    
    in_tr.lineWidth=2;

    in_tr.moveTo(10,0);
    in_tr.lineTo(1,20);
    in_tr.moveTo(10,0);
    in_tr.lineTo(15,20);
    
in_tr.stroke();
    //---------------------------------------------------------------------------------------------
    //metka_treug.style.visibility='hidden';
    met_tr=metka_treug.getContext('2d');
    metka_treug.style.top='120px';
      metka_treug.width=20;
    metka_treug.height=20;
    met_tr.beginPath();  
    
    
    met_tr.fillStyle='#efffe0';
    met_tr.fillRect(10,2,1,2);
    met_tr.fillRect(9,4,2,2);
    met_tr.fillRect(8,6,3,2);
    met_tr.fillRect(7,8,5,2);
    met_tr.fillRect(6,10,6,2);
    met_tr.fillRect(5,12,8,2);
    met_tr.fillRect(4,14,9,2);
    met_tr.fillRect(3,16,11,2);
    met_tr.fillRect(2,18,12,2);
    met_tr.strokeStyle='#00a010';
    
    met_tr.lineWidth=2;

    met_tr.moveTo(10,0);
    met_tr.lineTo(1,20);
    met_tr.moveTo(10,0);
    met_tr.lineTo(15,20);
met_tr.stroke();


    //---------------------------------------------------------------------------------------------
    stranici_right = stranica_left + stranica.clientHeight;
    stranica_left_p = stranica_left;
    
    //master_ym=false;
    kn_stran_nazad_down=false;
    kn_poisk_down=false;
    kn_mneniy_down=false;
    
    paragraf_nomer=0;
    reshenie_nomer=0;
//ym_div_on=false;
    interes_on=false;
interes_nomer=0;
    metka_on=false;
    metka_nomer=0;
    metka_left=0;


    gl_p_vis_hidden = false;
    deform_okno_besedi_down = false;
    deform_okno_novosti_down = false;
    deform_okno_zametki_down = false;
    peremeshenie_okon_down = false;
    peremeshenie_okon_svernut = false;
    peremeshenie_okon_fiksaciy = 0;
    kn_prydki_skrita = true;
    kn_prydki_start = false;
    okna_svernuti = false;
    nachalo_napisano = false;
    staroe_x = innerWidth;
    staroe_y = innerHeight;
    peremeshenie_vniz = 0;
    posle_scroll = false;
    kn_nazad_vidna = false;

    soderg_rabota = true;
    soderg_izmen = 30;
    soderg_variant = 0;
    soderg_index = 0;

    dvig_pan_rabota = false;
    dvig_pan_del = 0;
    dvig_pan_variant = 0;
    dvig_pan_konec = osnova.clientWidth - 20;
    dvig_pan_index = 0;

    prydki_index = 0;
    prydki_variant = 0;
    prydki_rabota = false;
    prydki_del = 0;
    prydki_perem = 0;


    setTimeout('izmen_win()', 4);
    pom_etap_vipolnen = false;
    pom_etap = 1;
    pom_et_nomer = 0;


}
//=================================================================================================
function pomoshnik_go(deistvie){
//ten_pomoshnika left=20 bottom=0
//telo                0         10
//svet_tela           10        20
//glaz_l              25        60
//glaz_r              60        60
//guba
switch(deistvie){
    case 0:
    pomoshnik.style.top=innerHeight-179+scrollY+'px';
    ten_pomoshnika.style.top=20+'px';
    telo.style.top=10+'px';
    svet_tela.style.top=20+'px';
    glaz_l.style.top=glaz_r.style.top='45px';
    guba_1.style.top='75px';
    
    break;
}
}
//=================================================================================================
function prydki_() {
    switch (prydki_variant) {
        case 0:
            prydki_rabota = true;
            prydki_del = line_pomoshnik.clientWidth / 10;
            prydki_index = line_pomoshnik.clientWidth;
            kn_prydki_skrita = false;
            kn_prydki_start = true;
            kn_prydki.style.visibility = 'visible';
            ten_kn_prydki.style.visibility = 'visible';
            pomoshnik.style.left = '40px';
            prydki_variant++;
            break;
        case 1:
            if (prydki_index > -prydki_del) {
                prydki_index -= prydki_del;
                pomoshnik.style.left = pomoshnik.style.left.slice(0, pomoshnik.style.left.length - 2) - prydki_del + 'px';
                line_pomoshnik.style.width = prydki_index + 'px';
                ten_line_pomoshnik.style.width = prydki_index + 10 + 'px';
                ten_kn_prydki.style.left = kn_prydki.style.left = line_pomoshnik.clientWidth + 'px';
            }
            else {
                ten_line_pomoshnik.style.visibility = 'hidden';
                line_pomoshnik.style.visibility = 'hidden';
                kn_prydki_start = true;
                kn_prydki.style.left = 0 + 'px';
                kn_prydki.style.borderTopLeftRadius = '0px';
                kn_prydki.style.borderLeft = '0px';
                kn_prydki.style.width = 35 + 'px';
                kn_prydki.innerHTML = '>';
                ten_kn_prydki.style.visibility = kn_prydki.style.visibility = 'visible';
                prydki_perem = 50;
                ten_kn_prydki.style.left = '0px';
                localStorage.setItem('l_p', 1);
                prydki_rabota = false;
                prydki_variant++;
            }
            break;
        case 2:
            kn_prydki.style.visibility = 'visible';
            ten_kn_prydki.style.visibility = 'visible';
            ten_line_pomoshnik.style.visibility = 'visible';
            line_pomoshnik.style.visibility = 'visible';
            kn_prydki.style.borderTopLeftRadius = '10px';
            kn_prydki.style.border = '2px solid #104070';
            kn_prydki.style.width = 40 + 'px';
            perem = 1;
            prydki_variant++;
            break;
        case 3:
            if (prydki_index < 160) {
                prydki_index += prydki_del;
                pomoshnik.style.left = pomoshnik.style.left.slice(0, pomoshnik.style.left.length - 2) - 0 + prydki_del + 'px';
                line_pomoshnik.style.width = prydki_index + 'px';
                ten_line_pomoshnik.style.width = prydki_index + 10 + 'px';
                ten_kn_prydki.style.left = kn_prydki.style.left = line_pomoshnik.clientWidth + 'px';
            }
            else {
                kn_prydki.style.left = 160 + 'px';
                kn_prydki.innerHTML = '<';
                kn_prydki_start = false;
                ten_kn_prydki.style.visibility = kn_prydki.style.visibility = 'hidden';
                ten_kn_prydki.style.left = '160px';
                pomoshnik.style.left = '40px';
                localStorage.setItem('l_p', 0);
                prydki_rabota = false;
                prydki_variant = 0;
            }
            break;
    }
    if (prydki_rabota) setTimeout('prydki_()', 50);
}
//=================================================================================================
function kn_prydki_(deistvie) {
    color_kn = '#b0d0f0';
    color_strelka = '#104070';
    color_kn_vibrana = '#70f0b0';
    switch (deistvie) {
        case 1://over
            kn_prydki.style.cursor = 'default';
            kn_prydki.style.backgroundColor = color_kn_vibrana;
            break;
        case 2://out
            kn_prydki.style.backgroundColor = color_kn;
            break;
        case 3://move
            break;
        case 4://down
            prydki_rabota = true;
            if (localStorage.getItem('l_p') == 0) prydki_variant = 0; else prydki_variant = 2;
            prydki_();
            break;
    }
}
//=================================================================================================
function kn_dvig_panel(deistvie) {
    color_kn = '#5080b0';
    color_videl = '#80b0e0';
    switch (deistvie) {
        case 1://over
            dvigenie_paneli.style.backgroundColor = color_videl;
            dvigenie_paneli.style.cursor = 'ew-resize';
            break;
        case 2://out
            dvigenie_paneli.style.backgroundColor = color_kn;
            break;
        case 3://move

            break;
        case 4://douwn
            peremeshenie_okon_down = true;
            peremeshenie_okon_fiksaciy = event.clientX;
            event.returnValue = false;
            break;
        case 5://up
            peremeshenie_okon_down = false;
            if (peremeshenie_okon_fiksaciy == event.clientX) {
                dvig_pan_rabota = true;
                //dvig_pan_variant = 0;
                setTimeout('dvig_panel()', 50);
                ten_kn_nazad.style.left = kn_nazad.style.left = stranica.clientWidth + stranica_left + 'px';
            }
            event.returnValue = true;
            break;
    }
}
//=================================================================================================
function dvig_panel() {
    switch (dvig_pan_variant) {
        case 0:
            dvig_pan_del = okna.clientWidth / 10;
            dvig_pan_index = osnova.clientWidth - okna.clientWidth + dvig_pan_del;
            dvig_pan_variant++;
            okna.style.left = dvig_pan_index + 'px';
            okna.style.width = okna.clientWidth - dvig_pan_del + 'px';
            ten_stranici.style.width = stranica.style.width = stranica.clientWidth + dvig_pan_del - 5 + 'px';
            dvigenie_paneli.style.left = dvig_pan_index - 10 + 'px';
            ten_kn_nazad.style.left = kn_nazad.style.left = dvig_pan_index - 30 + 'px';
            break;
        case 1:
            if (okna.clientWidth - dvig_pan_del > 20) {
                dvig_pan_index += dvig_pan_del;

                okna.style.left = dvig_pan_index + 'px';
                perem = okna.style.left.slice(0, okna.style.left.length - 2) - 0;
                okna.style.width = osnova.clientWidth - perem + 'px';
                ten_stranici.style.width = stranica.style.width = perem - stranica_left - 10 + 'px';
                dvigenie_paneli.style.left = dvig_pan_index - 10 + 'px';
                ten_kn_nazad.style.left = kn_nazad.style.left = dvig_pan_index - 30 + 'px';
            } else {
                okna.style.left = osnova.clientWidth - 20 + 'px';
                okna.style.width = '20px';
                dvigenie_paneli.style.left = osnova.clientWidth - 30 + 'px';
                ten_kn_nazad.style.left = kn_nazad.style.left = osnova.clientWidth - 50 + 'px';
                ten_stranici.style.width = stranica.style.width = osnova.clientWidth - stranica_left - 30 + 'px';
                dvig_pan_rabota = false;
                dvig_pan_variant = 2;
                peremeshenie_okon_svernut = true;
            }


            break;
        case 2:
            dvig_pan_del = 27;
            dvig_pan_index = osnova.clientWidth - 20 - dvig_pan_del;
            dvig_pan_variant++;
            okna.style.left = dvig_pan_index + 'px';
            okna.style.width = osnova.clientWidth - okna.style.left.slice(0, okna.style.left.length - 2) - 0 + 'px';
            ten_stranici.style.width = stranica.style.width = stranica.clientWidth - dvig_pan_del + 10 + 'px';
            dvigenie_paneli.style.left = dvig_pan_index - 10 + 'px';
            ten_kn_nazad.style.left = kn_nazad.style.left = dvig_pan_index - 30 + 'px';
            break;
        case 3:
            if (okna.clientWidth + dvig_pan_del < 260) {
                dvig_pan_index -= dvig_pan_del;

                okna.style.left = dvig_pan_index + 'px';
                perem = okna.style.left.slice(0, okna.style.left.length - 2) - 0;
                okna.style.width = osnova.clientWidth - perem + 'px';
                okno_besedi.style.width = okno_novosti.style.width = okno_zametki.style.width = okna.clientWidth - 30 + 'px';
                ten_stranici.style.width = stranica.style.width = perem - stranica_left - 10 + 'px';
                dvigenie_paneli.style.left = dvig_pan_index - 10 + 'px';
                ten_kn_nazad.style.left = kn_nazad.style.left = dvig_pan_index - 30 + 'px';
            } else {
                okna.style.left = osnova.clientWidth - 270 + 'px';
                okna.style.width = '270px';
                okno_besedi.style.width = okno_novosti.style.width = okno_zametki.style.width = okna.clientWidth - 30 + 'px';
                dvigenie_paneli.style.left = osnova.clientWidth - 280 + 'px';
                ten_kn_nazad.style.left = kn_nazad.style.left = osnova.clientWidth - 300 + 'px';
                ten_stranici.style.width = stranica.style.width = osnova.clientWidth - stranica_left - 280 + 'px';
                dvig_pan_rabota = false;
                dvig_pan_variant = 0;
                peremeshenie_okon_svernut = false;
            }


            break;
    }
    if (dvig_pan_rabota) setTimeout('dvig_panel()', 50);

}

//=================================================================================================

function kn_za_str_(deistvie) {
    color_kn = '#b0c0f0';
    color_ris = '#304050';
    color_videl = '#6080c0';
    color_videl_ris = '#c0ffe0';
    switch (deistvie) {
        case 1://over
            kn_za_str.style.backgroundColor = color_videl;
            ris_min.style.backgroundColor = color_videl;
            ris_min.style.borderColor = color_videl_ris;
            ris_v.style.color = color_videl_ris;
            ris_kn_za_str.style.borderColor = color_videl_ris;
            ris_str.style.backgroundColor = color_videl_ris;
            kn_za_str.style.cursor = 'default';
            break;
        case 2://out
            kn_za_str.style.backgroundColor = color_kn;
            ris_min.style.backgroundColor = color_kn;
            ris_min.style.borderColor = color_ris;
            ris_v.style.color = color_ris;
            ris_kn_za_str.style.borderColor = color_ris;
            ris_str.style.backgroundColor = color_ris;
            break;
        case 3://move

            break;
        case 4://douwn
            scroll(0, 0);
            //if (localStorage.getItem('l_p') == 0) {
            //    prydki_variant = 0;
            //    prydki_();
            //}
            ten2_gl_p.style.visibility = gl_p.style.visibility = 'visible';
            //dvig_pan_rabota = true;
            //dvig_pan_variant = 0;
            //setTimeout('dvig_panel()', 20);
            soderg_rabota = true;
            soderg_variant=0;
            setTimeout('soderg_control()', 10);
            break;

    }
}
//=================================================================================================
function kn_za_str2_(deistvie) {
    color_kn = '#b0c0f0';
    color_ris = '#304050';
    color_videl = '#6080c0';
    color_videl_ris = '#c0ffe0';
    switch (deistvie) {
        case 1://over
            kn_za_str2.style.backgroundColor = color_videl;
            ris_min2.style.backgroundColor = color_videl;
            ris_min2.style.borderColor = color_videl_ris;
            ris_v2.style.color = color_videl_ris;
            ris_kn_za_str2.style.borderColor = color_videl_ris;
            ris_str2.style.backgroundColor = color_videl_ris;
            kn_za_str2.style.cursor = 'default';
            break;
        case 2://out
            kn_za_str2.style.backgroundColor = color_kn;
            ris_min2.style.backgroundColor = color_kn;
            ris_min2.style.borderColor = color_ris;
            ris_v2.style.color = color_ris;
            ris_kn_za_str2.style.borderColor = color_ris;
            ris_str2.style.backgroundColor = color_ris;
            break;
        case 3://move

            break;
        case 4://douwn
            soderg_rabota = true;
            soderg_variant = 2;
            setTimeout('soderg_control()', 50);
            break;

    }
}
//=================================================================================================
function soderg_control() {
    switch (soderg_variant) {
        case 0: if (soderg_index < 10) {
            soderg_index++;
            soderg_izmen -= soderg_del;
            ten1_gl_p.style.left = ten2_gl_p.style.left = gl_p.style.left = soderg_izmen + 'px';
            perem = soderg_izmen + 30 + 'px';
            perem2 = soderg_razdela_1.clientWidth - 100 + soderg_izmen + 14 + 'px';
            for (i = 0; i < array_razd_p[localStorage.getItem('nm')][localStorage.getItem('nr') - 1].length; i++) {
                if (ogl_vibrono != i) {
                    document.getElementById('p_' + i).style.left = perem;
                    document.getElementById('tp_' + i).style.left = perem2;
                }
            }
            stranica_left -= 5;
            ten_stranici.style.left = stranica.style.left = stranica_left + 'px';
            ten_stranici.style.width = stranica.style.width = stranica.clientWidth + 5 + 'px';
        } else {
            soderg_variant++;
            soderg_index = 0;
            soderg_razdela_2.style.width = stranica_left + 'px';
            soderg_razdela_2.style.top = '180px';
            ten2_gl_p.style.visibility = 'hidden';
            ten1_gl_p.style.visibility = 'visible';
            ten1_gl_p.style.filter = 'blur(4px)';
            ten1_gl_p.style.top = '180px';
            kn_za_str2.innerHTML = "<div id='ris_kn_za_str2'></div><div id='ris_min2'></div><div id='ris_v2'></div><div id='ris_str2'></div>";
            ris_v2.innerHTML = 'v';
            kn_za_str2.style.left = gl_p.clientWidth - 70 + 'px';
            localStorage.setItem('ogl_v', document.getElementById('p_' + ogl_vibrono).style.top);
            pamyt_ogl_vibr = soderg_izmen2 = ogl_vibrono_copiy.style.top.slice(0, ogl_vibrono_copiy.style.top.length - 2) - 0;
            pamyt_stran = 125;
            soderg_del2 = (soderg_izmen2 - 230) / 5;
            soderg_izmen2 -= soderg_del2;
            ogl_vibrono_copiy.style.top = soderg_izmen2 + 'px';
            ten_vibronogo_p.style.top = soderg_izmen2 + 1 + 'px';
            pamyt_pad = soderg_izmen_pad = text_stranici.style.paddingTop.slice(0, text_stranici.style.paddingTop.length - 2) - 0;

            soderg_del_pad = (soderg_izmen_pad - 50) / 5;
            gl_p_za_str.style.visibility = 'visible';
        } break;
        case 1: if (soderg_index < 10) {
            soderg_index++;
            soderg_izmen += soderg_del;
            ten1_gl_p.style.left = gl_p.style.left = gl_p_za_str.style.left = soderg_izmen + 'px';
            perem = soderg_izmen + 30 + 'px';
            perem2 = soderg_razdela_1.clientWidth - 100 + soderg_izmen + 14 + 'px';
            for (i = 0; i < array_razd_p[localStorage.getItem('nm')][localStorage.getItem('nr') - 1].length; i++) {
                if (ogl_vibrono != i) {
                    document.getElementById('p_' + i).style.left = perem;
                    document.getElementById('tp_' + i).style.left = perem2;
                }
            }
            if (soderg_izmen2 > 240) {
                soderg_izmen2 -= soderg_del2;
                ogl_vibrono_copiy.style.top = soderg_izmen2 + 'px';
                ten_vibronogo_p.style.top = soderg_izmen2 + 1 + 'px';
            }
            if (soderg_izmen_pad > 70) {
                soderg_izmen_pad -= soderg_del_pad;
                text_stranici.style.paddingTop = soderg_izmen_pad + 'px';
            }
            if (stranica_left > 50) {
                stranica_left -= 5;
                ten_stranici.style.left = stranica.style.left = soderg_razdela_2.style.width = stranica_left + 'px';
                ten_stranici.style.width = stranica.style.width = stranica.clientWidth + 5 + 'px';
            }
        } else {

            soderg_index = soderg_variant = 0;
            soderg_izmen = 30;
            soderg_rabota = false;
            up();
            osnova.style.height=osnova.clientHeight-gl_p.clientHeight+70+'px';
            
        } break;
        case 2:
            if (soderg_index < 10) {
                soderg_index++;
                soderg_izmen -= soderg_del;
                ten1_gl_p.style.left = gl_p.style.left = gl_p_za_str.style.left = soderg_izmen + 'px';
                perem = soderg_izmen + 30 + 'px';
                perem2 = soderg_razdela_1.clientWidth - 100 + soderg_izmen + 14 + 'px';
                for (i = 0; i < array_razd_p[localStorage.getItem('nm')][localStorage.getItem('nr') - 1].length; i++) {
                    if (ogl_vibrono != i) {
                        document.getElementById('p_' + i).style.left = perem;
                        document.getElementById('tp_' + i).style.left = perem2;
                    }
                }
                if (soderg_izmen2 < pamyt_ogl_vibr) {
                    soderg_izmen2 += soderg_del2;
                    ogl_vibrono_copiy.style.top = soderg_izmen2 + 'px';
                    ten_vibronogo_p.style.top = soderg_izmen2 + 1 + 'px';
                }
                if (soderg_izmen_pad < pamyt_pad) {
                    soderg_izmen_pad += soderg_del_pad;
                    text_stranici.style.paddingTop = soderg_izmen_pad + 'px';
                }
                if (stranica_left < pamyt_stran) {
                    stranica_left += 5;
                    ten_stranici.style.left = stranica.style.left = soderg_razdela_2.style.width = stranica_left + 'px';
                    ten_stranici.style.width = stranica.style.width = stranica.clientWidth - 5 + 'px';
                }

            }
            else {
                soderg_variant++;
                soderg_index = 0;
                gl_p_za_str.style.visibility = 'hidden';
                ten1_gl_p.style.filter = 'blur(10px)';
                ten1_gl_p.style.top = '202px';
                soderg_razdela_2.style.top = '200px';
                soderg_razdela_2.style.width = soderg_razdela_1.clientWidth + 'px';
                ten2_gl_p.style.left = gl_p.style.left;
                ten2_gl_p.style.visibility = 'visible';

            } break;
        case 3:
            if (soderg_index < 10) {
                soderg_index++;
                if (soderg_izmen < 30) {
                    soderg_izmen += soderg_del;
                    ten1_gl_p.style.left = ten2_gl_p.style.left = gl_p.style.left = soderg_izmen + 'px';

                    perem = soderg_izmen + 30 + 'px';
                    perem2 = soderg_razdela_1.clientWidth - 100 + soderg_izmen + 14 + 'px';
                    for (i = 0; i < array_razd_p[localStorage.getItem('nm')][localStorage.getItem('nr') - 1].length; i++) {
                        if (ogl_vibrono != i) {
                            document.getElementById('p_' + i).style.left = perem;
                            document.getElementById('tp_' + i).style.left = perem2;
                        }
                    }

                }
                if (stranica_left < pamyt_stran) {
                    stranica_left += 5;
                    ten_stranici.style.left = stranica.style.left = stranica_left + 'px';
                    ten_stranici.style.width = stranica.style.width = stranica.clientWidth - 5 + 'px';
                }
            }
            else {
                soderg_index = soderg_variant = 0;
                soderg_rabota = false;
                up();
                osnova.style.height=osnova.clientHeight+'px';
            }
            break;
    }
    if (soderg_rabota) setTimeout('soderg_control()', 50);

}


//=================================================================================================
function all_control(deistvie) {

    if (m_g_0.style.visibility == 'visible' || m_y_0.style.visibility == 'visible' || m_os_0.style.visibility == 'visible' || m_s_0.style.visibility == 'visible') {
        if (m_g_0.style.visibility == 'visible') menu_(3, 1, 0);
        if (m_y_0.style.visibility == 'visible') menu_(3, 1, 1);
        if (m_os_0.style.visibility == 'visible') menu_(3, 1, 2);
        if (m_s_0.style.visibility == 'visible') menu_(3, 1, 3);
    } else {
        switch (deistvie) {
            //---------------------------------------------------------------------------------------------
            case 3://move
                if (event.clientX < osnova.clientWidth - okna.clientWidth) panel_izmen(5);
                if (peremeshenie_okon_down) {
                    if (event.clientX < soderg_razdela_1.clientWidth - 30) {
                        perem = soderg_razdela_1.clientWidth - 95;
                        stranica.style.width = ten_stranici.style.width = perem + 'px';
                        dvigenie_paneli.style.left = perem + 50 + 'px';
                        okna.style.left = perem + 60 + 'px';
                        okna.style.width = osnova.clientWidth - perem - 60 + 'px';
                        okno_besedi.style.width = okno_novosti.style.width = okno_zametki.style.width = okna.clientWidth - 30 + 'px';
                    } else {

                        if (event.clientX > osnova.clientWidth - 20) {
                            okna.style.left = osnova.clientWidth - 20 + 'px';
                            okna.style.width = '20px';
                            dvigenie_paneli.style.left = osnova.clientWidth - 30 + 'px';
                            ten_stranici.style.width = stranica.style.width = osnova.clientWidth - stranica_left + 'px';

                        }
                        else {
                            if (event.clientX > osnova.clientWidth - 130) {
                                peremeshenie_okon_svernut = true;
                            }

                            okna.style.width = osnova.clientWidth - event.clientX + 'px';
                            okna.style.left = osnova.clientWidth - okna.clientWidth + 'px';
                            dvigenie_paneli.style.left = osnova.clientWidth - okna.clientWidth - 10 + 'px';

                            if (event.clientX < osnova.clientWidth - 150) {
                                okno_besedi.style.width = okno_novosti.style.width = okno_zametki.style.width = okna.clientWidth - 30 + 'px';
                            }
                        }
                    }
                    stranica.style.width = ten_stranici.style.width = osnova.clientWidth - okna.clientWidth - stranica_left - 10 + 'px';
                    ten_kn_nazad.style.left = kn_nazad.style.left = stranica_left - 20 + stranica.clientWidth + 'px';
                }
                //---------------------------------------------------------------------------------------------
                break;
            //---------------------------------------------------------------------------------------------
            case 4://down
                //  if (localStorage.getItem('l_p')==0)
                {
                    if (kn_prydki_start == false) {
                        if (kn_prydki_skrita && event.clientX < 162 && event.clientY > innerHeight - 30) {
                            //bob.innerHTML = 'yra';
                            ten_kn_prydki.style.visibility = kn_prydki.style.visibility = 'visible';
                            kn_prydki_skrita = false;

                        } else {
                            // if (event.clientX > 160 && event.clientX < 160 + kn_prydki.clientWidth && event.clientY > innerHeight - 20 - kn_prydki.clientHeight && event.clientY < innerHeight - 20) kn_prydki_(4);
                            //   else 

                            ten_kn_prydki.style.visibility = kn_prydki.style.visibility = 'hidden';
                            kn_prydki_skrita = true;
                        }
                    }
                    //}
                }
                if(metka_on){
                    
                    
                }
                break;
            //---------------------------------------------------------------------------------------------
            case 5://up
                if (peremeshenie_okon_down) kn_dvig_panel(5);
                break;
            //-----------------------------------------------------------------------------------------
        }
    }

}
//=================================================================================================
function okno_izmen(idnomer, deistvie) {
    switch (deistvie) {
        case 3://move
            // bob.innerHTML = event.clientY;

            if (event.clientX > osnova.clientWidth - okno_besedi.clientWidth && event.clientX < osnova.clientWidth - 10 && idnomer == 0 && event.clientY > okb + okno_besedi.clientHeight - 5) okno_besedi.style.cursor = 'ns-resize';
            else okno_besedi.style.cursor = 'default';
            if (event.clientX > osnova.clientWidth - okno_besedi.clientWidth && event.clientX < osnova.clientWidth - 10 && idnomer == 1 && event.clientY > okn + okno_novosti.clientHeight - 5) okno_novosti.style.cursor = 'ns-resize';
            else okno_novosti.style.cursor = 'default';
            if (event.clientX > osnova.clientWidth - okno_besedi.clientWidth && event.clientX < osnova.clientWidth - 10 && idnomer == 2 && event.clientY > okz + okno_zametki.clientHeight - 5) okno_zametki.style.cursor = 'ns-resize';
            else okno_zametki.style.cursor = 'default';

            if (deform_okno_besedi_down) panel_izmen(3);
            if (deform_okno_novosti_down) panel_izmen(3);
            if (deform_okno_zametki_down) panel_izmen(3);

            break;
        case 4://down
            panel_izmen(4);
            break;
        case 5://up
            panel_izmen(5);
            break;
    }
}
//=================================================================================================
function panel_izmen(deistvie) {
    switch (deistvie) {

        case 3://move
            if (event.clientX > osnova.clientWidth - okno_besedi.clientWidth && event.clientX < osnova.clientWidth - 10 &&
                okno_besedi.style.visibility == 'visible' && ((event.clientY > okb - scrollY + okno_besedi.clientHeight - 5 && event.clientY < okb - scrollY + okno_besedi.clientHeight + 5) ||
                    (event.clientY > okn - scrollY + okno_novosti.clientHeight - 5 && event.clientY < okn - scrollY + okno_novosti.clientHeight + 5) ||
                    (event.clientY > okz - scrollY + okno_zametki.clientHeight - 5 && event.clientY < okz - scrollY + okno_zametki.clientHeight + 5))) okna.style.cursor = 'ns-resize';
            else okna.style.cursor = 'default';
            if (deform_okno_besedi_down) {

                if (event.clientY - okb + scrollY < okgran) okno_besedi.style.height = okgran + 'px';
                else {
                    if (event.clientY - okb + scrollY > innerHeight + scrollY - okno_top - okno_novosti.clientHeight - okno_zametki.clientHeight - 30) okno_besedi.style.height = innerHeight + scrollY - okno_top - okno_novosti.clientHeight - okno_zametki.clientHeight - 30 + 'px';
                    else okno_besedi.style.height = event.clientY - okb + scrollY + 'px';
                }
                okn = okb + okno_besedi.clientHeight + 10;
                okno_novosti.style.top = okn + 'px';
                okz = okn + okno_novosti.clientHeight + 10;
                okno_zametki.style.top = okz + 'px';
            } else if (deform_okno_novosti_down) {
                if (event.clientY - okn + scrollY < okgran) okno_novosti.style.height = okgran + 'px';
                else {
                    if (event.clientY - okn + scrollY > innerHeight + scrollY - okno_top - okno_besedi.clientHeight - okno_zametki.clientHeight - 30) okno_novosti.style.height = innerHeight + scrollY - okno_top - okno_besedi.clientHeight - okno_zametki.clientHeight - 30 + 'px';
                    else okno_novosti.style.height = event.clientY - okn + scrollY + 'px';
                }
                okz = okn + okno_novosti.clientHeight + 10;
                okno_zametki.style.top = okz + 'px';
            } else if (deform_okno_zametki_down) {
                if (event.clientY - okz + scrollY < okgran) okno_zametki.style.height = okgran + 'px';
                else {
                    if (event.clientY - okz + scrollY > innerHeight + scrollY - okno_top - okno_besedi.clientHeight - okno_novosti.clientHeight - 30) okno_zametki.style.height = innerHeight + scrollY - okno_top - okno_besedi.clientHeight - okno_novosti.clientHeight - 30 + 'px';
                    else okno_zametki.style.height = event.clientY - okz + scrollY + 'px';
                }

            }

            break;
        case 4://down
            if (event.clientX > osnova.clientWidth - okno_besedi.clientWidth && event.clientX < osnova.clientWidth - 10) {
                if (event.clientY > okb - scrollY + okno_besedi.clientHeight - 5 && event.clientY < okb - scrollY + okno_besedi.clientHeight + 5) deform_okno_besedi_down = true;
                else if (event.clientY > okn - scrollY + okno_novosti.clientHeight - 5 && event.clientY < okn - scrollY + okno_novosti.clientHeight + 5) deform_okno_novosti_down = true;
                else if (event.clientY > okz - scrollY + okno_zametki.clientHeight - 5 && event.clientY < okz - scrollY + okno_zametki.clientHeight + 5) deform_okno_zametki_down = true;
                event.returnValue = false;
            }
            break;
        case 5://up

            if (deform_okno_besedi_down) {
                deform_okno_besedi_down = false;
                localStorage.setItem('o_b', okno_besedi.style.height);
            }
            if (deform_okno_novosti_down) {
                deform_okno_novosti_down = false;
                localStorage.setItem('o_n', okno_novosti.style.height);
            }
            if (deform_okno_zametki_down) {
                deform_okno_zametki_down = false;
                localStorage.setItem('o_z', okno_zametki.style.height);
            }
            event.returnValue = true;
            break;
    }
}
//=================================================================================================
function top_ok(idnomer) {
    switch (idnomer) {
        //besedi
        case 0: idnomer = okno_besedi.style.top.slice(0, okno_besedi.style.top.length - 2); break;
        //novosti
        case 1: idnomer = okno_novosti.style.top.slice(0, okno_novosti.style.top.length - 2); break;
        //pometki
        case 2: idnomer = okno_zametki.style.top.slice(0, okno_zametki.style.top.length - 2); break;

    }
    idnomer -= 0;
    return idnomer;
}
//=================================================================================================
function okno_vidimost(vidimo) {
    //okno_besedi.style.visibility = okno_name_besedi.style.visibility = okno_text_besedi.style.visibility =
    //    okno_novosti.style.visibility = okno_name_novosti.style.visibility = okno_text_novosti.style.visibility =
    //    okno_zametki.style.visibility = okno_name_zametki.style.visibility = okno_text_zametki.style.visibility = vidimo == 0 ? 'visible' : 'hidden';

}
//=================================================================================================
function kn_nazad_(deistvie) {
    color_kn = '#5080b0';
    color_videl = '#80b0e0';
    switch (deistvie) {
        case 1://over
            kn_nazad.style.backgroundColor = color_videl;
            kn_nazad.style.cursor = 'default';
            break;
        case 2://out
            kn_nazad.style.backgroundColor = color_kn;
            break;
        case 3://move

            break;
        case 4://douwn
            kn_nazad.style.visibility = 'hidden';
            scroll(0, 0);


            break;

    }
}

//=================================================================================================
function kn_okna_videlen(deistvie, idnomer) {
    ne_videl_kn = '#40a0d0';
    videl_kn = '#90e0ff';
    nagatay_kn = '#ffe0a0';
    ne_videl_ris = '#c0ffe0';
    switch (idnomer) {
        case 0: odin_kn = svert_1; odin_dr = svert_1_a; break;
        case 1: odin_kn = svert_2; odin_dr = svert_2_a; break;
        case 2: odin_kn = svert_3; odin_dr = svert_3_a; break;
        case 3: odin_kn = na_meste_1; odin_dr = na_meste_1_a; break;
        case 4: odin_kn = na_meste_2; odin_dr = na_meste_2_a; break;
        case 5: odin_kn = na_meste_3; odin_dr = na_meste_3_a; break;
    }
    switch (deistvie) {
        //-----------------------------------------------------------------------------------------
        case 1://over
            odin_kn.style.backgroundColor = videl_kn;
            odin_dr.style.backgroundColor = ne_videl_kn;
            break;
        //-----------------------------------------------------------------------------------------
        case 2://out
            odin_kn.style.backgroundColor = ne_videl_kn;
            odin_dr.style.backgroundColor = ne_videl_ris;
            break;
        //-----------------------------------------------------------------------------------------
        case 4://down
            okno_svert = 210;

            break;
        //-----------------------------------------------------------------------------------------
    }
}
//=================================================================================================
function kn_na_str(pologenie) {

kn_stran_nazad.style.top=pologenie+'px';
    pologenie+=kn_stran_nazad.clientHeight+20;
    kn_poisk.style.top=pologenie+'px';
    pologenie+=kn_poisk.clientHeight+20;
    kn_mneniy.style.top=pologenie+'px';
    
}
//=================================================================================================
function up() {
    osnova.style.height=t_s.clientHeight+gl_p.clientHeight+300+'px';
    if(osnova.clientHeight<innerHeight)osnova.style.height=innerHeight+'px';
    okna.style.height=osnova.clientHeight+scrollY+'px';
    ten_stranici.style.width=stranica.style.width=osnova.clientWidth-okna.clientWidth-135+'px';
    ten_stranici.style.height=stranica.clientHeight+'px';
}

//=================================================================================================
function p_videlen(deystvie, idnomer) {
   
videl_chast = '#6080c0';
    ne_videl_chast = '#a0c0ff';
    videl_text = '#c0e0ff';
    ne_videl_text = '#104070';
    odin_og = document.getElementById("p_" + idnomer);
    switch (deystvie) {
        //-----------------------------------------------------------------------------------------
        case 1://over
            odin_og.style.cursor = 'pointer';
            odin_og.style.backgroundColor = videl_chast;
            odin_og.style.color = videl_text;
            break;
        //-----------------------------------------------------------------------------------------
        case 2://out
            odin_og.style.backgroundColor = ne_videl_chast;
            odin_og.style.color = ne_videl_text;
            break;
        //-----------------------------------------------------------------------------------------
        case 4://down
            metka_of();
            interes_of();
            poisk_of();
 


            perem = odin_og.style.top.slice(0, odin_og.style.top.length - 2) - 0;
            odin_og.style.visibility = 'hidden';
            ten_vibronogo_p.style.top = perem - 5 + 'px';
            perem -= 6;
            ogl_vibrono_copiy.style.top = perem + 'px';
            ogl_vibrono_copiy.innerHTML = odin_og.innerHTML;
            localStorage.setItem('np', (idnomer));
            document.getElementById('t_s').innerHTML = array_text[localStorage.getItem('nm')][localStorage.getItem('nr') - 1][localStorage.getItem('np')][0];
            array_text[0][5][0][0] = "<p>" + localStorage.getItem('nn') + "</p> <div id='pamyt_" + localStorage.getItem('nn') + "' class='reshenie'onmousedown='on_pamyt(" + localStorage.getItem('nm') + "," + localStorage.getItem('nr') + "," + idnomer + ")'> " + array_menu[0][localStorage.getItem('nm')] + ' / ' + array_menu[localStorage.getItem('nm') - 0 + 1][localStorage.getItem('nr') - 1] + ' / ' + array_razd_p[localStorage.getItem('nm')][localStorage.getItem('nr') - 1][idnomer] + '</div>' + array_text[0][5][0][0];
            localStorage.setItem('nn', localStorage.getItem('nn') - 0 + 1);

            okna.style.height = limit + stranica.clientHeight + 'px';
            
            odin_og = document.getElementById('p_' + ogl_vibrono);

            odin_og.style.visibility = 'visible';
            odin_og.style.backgroundColor = ne_videl_chast;
            odin_og.style.color = ne_videl_text;
            ogl_vibrono = idnomer;
            up();
            break;
        //-----------------------------------------------------------------------------------------   
    }
}
//=================================================================================================

random_plus = 0;
function self_random(nachalo = 1, konec = 2) {
    d = new Date();
    otvet = konec - nachalo;
    otvet = nachalo + d.getSeconds() % otvet;
    //if (random_plus == 0) random_plus = 1; else random_plus = 0;
    return otvet;
}
//=================================================================================================
function menu_vis(id_el, deistvie) {


    if (deistvie == 0) deistvie = 'hidden'; else deistvie = 'visible';
    for (i = 0; i < ms[id_el][1]; i++) document.getElementById(ms[id_el][0] + '_' + i).style.visibility = deistvie;

    for (i = 0; i < ms[id_el][3]; i++) { document.getElementById(ms[id_el][0] + '_l_' + i).style.visibility = deistvie; }

    ten_m.style.height = (ms[id_el][1] - 1) * text_size - 5 + 'px';
    ten_m.style.left = ms[id_el][2] + 'px';
    ten_m.style.width = document.getElementById(ms[id_el][0] + '_0').clientWidth + 2 + 'px';
    ten_m.style.visibility = deistvie;
}
//=================================================================================================
function menu_(deistvie, nomer, idnomer) {
    //---------------------------------------------------------------------------------------------
    color_okna = "#a0d0ff";
    color_nadpisi = "#607090";
    color_videl = "#f0ffc0";
    color_menu = menu.style.backgroundColor;
    //---------------------------------------------------------------------------------------------
    m = [];
    event.returnValue = true;
    m[0] = document.getElementById(ms[idnomer][0]);
    for (i = 1; i < ms[idnomer][1] + 1; i++) m[i] = document.getElementById(ms[idnomer][0] + '_' + (i - 1));
    //---------------------------------------------------------------------------------------------
    switch (deistvie) {
        //-----------------------------------------------------------------------------------------
        case 1://over
            if (nomer == 0) {

                m[0].style.cursor = 'pointer';
                m[0].style.backgroundColor = color_nadpisi;
                m[0].style.color = color_videl;
                if (idnomer != 0 && m_g_0.style.visibility == 'visible') menu_vis(0, 0);
                else if (idnomer != 1 && m_y_0.style.visibility == 'visible') menu_vis(1, 0);
                else if (idnomer != 2 && m_os_0.style.visibility == 'visible') menu_vis(2, 0);
                else if (idnomer != 3 && m_s_0.style.visibility == 'visible') menu_vis(3, 0);
                menu_vis(idnomer, 1);
            }
            else if (nomer == 1) {
                m[1].style.cursor = 'pointer';
                m[0].style.backgroundColor = color_nadpisi;
                m[0].style.color = color_videl;
            }
            else m[nomer].style.backgroundColor = color_videl;
            break;
        //-----------------------------------------------------------------------------------------
        case 2://out
            if (nomer < 2) {
                m[0].style.cursor = 'default';
                m[0].style.color = 'black';
                m[0].style.backgroundColor = color_menu;
                if (event.clientY < 44) menu_vis(idnomer, 0);
            }
            else {
                m[nomer].style.backgroundColor = color_okna;
                m[nomer].style.color = 'black';
            }
            break;
        //-----------------------------------------------------------------------------------------
        case 3://move
            if (nomer == 0) {
                if (idnomer == 0 && m_g_0.style.visibility == 'hidden') menu_vis(0, 1);
                else if (idnomer == 1 && m_y_0.style.visibility == 'hidden') menu_vis(1, 1);
                else if (idnomer == 2 && m_os_0.style.visibility == 'hidden') menu_vis(2, 1);
                else if (idnomer == 3 && m_s_0.style.visibility == 'hidden') menu_vis(3, 1);
            }
            else {
                if (m_g_0.style.visibility == 'visible') { if (event.clientY > (ms[0][1] + 1) * text_size - 28 || event.clientX < ms[0][2] + 2 || event.clientX > ms[0][2] + document.getElementById(ms[0][0] + '_0').clientWidth - 4) menu_vis(0, 0); }
                if (m_y_0.style.visibility == 'visible') { if (event.clientY > (ms[1][1] + 1) * text_size - 28 || event.clientX < ms[1][2] + 2 || event.clientX > ms[1][2] + document.getElementById(ms[1][0] + '_0').clientWidth - 4) menu_vis(1, 0); }
                if (m_os_0.style.visibility == 'visible') { if (event.clientY > (ms[2][1] + 1) * text_size - 28 || event.clientX < ms[2][2] + 2 || event.clientX > ms[2][2] + document.getElementById(ms[2][0] + '_0').clientWidth - 4) menu_vis(2, 0); }
                if (m_s_0.style.visibility == 'visible') { if (event.clientY > (ms[3][1] + 1) * text_size - 28 || event.clientX < ms[3][2] + 2 || event.clientX > ms[3][2] + document.getElementById(ms[3][0] + '_0').clientWidth - 4) menu_vis(3, 0); }
            }
            break;
        //-----------------------------------------------------------------------------------------
        case 4://down
            m[nomer].style.backgroundColor = 'black';
            m[nomer].style.color = color_videl;
            if (idnomer < 4) nm=idnomer;
            nr=nomer-1;
            np=0;
            np_1=0;
            np_2=0;
            np_3=0;
            ogl_vibrono = 0;
            menu_vis(idnomer, 0);
            str_var=0;
            str_rab=true;
            master_ym=false;
            smena_stranic();
            if (idnomer == 0 && nomer == 7) {
                array_text[0][5][0][0] = nachalo_istorii + array_text[0][5][0][0];
                nachalo_napisano = true;
            }
            break;
        //-----------------------------------------------------------------------------------------
    }
}

//=================================================================================================
function smena_stranic() {
    switch(str_var){
        case 0:    
            metka_of();
            interes_of();
            poisk_of();    
            str_iz= 30;
            str_del=(stranica.clientWidth+100)/10;
            str_index=0;
            razd_iz=10;
            str_iz -= str_del;
            ten1_gl_p.style.left = ten2_gl_p.style.left = gl_p.style.left = str_iz + 'px';
            perem = str_iz + 30 + 'px';
            perem2 = soderg_width - 100 + str_iz + 14 + 'px';
            for (i = 0; i < array_razd_p[localStorage.getItem('nm')][localStorage.getItem('nr') - 1].length; i++) {
                document.getElementById('p_' + i).style.left = perem;
                document.getElementById('tp_' + i).style.left = perem2;
            }
            razd_iz-=str_del;
            razdel.style.left=razdel_teni.style.left=razd_iz+'px';
            stranica_left -= str_del;
            ten_stranici.style.left = stranica.style.left = stranica_left + 'px';
            ogl_vibrono_copiy.style.left=ten_vibronogo_p.style.left=str_iz+10+'px';
            scroll(0,0);
            str_var++;
            break;
        //---------------------------------------------------------------------------------------
        case 1:
            if(str_index<10){       
                str_index++;
                str_iz -= str_del;
                ten1_gl_p.style.left = ten2_gl_p.style.left = gl_p.style.left = str_iz + 'px';
                perem = str_iz + 30 + 'px';
                perem2 = soderg_width - 100 + str_iz + 14 + 'px';
                for (i = 0; i < array_razd_p[localStorage.getItem('nm')][localStorage.getItem('nr') - 1].length; i++) {
                    document.getElementById('p_' + i).style.left = perem;
                    document.getElementById('tp_' + i).style.left = perem2;
                }
                razd_iz-=str_del;
                razdel.style.left=razdel_teni.style.left=razd_iz+'px';
                stranica_left -= str_del;
                ten_stranici.style.left = stranica.style.left = stranica_left + 'px';
                ogl_vibrono_copiy.style.left=ten_vibronogo_p.style.left=str_iz+10+'px';
            }else{
                array_text[0][5][0][0] = "<p>" + localStorage.getItem('nn') + "</p> <div id='pamyt_" + localStorage.getItem('nn') + "' class='reshenie'onmousedown='on_pamyt(" + nm + "," + nr + "," + np + ")'>" + array_menu[0][nr] + ' / ' + array_menu[nm - 0 + 1][nr - 1] + ' / ' + array_razd_p[nm][nr - 1][np] + '</div > ' + array_text[0][5][0][0];
                localStorage.setItem('nn', localStorage.getItem('nn') - 0 + 1);
                localStorage.setItem('nm', nm);
                localStorage.setItem('nr', nr);
                localStorage.setItem('np', np); 
                localStorage.setItem('np_1',np_1);
                localStorage.setItem('np_2',np_2);
                localStorage.setItem('np_3',np_3);
                scroll(0, 0);
                if(master_ym){
                    razdel.innerHTML=razdel_teni.innerHTML='Один из умельцев';
                    document.getElementById('t_s').innerHTML = array_text[0][2][6][0][0];
                    text_stranici.style.paddingTop= 10+'px';
                up();
                
                osnova.style.height=osnova.clientHeight-gl_p.clientHeight+30+'px';
kn_na_str(250);
                }else{
                    document.getElementById('t_s').innerHTML = array_text[nm][nr-1][np][0];
                    soderg_razdela();
                    document.getElementById('razdel_teni').innerHTML = document.getElementById('razdel').innerHTML = array_menu[nm-0 + 1][nr - 1];
                    ten1_gl_p.style.left=ten2_gl_p.style.left= gl_p.style.left=razd_iz-95+'px';
                up();
                kn_na_str(gl_p.clientHeight+ 230);
                }
                stranica_left= razd_iz=osnova.clientWidth;
                razdel.style.left=razdel_teni.style.left=ten_stranici.style.left = stranica.style.left =razd_iz + 'px';
                str_index=0;
                str_iz=stranica_left;
                str_del=(str_iz-125)/10;
                str_var++;
            }
            break;
        //---------------------------------------------------------------------------------------
        case 2:
            if(str_index<10){
                str_index++;
                razd_iz-=str_del;
                razdel.style.left=razdel_teni.style.left=razd_iz+'px';
                if(stranica_left<125)stranica_left=125;else stranica_left-=str_del;
                if(master_ym==false)ten1_gl_p.style.left=ten2_gl_p.style.left= gl_p.style.left=stranica_left-95+'px';
                ten_stranici.style.left = stranica.style.left = stranica_left + 'px';
            }else {
                str_rab=false;
                razdel.style.left=razdel_teni.style.left='10px';
                stranica_left=125;
                stranica.style.left=stranica_left+'px';
            }
            break;
        //---------------------------------------------------------------------------------------
    }
    if(str_rab)setTimeout('smena_stranic()',30);
}

//=================================================================================================

function on_kn_stran_nazad(deistvie) {
    color_kn='#40a0d0';
    color_nadpisi='#d0ffe0';
    color_kn_v='#0080a0';
    color_nadpisi_v='white';
switch(deistvie){
    case 1://over
        kn_stran_nazad.style.background=color_kn_v;
        kn_stran_nazad.style.color=color_nadpisi_v;
        svet_kn1.style.visibility=ten_kn1.style.visibility=svet_nadpisi_1.style.visibility='visible';
        break;
    //---------------------------------------------------------------------------------------
    case 2://out
        kn_stran_nazad.style.background=color_kn;
        kn_stran_nazad.style.color=color_nadpisi;
        svet_nadpisi_1.style.visibility='hidden';
        svet_kn1.style.visibility=ten_kn1.style.visibility='visible';
        break;
    //---------------------------------------------------------------------------------------
    case 4://down
    svet_kn1.style.visibility=ten_kn1.style.visibility=svet_nadpisi_1.style.visibility= 'hidden';
    kn_stran_nazad.style.color=color_nadpisi;
    break;
    //---------------------------------------------------------------------------------------

}
}
//=================================================================================================

function on_kn_poisk(deistvie) {
    color_kn='#40a0d0';
    color_nadpisi='#d0ffe0';
    color_kn_v='#0080a0';
    color_nadpisi_v='white';

switch(deistvie){

case 1://over
    kn_poisk.style.background=color_kn_v;
    kn_poisk.style.color=color_nadpisi_v;
    svet_kn2.style.visibility=ten_kn2.style.visibility=svet_nadpisi_2.style.visibility='visible';
    break;
    //---------------------------------------------------------------------------------------
    case 2://out
    kn_poisk.style.background=color_kn;
    kn_poisk.style.color=color_nadpisi;
    svet_nadpisi_2.style.visibility='hidden';
    svet_kn2.style.visibility=ten_kn2.style.visibility='visible';
    break;
    //---------------------------------------------------------------------------------------
    case 4://down
    svet_kn2.style.visibility=ten_kn2.style.visibility=svet_nadpisi_2.style.visibility= 'hidden';
    kn_poisk.style.color=color_nadpisi;
    
    if(kn_poisk_down){
        poisk.style.visibility='hidden';
        kn_poisk.style.width='85px';

        kn_poisk_down=false;
    }else {
        poisk.style.visibility='visible';
        kn_poisk.style.width='105px';
        kn_poisk_down=true;
    }
    break;
    //---------------------------------------------------------------------------------------
}
}
//=================================================================================================
function poisk_of(){
    if(kn_poisk_down){ poisk.style.visibility=svet_nadpisi_2.style.visibility= 'hidden';
    kn_poisk.style.width='85px';
    kn_poisk_down=false;}}
//=================================================================================================

function on_kn_mneniy(deistvie) {
    color_kn='#40a0d0';
    color_nadpisi='#d0ffe0';
    color_kn_v='#0080a0';
    color_nadpisi_v='white';
switch(deistvie){

case 1://over
    kn_mneniy.style.background=color_kn_v;
    kn_mneniy.style.color=color_nadpisi_v;
    svet_kn3.style.visibility=ten_kn3.style.visibility=svet_nadpisi_3.style.visibility='visible';
    break;
    //---------------------------------------------------------------------------------------
    case 2://out
    kn_mneniy.style.background=color_kn;
    kn_mneniy.style.color=color_nadpisi;
    svet_nadpisi_3.style.visibility='hidden';
    svet_kn3.style.visibility=ten_kn3.style.visibility='visible';
    break;
    //---------------------------------------------------------------------------------------
    case 4://down
    svet_kn3.style.visibility=ten_kn3.style.visibility=svet_nadpisi_3.style.visibility= 'hidden';
    kn_mneniy.style.color=color_nadpisi;
    break;
    //---------------------------------------------------------------------------------------
}
}
//=================================================================================================
function on_tn(deistvie,nomer) {
    switch(nomer){
        case 0:nom=array_text[0][0][1][17]; break;
    }
    switch(deistvie){
       
    case 3: document.getElementById('tn_'+nomer+'_telo').innerHTML='<table id="tn_'+nomer+'" class="nowosti" onmousedown="on_tn(6,'+nomer+')"><tr><td id="tn_'+nomer+'_z" class="nowosti_zagolovok">'+document.getElementById('tn_'+nomer+'_z').innerHTML+'</td><td id="tn_'+nomer+'_d"class="nowosti_data">'+document.getElementById('tn_'+nomer+'_d').innerHTML+'</td></tr></table><div id="tn_'+nomer+'_t" class="nowosti_text"colspan="2"align="left">'+nom+' </div>';break;
    case 6: document.getElementById('tn_'+nomer+'_telo').innerHTML='<table id="tn_'+nomer+'" class="nowosti" onmousedown="on_tn(3,'+nomer+')"><tr><td id="tn_'+nomer+'_z" class="nowosti_zagolovok">'+document.getElementById('tn_'+nomer+'_z').innerHTML+'</td><td id="tn_'+nomer+'_d"class="nowosti_data">'+document.getElementById('tn_'+nomer+'_d').innerHTML+'</td></tr><tr><td colspan=2 style="background: #fff8e0;"> </td></tr></table>';break;
    }
    up();
}
//=================================================================================================
function on_tym(deistvie,nomer) {
    switch(deistvie){
    case 3:
    str_rab = true;
            str_var=0;
            master_ym=true;
            nm=0;
            nr=3;
            np=0;
            np_1=1;
            np_2=0;
            np_3=0;
    smena_stranic();
    
    up();
    //on_pamyt(nm,nr,np);
    //ym_div.style.visibility="visible";
    //ym_div.style.height=ym_div.clientHeight+'px';
    //ym_div.style.top=scrollY+15+'px';
    //ym_div_on=true;
 //   stranica.innerHTML=array_ym[0];
    break;
    //---------------------------------------------------------------------------------------
    case 6:
    document.getElementById('tn_'+nomer+'_telo').innerHTML='<table id="tn_'+nomer+'" class="nowosti" onmousedown="on_tn(3,'+nomer+')"><tr><td id="tn_'+nomer+'_z" class="nowosti_zagolovok">'+document.getElementById('tn_'+nomer+'_z').innerHTML+'</td><td id="tn_'+nomer+'_d"class="nowosti_data">'+document.getElementById('tn_'+nomer+'_d').innerHTML+'</td></tr><tr><td colspan=2 style="background: #fff8e0;"> </td></tr></table>';
    
    up();
    osnova.style.height=osnova.clientHeight-gl_p.clientHeight+'px';
    break;
    //---------------------------------------------------------------------------------------
    }
    
    
    

}

//=================================================================================================
function on_pamyt(nm, nr, np) {


    if (nm == 0 && nr == 6 && np == 0) { } else {
        array_text[0][5][0][0] = "<p>" + localStorage.getItem('nn') + "</p> <div id='pamyt_" + localStorage.getItem('nn') + "' class='reshenie'onmousedown='on_pamyt(" + nm + "," + nr + "," + np + ")'>" + array_menu[0][nm] + ' / ' + array_menu[nm - 0 + 1][nr - 1] + ' / ' + array_razd_p[nm][nr - 1][np] + '</div > ' + array_text[0][5][0][0];
        localStorage.setItem('nn', localStorage.getItem('nn') - 0 + 1);
        localStorage.setItem('nm', nm);
        localStorage.setItem('nr', nr);
        localStorage.setItem('np', np);
        soderg_razdela();
        document.getElementById('razdel_teni').innerHTML = document.getElementById('razdel').innerHTML = array_menu[nm - 0 + 1][nr - 1];
        scroll(0, 0);
        document.getElementById('t_s').innerHTML = array_text[nm][nr - 1][np][0];
        up();
    }
               
}

//=================================================================================================
function on_tp_time(deistvie, n_menu, n_punkt, n_razdel, nomer) {
    switch (deistvie) {
        case 0://over
            //document.getElementById('tp_' + n_menu + '_' + n_punkt + '_' + n_razdel + '_' + nomer).style.display = 'block';
            document.getElementById('tp_' + n_menu + '_' + n_punkt + '_' + n_razdel + '_' + nomer + '_telo').innerHTML = '<div id="tp_'+n_menu+'_'+n_punkt+'_'+n_razdel+'_'  + nomer + '" class="paragraf"onmouseover="on_tp(1,' + nomer + ')"onmouseout="on_tp(2,' + nomer + ')" onmousedown="on_tp_time(2,'+n_menu+','+n_punkt+','+n_razdel+',' + nomer + ')">' + document.getElementById('tp_'+n_menu+'_'+n_punkt+'_'+n_razdel+'_' + nomer).innerText + '</div>';
            break;
        case 4:
            //document.getElementById('tp_' + n_menu + '_' + n_punkt + '_' + n_razdel + '_' + nomer).style.display = 'block';
            document.getElementById('tp_' + n_menu + '_' + n_punkt + '_' + n_razdel + '_' + nomer + '_telo').innerHTML = '<div id="tp_'+n_menu+'_'+n_punkt+'_'+n_razdel+'_'  + nomer + '" class="paragraf"onmouseover="on_tp(1,'  + nomer + ')"onmouseout="on_tp(2,'  + nomer + ')" onmousedown="on_tp_time(0,'+n_menu+','+n_punkt+','+n_razdel+','  + nomer + ')">' + document.getElementById('tp_'+n_menu+'_'+n_punkt+'_'+n_razdel+'_' + nomer).innerText + '</div>';
            break;
    }
}
//=================================================================================================

function metka_of(){
if(metka_on){    
nomer=metka_nomer;
    ten_metka.style.visibility=metka_div.style.visibility=metka_treug.style.visibility='hidden';
    metka_on=false;
    name2= 'tm_' + nm + '_' + nr + '_' + np;
    name = name2+'_'+nomer;
    document.getElementById(name+'_telo').innerHTML='<span id="'+name+'" class="metka" onmouseover="on_tm(1,' + nomer + ')"onmouseout="on_tm(2,' + nomer + ')"onmousedown="on_'+name2+'('+nomer+')">'+document.getElementById(name+'_v').innerHTML+'</span>';
}
           event.returnValue = false;
}
//=================================================================================================
function interes_of(){
    if(interes_on){
nomer=interes_nomer;    
ten_interes.style.visibility=interes_div.style.visibility=interes_treug.style.visibility='hidden';
    interes_on=false;
    name2= 'ti_' + nm + '_' + nr + '_' + np;
    name = name2+'_'+nomer;
    document.getElementById(name+'_telo').innerHTML='<span id="'+name+'" class="interes" onmouseover="on_ti(1,' + nomer + ')"onmouseout="on_ti(2,' + nomer + ')"onmousedown="on_'+name2+'('+nomer+')">'+document.getElementById(name+'_v').innerHTML+'</span>';
}
           event.returnValue = false;
}
//=================================================================================================

function prsmi(id='p',nomer=0){
               event.returnValue = false;
    nm=localStorage.getItem('nm');
    nr=localStorage.getItem('nr')-1;
    np=localStorage.getItem('np');
    name2= 't'+id+'_' + nm + '_' + nr + '_' + np;
    name = name2+'_'+nomer;
}

//=================================================================================================

function tof(p_r=0){
               event.returnValue = false;
nm=localStorage.getItem('nm');
    nr=localStorage.getItem('nr')-1;
    np=localStorage.getItem('np');
if(metka_on){
    nomer=metka_nomer;
    ten_metka.style.visibility=metka_div.style.visibility=metka_treug.style.visibility='hidden';
    metka_on=false;
    name2= 'tm_' + nm + '_' + nr + '_' + np;
    name = name2+'_'+nomer;
    document.getElementById(name+'_telo').innerHTML='<span id="'+name+'" class="metka" onmouseover="on_tm(1,' + nomer + ')"onmouseout="on_tm(2,' + nomer + ')"onmousedown="on_'+name2+'('+nomer+')">'+document.getElementById(name+'_v').innerHTML+'</span>';
    }
    if(interes_on){
    nomer=interes_nomer;
ten_interes.style.visibility=interes_div.style.visibility=interes_treug.style.visibility='hidden';
    interes_on=false;
    name2= 'ti_' + nm + '_' + nr + '_' + np;
    name = name2+'_'+nomer;
    document.getElementById(name+'_telo').innerHTML='<span id="'+name+'" class="interes" onmouseover="on_ti(1,' + nomer + ')"onmouseout="on_ti(2,' + nomer + ')"onmousedown="on_'+name2+'('+nomer+')">'+document.getElementById(name+'_v').innerHTML+'</span>';
    }
    if(p_r==1){name2= 'tr_' + nm + '_' + nr + '_' + np;nomer=reshenie_nomer;}else {name2= 'tp_' + nm + '_' + nr + '_' + np;nomer=paragraf_nomer;}
    name=name2+'_'+nomer;
    //bob.innerHTML='ogo';
}

//=================================================================================================
function on_tp(deistvie, nomer) {
    prsmi('p',nomer);
    idnom = document.getElementById(name);
    switch (deistvie) {
        case 1://over
            idnom.style.background = '#ffd0c0';
            idnom.style.color = '#a01000';
            break;
        case 2://out
            idnom.style.background = '#ffb0a0';
            idnom.style.color = 'black';
            break;
        case 3://over v
            document.getElementById(name  + '_v').style.background = '#605040';
            break;
        case 4://out v
            document.getElementById(name + '_v').style.background = 'black';
            break;
        case 5://down v
            if(metka_on)metka_of();
            if(interes_on)interes_of();
            document.getElementById(name+'_telo').innerHTML='<div id="'+name+'" class="paragraf" onmouseover="on_tp(1,' + nomer + ')"onmouseout="on_tp(2,' + nomer + ')"onmousedown="on_'+name2+'('+nomer+')">'+document.getElementById(name+'_v').innerHTML+'</div>';
up();
            break;
    }
}
//=================================================================================================
function on_tr(deistvie, nomer) {
prsmi('r',nomer);    
idnom = document.getElementById(name);
    switch (deistvie) {
        case 1://over
            idnom.style.background = '#e0c0ff';
            idnom.style.color = '#3000a0';
            break;
        case 2://out
            idnom.style.background = '#b090ff';
            idnom.style.color = 'black';
            break;
        case 3://over v
            document.getElementById(name  + '_v').style.background = '#6030a0';
            break;
        case 4://out v
            document.getElementById(name + '_v').style.background = '#5000a0';
            break;
        case 5://down v
            if(metka_on)metka_of();
            if(interes_on)interes_of();
            document.getElementById(name+'_telo').innerHTML='<span id="'+name+'" class="reshenie" onmouseover="on_tr(1,' + nomer + ')"onmouseout="on_tr(2,' + nomer + ')"onmousedown="on_'+name2+'('+nomer+')">'+document.getElementById(name+'_v').innerHTML+'</span>';
            break;
            up();
    }
}
//=================================================================================================
function on_ts(deistvie, nomer) {
prsmi('s',nomer);    
idnom = document.getElementById(name);
    switch (deistvie) {
        case 1://over
            idnom.style.background = '#c0eaff';
            idnom.style.color = '#0010a0';
            break;
        case 2://out
            idnom.style.background = '#a0e0ff';
            idnom.style.color = 'black';
            break;
        case 3://over v
            document.getElementById(name  + '_v').style.background = '#3050a0';
            break;
        case 4://out v
            document.getElementById(name + '_v').style.background = '#0010a0';
            break;
        case 5://down v
            if(metka_on)metka_of();
            if(interes_on)interes_of();
            document.getElementById(name+'_telo').innerHTML='<span id="'+name+'" class="ssilka" onmouseover="on_ts(1,' + nomer + ')"onmouseout="on_ts(2,' + nomer + ')"onmousedown="on_'+name2+'('+nomer+')">'+document.getElementById(name+'_v').innerHTML+'</span>';

            break;
    }
}
//=================================================================================================
function on_tm(deistvie, nomer) {
prsmi('m',nomer);    
idnom = document.getElementById(name);
    switch (deistvie) {
        case 1://over
            idnom.style.background = '#a0ff40';
            idnom.style.color = '#106000';
            break;
        case 2://out
            idnom.style.background = '#c0ff20';
            idnom.style.color = 'black';
            break;
        case 3://over v
            document.getElementById(name  + '_v').style.background = '#30a050';
            break;
        case 4://out v
            document.getElementById(name + '_v').style.background = '#008010';
            break;
        case 5://down v
            if(metka_on)metka_of();
            if(interes_on)interes_of();
            document.getElementById(name+'_telo').innerHTML='<span id="'+name+'" class="metka" onmouseover="on_tm(1,' + nomer + ')"onmouseout="on_tm(2,' + nomer + ')"onmousedown="on_'+name2+'('+nomer+')">'+document.getElementById(name+'_v').innerHTML+'</span>';
            up();
            break;
    }
}
//=================================================================================================
function on_ti(deistvie, nomer) {
prsmi('i',nomer);    
idnom = document.getElementById(name);
    switch (deistvie) {
        case 1://over
            idnom.style.background = '#ffe060';
            idnom.style.color = '#804020';
            break;
        case 2://out
            idnom.style.background = '#fff040';
            idnom.style.color = 'black';
            break;
        case 3://over v
            document.getElementById(name  + '_v').style.background = '#ffd040';
            break;
        case 4://out v
            document.getElementById(name + '_v').style.background = '#ffe060';
            break;
        case 5://down v
            if(metka_on)metka_of();
            if(interes_on)interes_of();
            document.getElementById(name+'_telo').innerHTML='<span id="'+name+'" class="interes" onmouseover="on_ti(1,' + nomer + ')"onmouseout="on_ti(2,' + nomer + ')"onmousedown="on_'+name2+'('+nomer+')">'+document.getElementById(name+'_v').innerHTML+'</span>';
            up();
            break;
            
    }
}
//=================================================================================================
function on_tm_down_start(nomer){
    
    if(interes_on)interes_of();
    prsmi('m',nomer);
    document.getElementById(name+'_telo').innerHTML='<span id="'+name+'_v"class="metka_v" onmouseover="on_tm(3,'+nomer+')"onmouseout="on_tm(4,'+nomer+')"onmousedown="on_tm(5,'+nomer+')">'+document.getElementById(name).innerHTML+'</span>';
ten_metka.style.visibility=metka_div.style.visibility=metka_treug.style.visibility='visible';
metka_treug.style.top=scrollY+event.clientY+2+'px';
metka_treug.style.left=event.clientX-10+'px';

}
//=================================================================================================
function on_tm_down_end(){

if(metka_div.clientWidth>=osnova.clientWidth-50){
    metka_div.style.left='70px';
    metka_div.style.right='70px';
}
metka_div.style.top=scrollY+event.clientY+20+'px';
ten_metka.style.top=metka_div.style.top;
ten_metka.style.left=metka_div.style.left;

ten_metka.style.width=metka_div.clientWidth+5+'px';
ten_metka.style.height=metka_div.clientHeight+5+'px';
metka_left=metka_div.style.top.slice(0, metka_div.style.top.length - 2) - 0;
//metka_nomer=0;
metka_on=true;
up();
}
//=================================================================================================
function on_ti_down_start(nomer){
    if(metka_on)metka_of();
    prsmi('i',nomer);
    document.getElementById(name+'_telo').innerHTML='<span id="'+name+'_v"class="interes_v" onmouseover="on_ti(3,'+nomer+')"onmouseout="on_ti(4,'+nomer+')"onmousedown="on_ti(5,'+nomer+')">'+document.getElementById(name).innerHTML+'</span>';
ten_interes.style.visibility=interes_div.style.visibility=interes_treug.style.visibility='visible';
interes_treug.style.top=scrollY+event.clientY+2+'px';
interes_treug.style.left=event.clientX-10+'px';
}
//=================================================================================================
function on_ti_down_end(){

if(interes_div.clientWidth>=osnova.clientWidth-50){
    interes_div.style.left='100px';
    interes_div.style.right='100px';
}
interes_div.style.top=scrollY+event.clientY+20+'px';
ten_interes.style.top=interes_div.style.top;
ten_interes.style.left=interes_div.style.left;

ten_interes.style.width=interes_div.clientWidth+5+'px';
ten_interes.style.height=interes_div.clientHeight+5+'px';
interes_left=interes_div.style.top.slice(0, metka_div.style.top.length - 2) - 0;
up();
interes_on=true;
}


//=================================================================================================
function on_kn_zakrit(deistvie){
    switch(deistvie){
        case 1://over
        kn_zakrit.style.background='red';
        kn_zakrit.style.color='white';
        break;
        case 2://out
        kn_zakrit.style.background='white';
        kn_zakrit.style.color='red'; 
        break;
    }
}
//=================================================================================================
function on_tp_0_0_0(nomer){
    paragraf_nomer=nomer;
tof();    

str = "<hr width='100%'size='2'color='black'/>";
    str+="<dd>"+array_text[0][0][0][1]+"</dd>";    
    str += "<hr width='100%'size='2'color='black'/>";
    document.getElementById(name+'_telo').innerHTML='<div id="'+name+'_v" class="paragraf_v" onmouseover="on_tp(3,' + nomer + ')"onmouseout="on_tp(4,' + nomer + ')"onmousedown="on_tp(5,'+nomer+')">'+document.getElementById(name).innerHTML+'</div>'+str;
up(); 
}
//=================================================================================================
function on_tp_0_0_1(nomer){
    paragraf_nomer=nomer;  
    tof();
    switch(nomer){
    case 0:nom=3; break;
    case 1:nom=1; break;
    case 2:nom=2; break;
    case 3:nom=10; break;
    case 4:nom=11; break;
    case 5:nom=12; break;
    case 6:nom=13; break;
    case 7:nom=14; break;
    case 8:nom=15; break;
    case 9:nom=16; break;
    }
    document.getElementById(name+'_telo').innerHTML='<div id="'+name+'_v" class="paragraf_v" onmouseover="on_tp(3,' + nomer + ')"onmouseout="on_tp(4,' + nomer + ')"onmousedown="on_tp(5,'+nomer+')">'+document.getElementById(name).innerHTML+'</div><hr width="100%"size="2"color="black"/>'+array_text[0][0][1][nom]+'<hr width="100%"size="2"color="black"/>';
    up();
}

//=================================================================================================
function on_tp_0_0_2(nomer) {

    tof(0);
    str = "<hr width='100%'size='2'color='black'/>";
    if (nomer < 6) {
        for (i = 0; i < 6; i++) {
            if (nomer != i) {//здесь надо вставить медленное убирание открытого блока 'tt_'+i+'_telo'
                //on_tp_time(0, 0, 0, 2, i);
            }
        }

        if (nomer < 4) {
            switch (nomer) {
                case 0: paragraf_nachalo = 6; break;
                case 1: paragraf_nachalo = 13; break;
                case 2: paragraf_nachalo = 33; break;
                case 3: paragraf_nachalo = 36; break;
            }
            pamyt_paragraf_nachalo = paragraf_nachalo;
            for (i = 0; i < array_menu[nomer + 1].length; i++) {
                str += "<ul><li><div id='"+name2+"_" + paragraf_nachalo + "_telo'><div id='"+name2+"_" + paragraf_nachalo + "' class='paragraf' onmousedown='on_tp_0_0_2(" + paragraf_nachalo + ")'onmouseover='on_tp(1," + paragraf_nachalo + ")'onmouseout='on_tp(2," + paragraf_nachalo + ")'>" + array_menu[nomer + 1][i] + "</div></div></li></ul><p>";
                paragraf_nachalo++;
            }
            paragraf_konec = paragraf_nachalo;
            paragraf_nachalo = pamyt_paragraf_nachalo;
        } else str += array_text[0][0][2][36 + nomer] + "</p>";
    } else {
        for (i = paragraf_nachalo; i < paragraf_konec; i++) {
            if (nomer != i) {//здесь надо вставить медленное убирание открытого блока 'tt_'+i+'_telo'
               // on_tp_time(0, 0, 0, 2, i);
            }
        }
        str += array_text[0][0][2][nomer - 5] + "</p>";
    }
    str += "<hr width='100%'size='2'color='black'/>"
    document.getElementById(name2+'_' + nomer + '_telo').innerHTML = "<div id='"+name2+"_" + nomer + "_v' class='paragraf_v'onmouseover='on_tp(3," + nomer + ")'onmouseout='on_tp(4," + nomer + ")' onmousedown='on_tp_0_0_2("+ nomer + ")'>" + document.getElementById(name2+'_' + nomer).innerText + "</div>" + str;
    up();
}
//=================================================================================================
function on_tp_0_0_3(nomer) {
tof(0);
switch(nomer){
    case 0:

    document.getElementById(name+'_telo').innerHTML='<span id="'+name+'_v"class="paragraf_v" onmouseover="on_tp(3,0)"onmouseout="on_tp(4,0)"onmousedown="on_tp(5,0)">'+document.getElementById(name).innerHTML+'</span>'+array_text[0][0][0][1];

    break;
    case 1:break;
    case 2:break;
    case 3:break;
    case 4:break;
    case 5:break;
    case 6:break;
    case 7:break;
    case 8:break;
    case 9:break;
    case 10:break;
    case 11:break;
    case 12:break;
    case 13:break;
    case 14:break;
    case 15:break;
    case 16:break;
    case 17:break;
    up();
}


}
//=================================================================================================
function on_tr_0_0_0(nomer) {
    tof(1);
    document.getElementById(name+'_telo').innerHTML='<span id="'+name+'_v"class="reshenie_v" onmouseover="on_tr(3,'+nomer+')"onmouseout="on_tr(4,'+nomer+')"onmousedown="on_tr(5,'+nomer+')">'+document.getElementById(name).innerHTML+'</span><div class="reshenie_div">'+array_text[0][0][0][2]+'</div>';
    up();
}
//=================================================================================================
function on_tr_0_0_1(nomer) {
    tof(1);
    document.getElementById(name+'_telo').innerHTML='<span id="'+name+'_v"class="reshenie_v" onmouseover="on_tr(3,'+nomer+')"onmouseout="on_tr(4,'+nomer+')"onmousedown="on_tr(5,'+nomer+')">'+document.getElementById(name).innerHTML+'</span><div class="reshenie_div">'+array_text[0][0][1][4]+'<p>'+array_text[0][0][0][2]+array_text[0][0][1][5]+'</div>';
    up();
}

//=================================================================================================
function on_ts_0_0_0(nomer) {
    if(metka_on)metka_of();
    if(interes_on)interes_of();
switch(nomer){
    case 1:nm = 0; nr = 1;np = 1;break;
    case 2:nm = 0; nr = 3;np = 0;break;
    case 3:nm = 0; nr = 4;np = 0;break;
    case 4:nm = 0; nr = 3;np = 0;break;
    case 5:nm = 0; nr = 3;np = 5;break;
    case 6:nm = 1; nr = 1;np = 0;break;
    case 7:nm = 1; nr = 12;np = 3;break;
    case 8:nm = 1; nr = 1;np = 1;break;
    case 9:nm = 1; nr = 1;np = 1;break;
    case 10:nm = 1; nr = 1;np = 1;break;
    case 11:nm = 1; nr = 1;np = 1;break;
    case 12:nm = 0; nr = 2;np = 0;break;
    case 13:nm = 2; nr = 1;np = 0;break;
    case 14:nm = 2; nr = 3;np = 0;break;
    case 15:nm = 2; nr = 1;np = 0;break;
    case 16:nm = 0; nr = 1;np = 1;break;
    case 17:nm = 0; nr = 1;np = 2;break;
    case 18:nm = 1; nr = 18;np = 0;break;
}

if(nomer!=0)on_pamyt(nm,nr,np);
 
}
//=================================================================================================
function on_ts_0_0_1(nomer) {
    if(metka_on)metka_of();
    if(interes_on)interes_of();
switch(nomer){
    case 0:nm=0;nr=1;np=0; break;
    case 1:nm = 1; nr = 22;np = 0;break;
    case 2:nm = 2; nr = 1;np = 0;break;
    case 3:nm = 0; nr = 2;np = 0;break;
    case 4:nm = 3; nr = 1;np = 4;break;
    case 5:nm = 3; nr = 1;np = 0;break;
}
on_pamyt(nm,nr,np);

 
}

//=================================================================================================
function on_tm_0_0_0(nomer) {
    on_tm_down_start(nomer);
switch(nomer){
    case 0:metka_div.innerHTML=array_text[0][0][0][3];break;
}
on_tm_down_end();
}
//=================================================================================================
function on_tm_0_0_1(nomer) {
    on_tm_down_start(nomer);
switch(nomer){
    case 0:metka_div.innerHTML=array_text[0][0][1][6]+' '+array_text[0][0][0][3]+array_text[0][0][1][7];break;
}
on_tm_down_end();
}
//=================================================================================================
function on_ti_0_0_0(nomer) {
    on_ti_down_start(nomer);
switch(nomer){
    case 0:interes_div.innerHTML=array_text[0][0][0][4];break;
}
on_ti_down_end();
}

//=================================================================================================
function on_ti_0_0_1(nomer) {
    on_ti_down_start(nomer);
switch(nomer){
    case 0:interes_div.innerHTML=array_text[0][0][1][8]+' '+array_text[0][0][0][4]+array_text[0][0][1][9];break;
}
on_ti_down_end();
}
//=================================================================================================

function on_reshenie(nomer) {
    if (nomer < 11) { nm = 0; nr = nomer - 3; }
    else if (nomer < 31) { nm = 1; nr = nomer - 10; }
    else if (nomer < 34) { nm = 2; nr = nomer - 30; }
    else { nm = 3; nr = nomer - 33; }
    np = 0;
    on_pamyt(nm,nr,np);

}

//=================================================================================================
function soderg_razdela() {
    t = 0;
    text_size = 35;
    if (localStorage.getItem('np')) { } else localStorage.setItem('np', 0);
    ogl_vibrono = localStorage.getItem('np');
    
    //---------------------------------------------------------------------------------------------
    str = "";
    //---------------------------------------------------------------------------------------------
    //кнопка для возвращения назад на верх страницы
    str += "<div id='ten_kn_nazad'></div><div id='kn_nazad'onmouseover='kn_nazad_(1)'onmouseout='kn_nazad_(2)'onmousedown='kn_nazad_(4)'></div>";
    //---------------------------------------------------------------------------------------------
    //подсветка и сами названия содержания страниц
    str += "<div id='ten2_gl_p'></div><div id='gl_p'class='c_gl_p'>Содержимое раздела:<div id='kn_za_str' onmouseover='kn_za_str_(1)' onmouseout='kn_za_str_(2)' onmousedown='kn_za_str_(4)'></div>";
    for (i = 0; i < array_razd_p[localStorage.getItem('nm')][localStorage.getItem('nr') - 1].length; i++) str += "<div id='tp_" + i + "'class='c_ten_p'></div><div id='p_" + i + "'class='c_p' onmouseover='p_videlen(1, " + i + ")' onmouseout='p_videlen(2," + i + ")' onmousedown='p_videlen(4," + i + ")'></div>";
    str += "<div id='ten2'></div><div id='ten_vibronogo_p'></div><div id='ogl_vibrono_copiy'></div></div>";
    //---------------------------------------------------------------------------------------------
    in_load_2.innerHTML = str;
    if (localStorage.getItem('s_l')) {

    } else
    localStorage.setItem('s_l', 0);

    stranica_left = localStorage.getItem('s_l') - 0 > 0 ? 50 : 125;
    //---------------------------------------------------------------------------------------------
    //кнопка для возвращения назад на верх страницы
    kn_nazad.innerHTML = '^';
    ten_kn_nazad.style.visibility = kn_nazad.style.visibility = 'hidden';
    ten_kn_nazad.style.left = kn_nazad.style.left = stranica.clientWidth + 105 + 'px';
    ten_kn_nazad.style.top = kn_nazad.style.top = innerHeight - 80 + 'px';
    //---------------------------------------------------------------------------------------------
    
    //содержимое раздела по пунктам
    for (i = 0; i < array_razd_p[localStorage.getItem('nm')][localStorage.getItem('nr') - 1].length; i++) {
    
    odin_og = document.getElementById("p_" + i);
        odin_og.innerHTML = array_razd_p[localStorage.getItem('nm')][localStorage.getItem('nr') - 1][i];
        if (ogl_vibrono == i) {
            ogl_vibrono_copiy.innerHTML = odin_og.innerHTML;
            ogl_vibrono_copiy.style.top = 50+t - 4 + 'px';
            ogl_vibrono_copiy.style.width = soderg_width + 10 + 'px';
            ten_vibronogo_p.style.left = '10px';
            ten_vibronogo_p.style.width = ogl_vibrono_copiy.clientWidth+5+'px';
            ten_vibronogo_p.style.top = 50+t - 3 + 'px';
            ten_vibronogo_p.style.height = ogl_vibrono_copiy.clientHeight + 5 + 'px';
            perem = t + 5 + 'px';
            odin_og.style.visibility='hidden';
        }
       // if(ogl_vibrono==i) 
        perem = odin_og.style.top = 50+t + 'px';
       odin_og.style.width = soderg_width-35 + 'px';

        
        odin_ogt = document.getElementById("tp_" + i);
        odin_ogt.style.top = perem;
        odin_ogt.style.left = odin_og.clientWidth +40+ 'px';
        
        t += odin_og.clientHeight + 15;
    }
    //bob.innerHTML=''
    if(master_ym){
        gl_p.style.visibility='hidden';
        kn_na_str(250);
    //poisk.style.top=250+kn_stran_nazad.clientHeight+'px';
    
    }else{

    gl_p.style.visibility = 'visible';
    gl_p_za_str.style.visibility = 'hidden';
    
    gl_p_za_str.style.height = gl_p.style.height = t +50+ 'px';
    //soderg_razdela_2.style.height = soderg_razdela_1.style.height = gl_p_za_str.clientHeight + 10 + 'px';
    gl_p.style.width = soderg_width + 'px';
    //gl_p.style.left=30+'px';
    //---------------------------------------------------------------------------------------------
    // bob.innerHTML=kn_stran_nazad.clientWidth;
    kn_na_str(gl_p.clientHeight+230);
    //poisk.style.top=250+gl_p.clientHeight+kn_stran_nazad.clientHeight+'px';
 svet_nadpisi_1.style.visibility=svet_nadpisi_2.style.visibility=svet_nadpisi_3.style.visibility='hidden';
    
   // soderg_razdela_2.style.width = soderg_width + 'px';
   //---------------------------------------------------------------------------------------------
    text_stranici.style.paddingTop = gl_p.clientHeight - 20 + 'px';
    //---------------------------------------------------------------------------------------------

    ten1_gl_p.style.position = ten2_gl_p.style.position = 'absolute';
    ten1_gl_p.style.left = ten2_gl_p.style.left = '30px';
    ten1_gl_p.style.top = '202px';
    ten2_gl_p.style.top = '202px';
    ten1_gl_p.style.width = ten2_gl_p.style.width = gl_p.clientWidth + 2 + 'px';
    ten1_gl_p.style.height = ten2_gl_p.style.height = gl_p.clientHeight + 'px';
    ten1_gl_p.style.backgroundColor = ten2_gl_p.style.backgroundColor = 'black';
    ten1_gl_p.style.borderRadius = ten2_gl_p.style.borderRadius = '10px';
    ten1_gl_p.style.filter = 'blur(12px)';
    ten2_gl_p.style.filter = 'blur(2px)';
    
    
    //---------------------------------------------------------------------------------------------
    //кнопка прячущая за страницу
    
    kn_za_str.innerHTML = "<div id='ris_kn_za_str'></div><div id='ris_min'></div><div id='ris_v'></div><div id='ris_str'></div>";
    ris_v.innerHTML = 'v';
    kn_za_str.style.left = gl_p.clientWidth - 70 + 'px';

    localStorage.setItem('np_1',0);
    localStorage.setItem('np_2',0);
    localStorage.setItem('np_3',0);
    }
    kn_stran_nazad.style.width= kn_poisk.style.width=kn_mneniy.style.width='85px';
    
}
//=================================================================================================
function okna_umen() {
    if (innerHeight < okno_top + okno_besedi.clientHeight + okno_novosti.clientHeight + okno_zametki.clientHeight + 30 - scrollY) {
        minus = (okno_top + okno_besedi.clientHeight + okno_novosti.clientHeight + okno_zametki.clientHeight + 30 - innerHeight - scrollY) / ((okno_besedi.clientHeight <= okgran ? 0 : 1) + (okno_novosti.clientHeight <= okgran ? 0 : 1) + (okno_zametki.clientHeight <= okgran ? 0 : 1));
        plus = 0;
        if (okno_besedi.clientHeight > okgran) {
            if (okno_besedi.clientHeight - minus < okgran) {
                plus = okno_besedi + minus - okgran;
                okno_besedi.style.height = okgran + 'px';
            } else okno_besedi.style.height = okno_besedi.clientHeight - minus + 'px';
        }
        if (okno_novosti.clientHeight > okgran) {
            if (okno_novosti.clientHeight - minus < okgran) {
                plus += okno_novosti + minus - okgran;
                okno_novosti.style.height = okgran + 'px';
            } else okno_novosti.style.height = okno_novosti.clientHeight - minus + 'px';
        }
        if (okno_zametki.clientHeight > okgran) {
            if (okno_zametki.clientHeight - minus < okgran) {
                plus += okno_zametki + minus - okgran;
                okno_zametki.style.height = okgran + 'px';
            } else okno_zametki.style.height = okno_zametki.clientHeight - minus + 'px';
        }
        if (plus != 0) plus /= ((okno_besedi.clientHeight <= okgran ? 0 : 1) + (okno_novosti.clientHeight <= okgran ? 0 : 1) + (okno_zametki.clientHeight <= okgran ? 0 : 1));
        if (okno_besedi.clientHeight > okgran) okno_besedi.style.height = okno_besedi.clientHeight - plus + 'px';
        if (okno_novosti.clientHeight > okgran) okno_novosti.style.height = okno_novosti.clientHeight - plus + 'px';
        if (okno_zametki.clientHeight > okgran) okno_zametki.style.height = okno_zametki.clientHeight - plus + 'px';
    }
    okb = okno_top;
    okno_besedi.style.top = okb + 'px';
    okn = okb + okno_besedi.clientHeight + 10;
    okno_novosti.style.top = okn + 'px';
    okz = okn + okno_novosti.clientHeight + 10;
    okno_zametki.style.top = okz + 'px';
}
//=================================================================================================
function okna_uvel() {
    if (innerHeight > okno_top + okno_besedi.clientHeight + okno_novosti.clientHeight + okno_zametki.clientHeight + 30 - scrollY) {
        plus = (innerHeight-okno_top-okno_besedi.clientHeight - okno_novosti.clientHeight - okno_zametki.clientHeight-30+scrollY)/3;
        okno_besedi.style.height = okno_besedi.clientHeight + plus + 'px';
        okno_novosti.style.height = okno_novosti.clientHeight + plus + 'px';
        okno_zametki.style.height = okno_zametki.clientHeight + plus + 'px';
    
    }
    okb = okno_top;
    okno_besedi.style.top = okb + 'px';
    okn = okb + okno_besedi.clientHeight + 10;
    okno_novosti.style.top = okn + 'px';
    okz = okn + okno_novosti.clientHeight + 10;
    okno_zametki.style.top = okz + 'px';
}

//=================================================================================================
function izmen_win() {
    
    if (staroe_x != innerWidth) {

        m2_left = m1_left + m_g.clientWidth + m_razdelitel.clientWidth + 4;
        m3_left = m2_left + m_y.clientWidth + m_razdelitel.clientWidth + 4;
        m4_left = m3_left + m_os.clientWidth + m_razdelitel.clientWidth + 4;
        ms[1][2] = m2_left;
        ms[2][2] = m3_left;
        ms[3][2] = m4_left;
        //--------------------------------
        m_y_0.style.left = m2_left + 'px';
        m_os_0.style.left = m3_left + 'px';
        m_s_0.style.left = m4_left + 'px';
        if (m_g_0.clientWidth <= m_g.clientWidth) m_g_0.style.width = m_g.clientWidth + 10 + 'px';
        else if (m_g_0.clientWidth > menu_width) m_g_0.style.width = menu_width + 'px';
        if (m_y_0.clientWidth <= m_y.clientWidth) m_y_0.style.width = m_y.clientWidth + 10 + 'px';
        else if (m_y_0.clientWidth > menu_width) m_y_0.style.width = menu_width + 'px';
        if (m_os_0.clientWidth <= m_os.clientWidth) m_os_0.style.width = m_os.clientWidth + 10 + 'px';
        else if (m_os_0.clientWidth > menu_width) m_os_0.style.width = menu_width + 'px';
        if (m_s_0.clientWidth <= m_s.clientWidth) m_s_0.style.width = m_s.clientWidth + 10 + 'px';
        else if (m_s_0.clientWidth > menu_width) m_s_0.style.width = menu_width + 'px';
        //-----------------------------------------------------------------------------------

        stranica.style.width = osnova.clientWidth - okna.clientWidth - 135 + 'px';
        ten_stranici.style.width = stranica.clientWidth + 'px';
        dvigenie_paneli.style.left = osnova.clientWidth - okna.clientWidth - 10 + 'px';

        ten_kn_nazad.style.left = kn_nazad.style.left = stranica.clientWidth + 105 + 'px';
        okna.style.left = stranica.clientWidth + 135 + 'px';
        //-----------------------------------------------------------------------------------
        staroe_x = innerWidth;
        up();
    }
    if (staroe_y != innerHeight) {
        
        if (staroe_y > innerHeight) {
            okna_umen();
        } else if (innerHeight > 165 + okno_top - scrollY && okno_besedi.style.visibility == 'hidden') {
            if (okno_besedi.clientHeight < 45) okno_besedi.style.height = '45px';
            if (okno_novosti.clientHeight < 45) okno_novosti.style.height = '45px';
            if (okno_zametki.clientHeight < 45) okno_zametki.style.height = '45px';
        }else okna_uvel();
        if (localStorage.getItem('l_p')) {
            if (localStorage.getItem('l_p') == 0) ten_kn_prydki.style.visibility = kn_prydki.style.visibility = 'hidden';
            else ten_kn_prydki.style.visibility = kn_prydki.style.visibility = 'visible';
        } else {
            ten_kn_prydki.style.visibility = kn_prydki.style.visibility = 'hidden'; localStorage.setItem('l_p', 0);
        }
        ten_line_pomoshnik.style.visibility = 'visible';
        line_pomoshnik.style.visibility = 'visible';
        ten_pomoshnika.style.visibility = 'visible';
        pomoshnik.style.visibility = 'visible';

        ten_kn_nazad.style.top = kn_nazad.style.top = innerHeight - 80 + scrollY + 'px';
        line_pomoshnik.style.top = innerHeight - 73 + 'px';
        ten_line_pomoshnik.style.top = innerHeight - 61 + 'px';
        pomoshnik_go(0);
        //sleva
        
        ten_kn_prydki.style.top = innerHeight - 60 + 'px';
        kn_prydki.style.top = innerHeight - 64 + 'px';
        staroe_y = innerHeight;
        up();
    }
    
    if (scrollY) 
    {

        if (scrollY > 100 && kn_nazad_vidna == false) {
            kn_nazad_vidna = true;
            ten_kn_nazad.style.visibility = kn_nazad.style.visibility = 'visible';
        }
        
        if (kn_nazad_vidna) ten_kn_nazad.style.top = kn_nazad.style.top = innerHeight-100 + scrollY + 'px';
        
       if(master_ym){
           if(200<scrollY){
           kn_na_str(50+scrollY);
           poisk.style.top=70+kn_stran_nazad.clientHeight+scrollY+'px';
           }else{
               kn_na_str(250);
           poisk.style.top=270+kn_stran_nazad.clientHeight+'px';
           }
       }else{
       if(170+gl_p.clientHeight<scrollY){ 
       kn_na_str(50+scrollY);
       poisk.style.top=70+kn_stran_nazad.clientHeight+scrollY+'px';
       }
       else{
       kn_na_str(gl_p.clientHeight+230);
       poisk.style.top=250+gl_p.clientHeight+kn_stran_nazad.clientHeight+'px';
       }}

        line_pomoshnik.style.top = innerHeight - 73 + scrollY + 'px';
        ten_line_pomoshnik.style.top = innerHeight - 60 + scrollY + 'px';
        
        pomoshnik.style.left='40px';
        //pomoshnik.style.top = 200 + 'px';
        pomoshnik_go(0);
        //telo.style.top = innerHeight - 220 + scrollY + 'px';

        ten_kn_prydki.style.top = innerHeight - 60 + scrollY + 'px';
        kn_prydki.style.top = innerHeight - 64 + scrollY + 'px';
        ten_stranici.style.height = stranica.clientHeight + 'px';
        okna.style.height = limit + stranica.clientHeight + 'px';

        if (scrollY > 150) {
            okno_top = 60 + scrollY;
            dvigenie_paneli.style.top = okno_top - 50 + 'px';
            okb = okno_top;
            okno_besedi.style.top = okb + 'px';
            okn = okb + okno_besedi.clientHeight + 10;
            okno_novosti.style.top = okn + 'px';
            okz = okn + okno_novosti.clientHeight + 10;
            okno_zametki.style.top = okz + 'px';
        } else {
            okno_top = 210;
            dvigenie_paneli.style.top = okno_top - 60 + 'px';
            okna_umen();
        }
        if (localStorage.getItem('l_p')) {
            if (localStorage.getItem('l_p') == 0) ten_kn_prydki.style.visibility = kn_prydki.style.visibility = 'hidden';
            else ten_kn_prydki.style.visibility = kn_prydki.style.visibility = 'visible';
        } else {
            ten_kn_prydki.style.visibility = kn_prydki.style.visibility = 'hidden'; localStorage.setItem('l_p', 0);
        }
        ten_line_pomoshnik.style.visibility = 'visible';
        line_pomoshnik.style.visibility = 'visible';
        ten_pomoshnika.style.visibility = 'visible';
        pomoshnik.style.visibility = 'visible';

        posle_scroll = true;
    } else if (posle_scroll && scrollY < 2) {
if(master_ym) kn_na_str(250);else kn_na_str(gl_p.clientHeight+230);
posle_scroll = false;
        kn_nazad_vidna = false;
        ten_kn_nazad.style.visibility = kn_nazad.style.visibility = 'hidden';
        ten_kn_prydki.style.top = innerHeight - 60 + scrollY + 'px';
        kn_prydki.style.top = innerHeight - 64 + scrollY + 'px';

        line_pomoshnik.style.top = innerHeight - 73 + 'px';
        ten_line_pomoshnik.style.top = innerHeight - 60 + 'px';

        //sleva
        pomoshnik_go(0);
    
        menu_line.style.height = '55px';

        okno_top = 210;
        okna.style.top = menu.style.top = '0px';
        m_g_0.style.top = m_y_0.style.top = m_os_0.style.top = m_s_0.style.top = '44px';
        ten_m.style.top = '60px';
        ten_menu.style.top = '55px';
        name_sait1.style.top = name_sait1_teni.style.top = '60px';
        name_sait2.style.top = name_sait2_teni.style.top = '120px';
        dvigenie_paneli.style.top = '160px';
        okno_besedi.style.top = '210px';
        okno_novosti.style.top = okno_top + okno_besedi.clientHeight + 10 + scrollY + 'px';
        okno_zametki.style.top = okno_top + okno_besedi.clientHeight + okno_novosti.clientHeight + 20 + scrollY + 'px';
        if (localStorage.getItem('l_p')) {
            if (localStorage.getItem('l_p') == 0) ten_kn_prydki.style.visibility = kn_prydki.style.visibility = 'hidden';
            else ten_kn_prydki.style.visibility = kn_prydki.style.visibility = 'visible';
        } else { ten_kn_prydki.style.visibility = kn_prydki.style.visibility = 'hidden'; localStorage.setItem('l_p', 0); }
        ten_line_pomoshnik.style.visibility = 'visible';
        line_pomoshnik.style.visibility = 'visible';
        ten_pomoshnika.style.visibility = 'visible';
        pomoshnik.style.visibility = 'visible';

    }
    setTimeout('izmen_win()', 4);
}
//=================================================================================================
