
//=================================================================================================
array_name_sait = ["Творчество", "во всём!"];

predupregd = 'Сайт находится в разработке';
//=================================================================================================
array_menu = [["Главное", "Обучение", "Обсуждение", "Справка"],
["От создателя сайта", "Чего новенького", "Люди-умельцы", "Творческие работы", "Поиск по сайту", "История просмотра", "Регистрация"],
["Обучение от умельцев","Творчество", "Информатика", "Геометрия и алгебра", "Физика", "Химия", "Биология", "История", "География", "Обществознание", "Экономика",'Философия', "Литература", "Языки нaродов мира", "Астрономия", "Черчение", "Музыка", "Физкультура", "Для дошколят", "Энциклопедии","Атласы и карты","Законы и кодексы", "Заметки"],
["Беседы", "Предложения/критика", "Написать письмо"],
["Инструкция по сайту", "Донаты", "Об авторе сайта"]];
//=================================================================================================
array_razd_p = [[
    ['Приветствие', 'Особенности сайта', 'Содержимое сайта', 'Настройки сайта'],
    ['Все новости', 'Об умельцах', 'Об обучении', 'По выбранной категории'],
    ['Список с начала', 'Список с конца', 'Список по алфавиту', 'По скорости выполнения работ', 'Как стать участником нашей группы', 'Запись в группу "Люди-умельцы"'],
    ['Все изделия', 'Работы по категории творчества', 'Категории применяемости в быту', 'Выстовочные работы'],
    ['Искать везде', 'Только среди умельцев', 'Среди творческих работ', 'По названию статей и параграфов', 'По тексту','Поиск в разделах и пунктах'],
    ['Ваша история просмотра страниц', 'Уточнения по данному вопросу'],
    ['Зачем нужна регистрация', 'Что входит в регистрацию', 'Регистрация']
], [ 
    ['Обучающие уроки по мере поступления', 'Обучение от конкретного мастера', 'Обучение по категориям творчества', 'Схемы и картинки от умельцев', 'Особености данного обучения'],
    ['Рисование', 'Лепка', 'Вязание', 'Валяние', 'Вышивка и шитьё', 'Плетение','Работа с деревом','Используемая литература'],
    ['Информатика (школьный курс)', 'Редакторы изображения и видео', 'Работа с текстом', 'Работа с Windows', 'Работа с публикацией сайтов в интернете', 'Языки программирования','Кодирование данных','Используемая литература'],
    ['Геометрия (школьный курс)', 'Алгебра (школьный курс)', 'Элементы логики и теории множеств', 'Углублённый курс алгебры для абитуриентов', 'Используемая литература'],
    ['Физика (школьный курс)', 'Теоретическая электроника', 'Практическая электроника', 'Используемая литература'],
    ['Общая и неорганическая химия (школьный курс)', 'Органическая химия (школьный курс)', 'Таблица Менделеева и другие', 'Используемая литература'],
    ['Биология (школьный курс)', 'Медецина', 'Атлас строения человека', 'Энциклопедии о насекомых, животных, растениях, вирусах и бактериях', 'Используемая литература'],
    ['Всеобщая история (школьный курс)', 'История России (школьный курс)', 'История Великой Отечественной войны', 'История регионов России', 'Исторический атлас и карты', 'Используемая литература'],
    ['География (школьный курс)', 'Географический атлас и карты', 'Используемая литература'],
    ['Обществознание (школьный курс)', 'Конституция Российской Федерации', 'Используемая литература'],
    ['Экономика', 'Используемая литература'],
    ['Философия','Используемая литература'],
    ['Литература (школьный курс)', 'Произведения русских классиков', 'Используемая литература'],
    ['Русский язык', 'Английский язык (для начинающих)', 'Немецкий язык (для начинающих)', 'Французский язык (для начинающих)', 'Китайский язык (для начинающих)', 'Используемая литература'],
    ['Астрономия', 'Атлас звёздного неба', 'Используемая литература'],
    ['Черчение', 'Используемая литература'],
    ['Музыка (общие знания)', 'Игра на синтезаторе','Игра на шестиструнной гитаре','Игра на аккордеоне', 'Используемая литература'],
    ['Зарядка', 'Йога','Карате', 'Правила спортивных игр','Используемая литература'],
    ['Обучающие игры для детей', 'Чтение вслух с картинками', 'Родителям на заметку'],
    ['Исторические личности', 'Интересные факты','Вирусы и бактерии','Насекомые', 'Животные', 'Растения','Динозавры','Используемая литература'],
    ['Исторический атлас и карты','Географический атлас и карты','Атлас звездного неба','Атлас анатомии человека','Используемая литература'],
    ['Написание жалоб','ПДД - правила дорожного движения (2025 год)', 'Гражданский кодекс (2025 год)','Кодекс административных правонарушений (2025 год)','Уголовный кодекс (2025 год)','Уголовный процесуальный кодекс (2025 год)','Используемая литература'],
    ['Все заметки', 'Зачем нужны заметки']
], [
    ['Все беседы', 'Беседы по категориям','Мнения о разделах', 'Ответы от автора сайта'],
    ['Предложения', 'Критика'],
    ['Бланк отправки']
], [
    ['Вся инструкция', 'Меню сайта', 'Содержимое раздела', 'Страница', 'Боковая панель с окнами', 'Смайлик'],
    ['Что такое донаты', 'Отчёт о полученных донатах'],
    ['Вся история', 'Детство и школа', 'Переломный момент', 'Творческий подъём']
]

];
//=================================================================================================
ar_istor=[
    [
        'записывает <big><b>меню / раздел / пункт</b></big> визита'
        ,'Дата и время открытия данного пункта'
        ,'Общее время нахождения в данном пункте '
    ]
];
//=================================================================================================
ar_now=[
    [
        'Загаловок новости'
        ,'Дата и время события'
        ,'Отразится текст новости. Иногда он будет сопровождаться картинкой.<p>Чтобы свернуть текст необходимо нажать на заголовок данной новости.'
    ]
    //----------------------------------------------------------------------------
    ,[
        'День рождения моего сайта'
        ,'Дата и время события'
        ,'Наконец-то мой сайт увидел свет, а пользователи увидели его!<p>Здесь можно будет найти много полезной информации, обучиться разным вещам, вступить в группу "Люди-умельцы". Пока что там значиться лишь моё имя, но это всего лишь временное неудобство.<p>Обучение тоже будет печататься постепенно, поэтому нужно будет всего лишь подождать. <p>Основные функции уже в деле, так что можете приступать баловаться с моим сайтом и его обитателями =)'
    ]
    //----------------------------------------------------------------------------
    ,[
        
    ]
];
//=================================================================================================
ar_ym=[
    [
        'Фамелия, имя или псевдоним мастера. Например:'
        ,'Масяня Питерская'
        ,'Перечисляются все виды творчества, которыми умелец увлекается. Например:'
        ,'Вязание игрушек'
        ,'Игрa на гитаре'
        ,''
    ]
    //----------------------------------------------------------------------------
    ,[
        
        'Меня зовут'
        ,'Ильина Людмила'
        ,'Я являюсь самостоятельно обученным (без репетиторов)'
        ,'программистом'
        ,'художником'
        ,'рукодельницей'
        ,'(вязание, валяние, резьба по дереву и так далее)'
    ]
    //----------------------------------------------------------------------------
    ,[
        'Создатель данного сайта'
        ,'Ильина Людмила'
        ,''
        ,'Программист'
        ,'художник'
        ,'рукодельница:<ul><li>вяжу спицами и крючком;</li><li>валяю игрушки;</li><li>занимаюсь резьбой по дереву</li></ul>'
        ,'и многое другое'
        
    ]
];
//=================================================================================================
ar_chel=[
        [
            [//контакты
                'Указываются весь список контактов, по которым можно подписаться на его работы, отправить запрос на дружбу или связаться с ним по поводу заказа изделия(й).'
            ]
        
        ,
            
            [
                   'день рождения,'
            ,'возрост,'
            ,'место проживания,'
            ,'семейное положение'
            ]
            
        
        ,
        [
            'Например,<b> вязание кукол</b>;'
            ,'или <b>игра на гитаре</b>.'
        ]
        ,[
            '<p>Если мастер сам пожелает, то может написать:<p><ul><li>о себе, </li><li>о своей семье,</li><li>о своих хобби и работах, </li><li>об историях их начала,</li><li>о домашних питомцах,</li><li>о разных предпочтениях</li><li> или о своих взглядах на жизнь.</li></ul>'
]
        ]
        ,[
        [
            'Ок'
            ,'Телеграм'
        ]
        ,[
            'День рождения <b>15 октября.</b>'
            ,'Родилась в <b>1986</b> (<b>38</b> лет).'
            ,'Проживаю в городе <b>Россошь</b>.'
            ,'Замужем, родила дочку.'
        ]
        ,[
            'программирую игры и сайт'
            ,'пишу картины'
            ,'вяжу спицами и крючком'
            ,'занимаюсь валянием из шерсти'
            ,'плету из бисера'
            ,'плету в технике фливоите'
            ,'занимаюсь резьбой по дереву'
            ,'и много чего ещё.'
        ]
        ,[
            'Родилась, училась и проживаю в милом и тихом городке Россошь Воронежской области.<p> Избирала и поддерживаю нашего президента Владимира Владимировича Путина. Считаю что под его руководством мы сильная и сплочённая страна!'
        ]
    ]
    ,[
        [
            'Ок'
            ,'Телеграм'
        ]
        ,[
            'День рождения <b>15 октября.</b>'
            ,'Родилась в <b>1986</b> (<b>38</b> лет).'
            ,'Проживаю в городе <b>Россошь</b>.'
            ,'Замужем, родила дочку.'
        ]
        ,[
            'программирую игры и сайт'
            ,'пишу картины'
            ,'вяжу спицами и крючком'
            ,'занимаюсь валянием из шерсти'
            ,'плету из бисера'
            ,'плету в технике фливоите'
            ,'занимаюсь резьбой по дереву'
            ,'и много чего ещё.'
        ]
        ,[
            'Родилась, училась и проживаю в милом и тихом городке Россошь Воронежской области.<p> Избирала и поддерживаю нашего президента Владимира Владимировича Путина. Считаю что под его руководством мы сильная и сплочённая страна!'
        ]
    ]
];

//=================================================================================================
ar_ym_rab=[
    [
        [
            'Вид творчества'
            ,'Название изделия'
        ]
    ]
];
//=================================================================================================
ar_ym_yr=
[
     [
        [7]
        ,
        [
            '<b>Шаг 1:</b> берёшь нужного цвета клубок и вытягиваешь с него нитку<p><b>Шаг 2:</b> хватаешь крючок<p><b>Шаг 3:</b> начинаешь вязать... <p align="center"><h2>ха-ха-ха</h2> '
                    
        ]
        
        ,
        [
            '<p><b>Шаг 1:</b> берёшь гитару<p><b>Шаг 2:</b> настраиваешь струны<p><b>Шаг 3:</b> начинаешь брынькать...<p align="center"><h2>ха-ха-ха</h2>'
        ]
     ]    
];
//=================================================================================================
ar_ym_yrok=[
    [
        [
            [
                'Вид творчества.'
                ,'Видио или текстовый формат.'
                ,'Название урока'
                ,'Краткое описание занятия.'
            ]
        ]
    ]
];
//=================================================================================================
ar_ym_predm=[
    ['Перечисление творческих направлений, по которым умелец может обучить.']

];
//=================================================================================================
ar_ym_pik=[
    [
        3
    ]
];
//=================================================================================================
ar_foto_rab=[
    [3,3]
    ,[4,5]


];
//=================================================================================================
ar_tizd=
[
    [
        [
        
        
            '<img src="ym_0_foto/ym_0_rab_0_1.jpg"class="foto_rab"></img><img src="ym_0_foto/ym_0_rab_0_1.jpg"class="foto_rab"></img><img src="ym_0_foto/ym_0_rab_0_1.jpg"class="foto_rab"></img><img src="ym_0_foto/ym_0_rab_0_1.jpg"class="foto_rab"></img><br/><small>(рисунков может быть несколько и<br/> изделие может быть представленно<br/> на видео) </small>'
            ,'Название изделия, например <b>"Масяня 3d"</b>'
            ,'<p>Обязательно указываются:<ul><li>изделие вналичии, продано или подарено;</li>'
            ,'<li>размеры изделия.</li></ul>'
            ,'<p>По желанию автора указываются:<ul><li>цена и скидки для данного изделия;</li>'
            ,'<li>материал, из которого сделанно это изделие;</li>'
            ,'<li>тонкости данной работы;</li>'
            ,'<li>наличие обучающего материала по созданию данного изделия.</li></ul>'
        ]  
    ]
    ,[

    ]
];
//=================================================================================================
ar_int=
[
    [
        [
            
            'Дата публикации'
            ,'ym_0_foto/ym_0_ris_0_0.jpg'
            ,'ym_0_foto/g2.jpg'
            ,'ym_0_foto/ym_0_ris_0_0.jpg'
        ]
        ,
        [
            'Дата публикации'
           ,'ym_0_foto/ym_0_ris_0_0.jpg'
           ,'ym_0_foto/ym_0_ris_0_0.jpg'
            
        ]
    ]
];
//=================================================================================================
ar_tr=
    [
        [
            [
                [
                    '<b>фиолетовый</b>'
                ]
                ,
                [
                    '<b>Фиолетовым цветом</b>'
                ]
            ]
        ]
    ];
//=================================================================================================
ar_ts=
    [
        [
            [
                [
                    '<b>голубой</b>'
                    ,'<b> "Особенности сайта"</b>'
                    ,'<b>"Люди-умельцы"</b>'
                    ,'<b>"Творческие работы"</b>'
                    ,'<b>"Люди-умельцы"</b>'
                    ,'запись в эту группу'
                    ,'<b>уроки от умельцев,</b>'
                    ,'<b>литературные произведения,</b>'
                    ,'<b>энциклопедии,</b>'
                    ,'<b>атласы и карты,</b>'
                    ,'<b>конституция Российской Федерации,</b>'
                    ,'<b>законы, кодексы, правила дорожного движения, составление жалоб</b>'
                    ,'созданные мной <b>обучающие игры для самых маленьких.</b>'
                    ,'<b>"Главное / Чего новенького"</b>'
                    ,'пообщаться'
                    ,'написать письмо'
                    ,'<b>"Беседы"</b>'
                    ,'<b>"Особенности сайта"</b>'
                    ,'<b>"Содержимое сайта"</b>'
                    ,'<b>"Справка / Инструкция по сайту"</b>'
                ]
                //----------------------------------------------------------------------------
                ,[
                    '<b>Голубым цветом</b>'
                    ,'<b>"Обучение / Заметки"</b>'
                    ,'<b>"Обсуждение / Беседы / Все беседы"</b>'
                    ,'<b>"Главное / Чего новенького / Все новости"</b>'
                    ,'<b>"Справка / Инструкция по сайту / Боковая панель с окнами"</b>'
                    ,'<b>"Справка / Инструкция по сайту"</b>'
                ]
                ,
                [
                    'Перейти в данный раздел'
                ]
            ]
            ,[

            ]
            ,[
            ]
        ]
        ,[
            []
            ,[]
            ,[
                [
                    [
                        'Записать в шпоргалку'
                        ,'Записать в шпоргалку'
                    ]
                ]
            ]
        ]
    ];
//=================================================================================================
ar_tm=
    [
        [
            [
                [
                    '<b>салатовый</b>'
                ]
                ,[
                    '<b>Салатовый цвет</b>'
                ]
            ]
        ]
    ];
//=================================================================================================
ar_ti=
    [
        [
            [
                [
                    '<b>жёлтый</b>'
                ]
                ,[
                    '<b>Жёлтым цветом</b>'
                ]
            ]
        ]
    ];
//=================================================================================================
array_text =
    [ 
        [//Главное
            [//0 От создателя сайта

                [//0 Приветствие
                    
                    
                    '<h2><b><i>Приветик всем, кто зашёл на мой сайт!</i></b></h2>' 
                    ,'<p>Создавала этот сайт с нуля для <b>творческого развития</b> и  бесплатного <b>обучения пользователей</b>. Здесь Вы несомненно найдёте много интересной и полезной для себя информации.</p>' +
                    '<p>Этот сайт, скорее всего, не похож на другие. Он полностью соответствует <b>моему</b> представлению о комфортном обучении и наблюдении за творчеством мастеров. </p>' +
                    '<p>В тексте сайта будут встречаться надписи на цветном фоне. Это сделано для большего удобства при чтении. Чтобы ознакомиться с этой нестандартностью более подробно обязательно загляните в пункт '
                    ,' данного раздела.</p> ' +
                    '<p>В кратце расскажу, что обозначают разные цвета фона в тексте с возможностью попробовать их в деле:'+
                    '<ul><li>'
                    ,' предназначен скрывать пункты списка или текст,</li><li>'
                    ,' показывает задания, ответы, пошаговое решение,</li><li>'
                    ,' перемещает пользователя в другие разделы (в данном примере не работает),</li><li>'
                    ,' нужен для пояснения текста, расшифровки сокращений, шпоргалки, </li><li>'
                    ,' рассказывает об интересных людях, событиях и фактах.</li></ul>' +
                    '<p>Теперь окунемся в процесс ознакомления с проделанной мною работой.</p>' +
                    '<p>В меню <b>"Главное"</b> создала разделы '
                    ,' и '
                    ,'. Уверена, что ознакомление с ними пробудит в Вас любовь к творчеству. Посещение страниц умельцев в этих разделах может привести к рождению орегинальных идей. По-крайней мере, со мной это точно срабатывает.</p>' +
                    '<p>Здесь Вы сможете найти: </p><p><b><ul><li>различные аккаунты этих людей,</li><li>личные фотографии,</li><li>их работы,</li> <li>обучающие уроки,</li><li>различные, выложенные ими, схемы и рисунки.</li></ul></b></p>' +
                    '<p>Вы узнаете много нового от мастеров своего дела. Труды, маленькие хитрости и другая полезная информация ждут своего пользователя. Ещё предоставляется возможность перейти по ссылкам в аккаунты этих умельцев, чтобы заказать понравившиеся Вам вещи у самих авторов и лично обговорить их цену. </p> ' +
                    '<p>Вы не только будете созирцать на творения других людей, но и сами сможете опубликовывать свои работы. Для этого в разделе '
                    ,' имеется '
                    ,'. От Вас требуется сделать хотя бы одну вещь своими руками и можете вступать в наш дружный коллектив. Но не забывайте, что вся информация от мастеров проходит через меня, и <b>рекламы</b>, не связанной с Вашими работами, <b>я публиковать не буду!</b></p>' +
                    '<p>Проверьте свои знания или научитесь чему-то новому в меню <b>"Обучение"</b>. Здесь находятся:'+
                    '<p><ul><li>'
                    ,'</li><li><b> материал, изученный мной в школе и для саморазвития, по книгам и через интернет,</b>'
                    ,'</li><li>'
                    ,'</li></ul><p>Вы должны знать, что я очень люблю учиться. Хочу показать всем, что это не так уж и сложно, и <big><b><i>знаниям все возросты покорны.</i></b></big></p > ' +
                    '<p>Но у меня не совсем обычная структура повествования. Как я писала выше, для удобства обучения, будет попадаться текст написанный на цветном фоне. При нажатии на него открывается дополнительная информация или пользователь переносится в указанное место. </p>' +
                    '<p>Я это сделала для того, чтобы: <p><ol><li><b>уменьшить объём изучаемой информации</b>, сосредоточив внимание на основном тексте,</li><li><b>получить нужные пояснения, шпоргалки</b> именно там, где это необходимо.</li></ol> </p > ' +
                    '<p>Теоремы, законы, определения, формуры и так далее, естественно, остались неизменны. Остальная часть текста изменялась мной для удобства. Если кому-то такой подход непонраву, то прошу прощения. Я не мостак умно изъяснятся и не претендую на авторство, только пересказываю.</p>' +
                    '<p>В каждом разделе из меню <b>"Обучение"</b> имеется пункт <b>"Используемая литература"</b>, где указаны названия прочитанных по теме книг, их авторы и статьи из интернета. Настоятельно рекомендую ознакомится с ними.</p>' +
                    '<p>Сама работаю с большим количеством информации, поэтому прошу меня также простить за:<p><ul><li><b>ошибки,</b> о которых, я надеюсь, Вы сразу  сообщите мне,</li><li><b>незавершённость тем по предметам,</b> которые буду дописывать сразу, как появится на это время,</li><li><b>задержку при вступлении в группу новеньких,</b></li><li><b>замедление в выкладывании свежего материала от умельцев.</b></li></ul></p>' +
                    '<p>Я не метеор, а простая женщина, загруженная другими делами, поэтому всё успевать не смогу. Вы должны меня понять. Все изменения по сайту и его разделам будут отмечаться в меню '
                    ,'.<p>Если появятся вопросы, предложения или критика, то милости прошу в меню <b>"Обсуждение"</b>. Здесь Вы сможете '
                    ,' с другими пользователями или '
                    ,' лично мне. При наборе текста в разделе '
                    ,', пожалуйста, фильтруйте свою речь, так как Ваше высказывание автоматически записывается в файл и не контролируется мной. Зато шифрование здесь тоже не используется, и Ваша запись легко может быть проверена правохранительными органами, если поступит на Вас жалоба в соответствующие инстанции. <b>Поэтому сильно не балуйтесь!!! /:(</b>' +
                    '<p>Были описаны не все разделы меню. Если хотите получить более подробную информацию, то перейдите в пункты '
                    ,' и '
                    ,' данного раздела. Если же Вас интересует как работает весь сайта, то Вы можете зайти в меню '
                    ,'.<p>Отдельно хочу остановиться на моём помошнике <b>Смайлике</b>. Этот солнечный блинчик можно перетаскивать по браузеру, отпускать и смотреть что будет... А если пользователь задержится на сайте дольше часа, то... Впринципе... Оставлю без внимания, потому что Вы и сами можете это увидеть! Такая, своего рода, разгрузка для мозгов читателя. <b>;)</b></p>' +
                    '<h2><b><i>Желаю Вам приятного путешествия по страницам этого сайта и, надеюсь, что мой труд окажется полезным для Вас!</i></b></h2>'
                    //----------------------------------------------------------------------------
                    ,'<dd>Для убирания данного текста необходимо нажать на розовую надпись на чёрном фоне. Если нажмёте на появившуюся кнопку в правом верхнем углу, то этот текст перенесётся на отдельную страницу.</dd>'
                    ,'Для исчезновения данной информации надо нажать на заголовок фиолетовой рамки, в которой находится этот текст.<p>'
                    ,'Для убирания появившейся салатовой подсказки нужно нажать на любую надпись на цветном фоне за пределами этой рамки.'  
                    ,'Для закрытия бежевого окна нужно нажать вне его текста на любую надпись на цветном фоне.'
                    ,'"<p><dd>Но если Вы всё же нажали на ту кнопку, то перед Вами открывается отдельная страница. На ней содержаться: <ul><li> 4 кнопки сверху,</li><li>тот текст, который нужно было перенести на отдельную страничку,</li><li>теже кнопки, которые были вначале листа (но не все), что сделано для более удобного использования сайта.</li></ul><p>Кнопка "< Назад" переносит Вас на предыдущий параграф или возвращает в раздел, из которого был совершён скачок; "Вперёд >" то же самое действие, только не в предыдущий, а в следующий параграф; "^ В раздел" соответствинно переносит Вас туда откудова Вы пришли; "Развернуть" разварачивает текст на весь экран с убиранием  Смайлика, меню и панели с окнами. <p>При нажатии любой кнопки на данной странице Вы будете возвращены в раздел, потому что этот текст носит всего лишь ознакомительный характер.</dd>'                    
                    
                ],
                [//1 Особенности сайта
                    '<h2><b><i>Для более полезного использования сайта, ознакомтесь с данным пунктом!</i></b></h2>' +
                    '<p>Возможно, Вы уже заметили, что текст напичкан надписями на фоне разного цвета. Это сделанно для удобного сокращения статей, пояснения надписей и быстрого перемещения пользователя по сайту.' +
                    '<p>Объясню, что обозначают разные цвета заднего фона, а Вы можете лично проверить работу этих надписей.' +
                    '<ul><li>'
                    ,'</li><p><li>'
                    ,'</li></ul><p>В пунктах меню, расположенном изначально с верху, находятся соответствующие темам разделы. Например, в меню <b>"Обучение"</b> можно найти обучающую литературу по различным предметам. '+
                    '<p>Во всех разделах имеется своё содержание состоящее из пунков. Выбрав один из них Вы переходите на новую страничку по данной теме. Но если Вам мешает перечень этих пунктов, то можно спрятать его за страницу с текстом, нажав на кнопку ... Востановить "Содержимое раздела:" в прежнем виде можно нажав снова на неё же.' +
                    '<p>Так же Вы сможете записать любую, понравившуюся вам, информацию с этого сайта, если выделете текст и нажмёте на кнопку ... в окне <b>"Заметки"</b>. Копируемое отразится там же в виде нескольких начальных слов. Содержимое окна <b>"Заметки"</b> можно увидеть в более развёрнутом виде, нажав на его экран или зайдя в меню '
                    ,'. Когда захотите перенести эти записи к себе на компьютер, воспользуйтесь кнопкой ...' +
                    '<p>На боковой панели, кроме окна <b>"Заметки"</b>, имеются ещё два - <b>"Беседы"</b> и <b>"Новости"</b>. В них отражается переписка других пользователей на общие темы, не касающихся отдельных предметов, и что произошло за последнее время на сайте и среди умельцев. Чтобы узнать более подробную информацию отражённую в окнах, нажмите на одно из них. Вы перейдёте в '
                    ,', либо '
                    ,'.<p>Если Вам надоест постоянно меняющийся текст в окнах, то панель, на которой они находятся, можно закрыть, нажав на кнопку ... А если Вы работаете за компьютером, то ещё Вам доступно изменение высоты и ширины окон. Для более подробной информации заходите в '
                    ,'.<p>Если вам мешает сосредoточиться на изучении предмета мой помошник Смайлик, то можно его отодвинуть. Для смещения его жёрдочки воспользуйтесь всплывающей кнопкой ... Если сам Смайлик не на ней, то он всё равно откатиться за левую границу браузера. Для востановления положения жёрдочки и моего помошника наведитесь снова на левый нижний край браузера и нажмите на всплывающую кнопку.'+
                    '<p>Для более подробной информации зайдите в меню '
                    ,'.<h2>Успехов Вам в освоении новых знаний!</h2>'
                    //----------------------------------------------------------------------------                   
                    ,' выделяются надписи, открывающие списки или сам текст, отделённые от остального материала отступом и чёрными линиями вначале и вконце.'
                    ,' указана надпись, открывающая текст с ответами, подробным решением или поэтапным прохождением различных задач. Данная информация отделяется от других надписей фиолетовой рамкой.'
                    ,' выделена надпись, переносящая пользователя в упомянутый раздел сайта. Для примера при нажатии на данную надпись Вы попадёте в пункт "Приветствие" этого раздела.'
                    ,' указывает на то, что есть пояснение, шпаргалка, коментарий для данной надписи или расшифровка сокращений.' 
                    ,' выделена надпись, содержащяя интересные факты, достижения или биографии людей связаные с данной темой.' 
                    //----------------------------------------------------------------------------                    
                    ,'<dd>Цвет фона выделенного заголовка меняется на чёрный, а надпись становится розовой. Это сделанно для того, чтобы пользователь не терялся и легко ориентировался на странице. При повторном нажатии по данной  надписи открывшаяся информация исчезает, а цвет её фона становится опять розовым.<p>Обычно, я скрываю таким образом списки, разделы содержания, тексты или мои ответы на вопросы. Также может присутствовать рядом с текстом на розовом фоне подходящая картинка.<p>Если нажмёте на появившуюся кнопку в правом верхнем углу, то этот текст перенесётся на отдельную страницу. Это сделано для большего погрущения в процесс изучения материала.</dd>'
                    ,'<p>Кыждая задача сопровождается такой же фиолетовой надписью со скрытым ответом, подробным решением. При её нажатии открывается новая вложеная рамка.'+
                    '<p> Это очень удобно, когда после самостоятельного решения, хочется проверить свой ответ или ознакомиться с иными способами.'
                    ,'Шпоргалка открывается поверх другой информации. Для убирания появившейся салатовой подсказки нужно нажать на любую надпись за пределами этой рамки.'+
                    '<p>Мне кажется, что необходимо присутствие подобного рода "напоминалки" в тексте, ведь гораздо удобнее когда вся информация всегда находится у тебя подрукой ;)'
                    ,'Данные открываются поверх другой информации. Для закрытия бежевого окна нуждо нажать за его пределами на любую надпись.'+
                    '<p>Это полезно для тех, кто хочет расширить свой кругозор и увеличить уровень знаний.'
                    //----------------------------------------------------------------------------
                    ,'<dd><p>При нажатии на выбранный заголовок новости откроется текст статьи. Ниже представлен образец одной из полос: <p>'
                    ,'<dd><p>При нажатии на выбранного мастера Вы переходите на его страничку. Ниже представлен образец одной из полос, при нажатии на которую откроется окно умельца: <p>'
                    ,'<dd><p>При нажатии на выбранный вариант Вы переноситесь на страничку мастера к этой работе. Ниже представлен лишь образец одной из полос:<p>'
                    ,'<dd><p>При нажатии на выбранную полосу Вы переноситесь на записанный в ней пункт раздела. Ниже представлен лишь образец одной из полос:<p>'
                    ,'<dd><p>При нажатии на выбранный вариант Вы переноситесь на страничку мастера к началу данной темы. Ниже представлен лишь образец одной из полос:<p>'
                    ,'<dd><p>При нажатии на выбранный вариант Вы переноситесь на страничку мастера в раздел "Обучение". Ниже представлен лишь образец одной из полос:<p>'
                    ,'<dd><p>Изображения у разных мастеров может совпадать или принадлежать другим авторам, так как здесь выставляется материал взятый с общего доступа в Интернете. При нажатии на выбранную коллекцию Вы переноситесь на страничку мастера к соответствуещему разделу. Ниже представлен лишь образец одной из полос:<p>'
                    ,'</dd>'
                    //----------------------------------------------------------------------------
                    
                ],
                [//2 Содержимое сайта
                    //Начальная страница
                    '<p>Здесь содержится описание каждого пункта меню, с возможностью перехода в сами разделы, а так же ответы на волнующие меня вопросы.</p>' +
                    '<p><b><big>Меню сайта:</big></b>'
                    ,'<p>При создании данного сайта у меня постоянно возникали некоторые вопросы, ответы на которые напрашивались сами собой. Я думаю, что и Вам будет интересно узнать о моей точке зрения по данным темам.<p><b>Ответы на некоторые вопросы:</b></p>'
                    //----------------------------------------------------------------------------
                    ,
                    //1
                    '<dd><p>Если кто не знает... Я тоже творческий человек, то есть создаю из простых вещей творения искуства. Для меня это просто хобби, а для других - средство к существованию.'+
                    '<p>Такие люди тратятся на материал, теряют много личного времени творя из "ничего" шедевры. А потом большенство из них остаются неудел, так как на созданную вещь ещё надо найти такого покупателя, который оценит по достоинству затраченый, нелёгкий труд мастера. А это ещё та задачка.'+
                    '<p>Без рекламы это очень сложно сделать. Требуются постоянные денежные вливания и те, кому нечего дать, остаются в тени, с кучей непроданных изделий.'+
                    '<p><b>Извените, но я не могу смерится с этой несправедливостью!!!</b><p>Да, знаю, что всего лишь предоставляю место для бесплатной "рекламы" изделий мастеров в интернете и не более того...'+
                    ' <p>Да, знаю, что "под лежачий камень вода не течёт" и мастерам придётся сильно потрудится, чтобы стать востребованным участником группы "Люди-умельцы"...'+
                    '<p>Да, знаю, что не всем удастся продвинуться в качестве продавцов своих изделий...'+
                    '<p>Да, знаю, что затрачу огромное количество сил, времени и средств (так как это займёт дополнительное, <b>небесплатное</b> пространство в интернете)...'+
                    '<p>Но уравновесить шансы мастеров, чтобы <b>каждый нашёл свою нишу и достойного покупателя</b>, независимо от наличия средств - <b>ЭТО СТОИТ ТОГО!</b> Именно поэтому сделала <b>участие в группе абсолютно бесплатным!</b></dd>'
                    //----------------------------------------------------------------------------
                    ,'<dd><p>Сайт изначально задумывался как тренинг для самой себя по разным предметам, изучаемым мной когда-то в школе. Просто зная много информации, частично что-то забывается из уже изученного. К тому же, <b>мне нравится воскрешать знания заного </b>и иметь разные альтернативные точки зрения по одному и тому же вопросу.'+
                    '<p>Я была серой мышкой в школьные годы, часто болела, много пропускала занятий, но всегда знала то, что проходили по программе на должном уровне. Помню обажала читать разную научную литературу. Задачки по алгебре, физике, информатике как семечки щёлкала, даже если сталкивалась с ними впервые по причине болезни.'+
                    '<p>Я могла бы просто читать необходимую литературу и дальше, решать упрожнения, просто бессмысленно исписывая тетрадки, но мне хочется поделиться знаниями со всеми, не зависемо от возроста и здоровья. Тем более пересказывая материал, развиваю память, увеличиваю свой потенциал в программировании.'+
                    '<p>Кстати, меня в школе называли хакером, хотя я поводов не давала. И теперь знаю много языков программирования, но всё равно до хакеров мне далеко =)'+
                    '<p>К тому же, на мой сайт (я так предполагаю) <b>будут заходить и подростки,</b> которые по достоинству оценят мой, довольно таки сложный, труд. Здесь <b>они смогут найти нужную информацию по школьной программе.</b>'+
                    '<p> Правда, я не смогу напечатать и выложить весь материал сразу. Уж извените меня за это. Моему сайту придётся долго терпеть критику по этому поводу. После появления данного сайта в общедоступной паутине интернета пройдёт ещё года три или четыре, прежде чем я закончу излогать весь материал из школьной десциплины. Надеюсь, что моего здоровья хватит для этого и я не сойду с ума.'+
                    '<p>Могу порекомендовать для особо заинтересованных в углублённом изучении школьных предметов учебное издание <b>"ФГОС. Инновационная школа".</b>'+
                    '<p> Даже если Вы были слабы в изучении определённых дисциплин, то при прочтении книг этого издательства обязательно усвоите нужный материал. Всё написанно понятнум общедоступным языком, приподноситься вся информация в мельчайших деталях, но без лишних высказываний. Всё по теме, без ныряния в дебри.'+
                    '<p><b> Ребята, трудящиеся над созданием данной литературы, просто молодцы!</b>'+
                    '<p>Мне очень понравелось работать с этими учебниками. Жаль что при написании сайта пришлось изощьрятся, чтобы, ненароком, не скопировать параграфы только лишь из данных книг, ведь у меня должно быть всё в комплексе взято из разных источников.'+
                    '                    </dd>'
                    //----------------------------------------------------------------------------
                    ,'<dd><p>Не обязательно обучаться тому, что никогда не пригодиться. Это можно сказать о любом предмете указанном в меня "Обучение" на данном сайте... Но когда Вы сталкиваетесь в жизне с определённым законом или правонарушением, то, естественно:<b><ul><li> хотелось бы знать о чём в законе говориться,</li><li> понять насколько это серьёзно,</li><li>что с этим можно сделать.</li></ul></b>'+
                    ' <p>Это и есть ответ на вопрос зачем создавался данный раздел. Но всё не так сложно, если разобраться.<p> Нарушения некоторых законов, в реальности, приводит лишь к небольшим штрафам, предупреждениям или предписаниям. Но многие, не зная этого, делают ещё более опасные "манёвры". Чтобы уйти от ответственности и маленьких штрафов, создают настоящую угрозу для себя и общества.'+
                    '<p>Чтобы такого не происходило, публикуя законы и правила из различных российских кодексов, я постаралась, там где это надо, сделать шпоргалки в их названиях, сообщающие в кратце о чём там говориться. Это поможет читателю:<ul><li>чуть-чуть разобраться в законах и предотвратить совершение других, более тяжёлых преступлений;</li><li>оградиться от действий машеников, предпологающих что Вы не знаете законов;</li><li>узнать о своих правах и обязаностях.</li></ul>'+
                    '<p> Но всё же помните, что я обычный человек, без специальной квалефикации. Могу и ошибаться.<p align="center"><b><big>Главное не нарушайте порядок, чтобы не пришлось отвечать по закону!</big></b></dd>'
                    //----------------------------------------------------------------------------
                    ,'<p>Ещё не написан'
                    ,'<p>Ещё не написан'
                    ,'<p>Ещё не написан'
                    ,'<p>Ещё не написан'
                    ,'<p>Ещё не написан'
                    ,'<p>Ещё не написан'
                    ,'<p>Ещё не написан'
                    ,'<p>Ещё не написан'
                    ,'<p>Ещё не написан'
                    ,'<dd><p>Изучаю информатику со школьной скамьи. Первой игрушкой запрограммированной мной на Basic стал лаберинт. Сейчас уже знаю много языков программирования и хочу поделиться своими знаниями с окружающими.'+
                     '<p>Но информатика не ограничивается только знанием программных языков. Она затрагивает всё, что связанно с компьютерами на начальном уровне. Здесь представленны только мои навыки работы в этой сфере.</dd>'
                    ,'<p>Ещё не написан'
                    ,'<p>Ещё не написан'
                    ,'<p>Ещё не написан'
                    ,'<p>Ещё не написан'
                    ,'<p>Ещё не написан'
                    ,'<p>Ещё не написан'
                    ,'<p>Ещё не написан'
                    ,'<p>Ещё не написан'
                    ,'<p>Ещё не написан'
                    ,'<p>Ещё не написан'
                    ,'<p>Ещё не написан'
                    ,'<p>Ещё не написан'
                    ,'<p>Ещё не написан'
                    ,'<p>Ещё не написан'
                    ,'<p>Ещё не написан'
                    ,'<p>Ещё не написан'
                    ,'<p>Ещё не написан'
                    ,'<p>Ещё не написан'
                    ,'<p>Ещё не написан'
                    ,'<p>Ещё не написан'
                    ,'<p>Ещё не написан'
                    ,'<p>Ещё не написан'
                    ,'<p>Ещё не написан'
                    ,'<p>Ещё не написан'
                    ,'<p>Ещё не написан'
                    ,'<p>Ещё не написан'
                    ,'<p>Ещё не написан'
                    ,'<p>Ещё не написан'
                    ,'<p>Ещё не написан'
                    ,'<p>Ещё не написан'
                    ,'<p>Ещё не написан'
                    ,'<p>Ещё не написан'
                    ,'<p>Ещё не написан'
                    ,'<p>Ещё не написан'
                    ,'<p>Ещё не написан'
                    ,'<p>Ещё не написан'
                    ,'<p>Ещё не написан'
                    
                    

                ],
                [//3 Настройки сайта
                   
                '<p>Здесь можно изменить дизайн, окраску или положение некоторых деталей сайта. Для этого просто выберите один из представленных мной вариантов. Эти изменения будут сохраняться для Вас, даже если закроете этот сайт или браузер. <p align="center"><i><b><big> Наслаждайтесь получением знаний с комфортом!</big></b></i><p><b>Изменить:</b><dd>'
                ,'</dd><p><b>Украсить рисунками:</b><dd>'
                ,'</dd><p><b>Определить размещение:</b><dd>'
                ,'</dd>'
                   

                ]
            ],
            [//1 Чего новенького
                
                [//0 Все новости
                    '<p>Новости идут в свёрнутом виде. Показан только загаловок и дата. Если захотите прочитать всю статью, то нажмите на интересующую Вас новость. Так же Вы сможите перейти в то место на сайте, о котором расказывается.</p>' 
                    
                ],
                
                [//Об умельцах
                
                '<p>Здесь представлены новости, касающиеся только умельцев и их работ.</p>'
                ],
                [//Об обучении
                    '<p>Новости касающиеся обучения, в том числе от умельцев, с возможностью посмотреть на данные разделы и параграфы.</p>'
                ],
                [//По выбранной категории
                    '<p>Выберите из списка нужную категорию, по которой Вы хотели бы увидеть новости:</p>' 

                    //'<ul><li><div id="tp_0_1_3_0"class="paragraf" onmousedown="on_tp_0_1_3(0)"onmouseover="on_tp(1,0,1,3,0)"onmouseout="on_tp(2,0,1,3,0)">"Люди-умельцы"</div></li><p>' +
                    //'<li><div id="tp_0_1_3_1" class="paragraf" onmousedown="on_tp_0_1_3(1)" onmouseover="on_tp(1,0,1,3,1)" onmouseout="on_tp(2,0,1,3,1)">Обучение</div></li><p>' +
                    //'<li><div id="tp_0_1_3_2"class="paragraf" onmousedown="on_tp_0_1_3(2)"onmouseover="on_tp(1,0,1,3,2)"onmouseout="on_tp(2,0,1,3,2)">Ответы на предложения</div></li></ul>'
                ]
            ],
            [//2 Люди-умельцы
                [//Список с начала
                    
                    'Общие работы могут делится на категории по желанию автора:'
                    ,'Здесь могут быть представлены уроки разного формата (картинками, фото, видео, текстом), по разному называться и делиться на определённые категории, если автор этого пожелает:'
                    
                    
                    ,'Чтобы узнать более подробную информацию об изделии или увеличить рисунок, щёлкните по его изображению или голубому фону, на котором он находится.'
                    


                    ,'Здесь находятся группы рисунков и схем скаченных умельцем с интернета, разделённые друг от друга датой и временем их публикации<p>'
                    ,'Здесь представлены различные хитрости (не только данного умельца), используемые им в своём творчестве. Например:'
                    ,'Фотографии и видео могут быть разбиты на отдельные категории, по желанию умельца. Например:'
                    ,'Упс... А здесь пока-что ничего нет :( '
                    ,'<b>Шаг 1:</b> берёшь нужного цвета клубок и вытягиваешь с него нитку<p><b>Шаг 2:</b> хватаешь крючок<p><b>Шаг 3:</b> начинаешь вязать... <p align="center"><h2>ха-ха-ха</h2> '
                    ,'<p><b>Шаг 1:</b> берёшь гитару<p><b>Шаг 2:</b> настраиваешь струны<p><b>Шаг 3:</b> начинаешь брынькать...<p align="center"><h2>ха-ха-ха</h2>'
                    ,'Всегда, рада поделится своими хитростями, но пока в голову ничего не лезит :)'
                ],  
                [//Список с конца

                ],
                [//Список по алфавиту

                ],
                [//По скорости выполнения работ

                ],
                [//Как стать участником нашей группы
                    '<p>Если Вы хотите стать участником группы "Люди-умельцы", то Вы должны сделать хотя бы две "вещицы своими руками" (для певца - его исполнением, для писотеля - его произведением и так далее), отвечающие заявленной Вами специализации. Прислать фото данных изделий (или концертов) с заявкой на вступление в группу, которое можно написать в пункте "Запись в группу "Люди-умельцы".' +
                    '<p>Обязательно указать свой ник или Фамелию, Имя, Отчество (по желанию) и адрес электронной почты, через которую я смогу с Вами связаться. Если он окажется фикцией (фейком), то я просто не внесу Вас в группу. Но Вы всегда сможете попробовать занова.' + 
                    '<p>Не забудте написать адреса своих аккаунтов, в которые смогут входить мои пользователи, чтобы ознакомиться с Вашим творчеством. </p>' +
                    '<p>Так же должна проинформировать Вас, что <b>на сайт могут проникнуть хакеры, поэтому будте бдительны!</b> Для своей же безопасности заведите отдельный адрес электронной почты, по которому мы будем общаться. Желательно никому не сообщать этот адрес, кроме меня. Это поможет Вам игнорировать посторонние "посылки" от незнакомцев на данной электронной почте.</p>' +
                    '<p>Скорость ответа на Ваш запрос будет медленной, потому как я не метиор, проверяю заявки только раз в сутки. Прошу меня понять и простить за неудобство. </p>'+
                    '<p><h2>Равноправно и с уважением относитесь к своим соперникам!</h2>'+
                    '<p>Ещё Вы должны знать, что <b>я не люблю скандалистов. </b> Захотите устроить разборки, то не на моём сайте. Если от Вас поступят обвинения кого-то в краже Ваших фото на изделие или чьём-то непристойном повидении, то прилетит ответка от меня: <b>я удалю Вас из группы без возможности вернуться!</b>'
                ],
                [//Запись в группу "Люди-умельцы"
                    '<p>Если Вы хотите вступить в группу, то заполните для этого нижеприведённую форму, где главными являются имя, адрес электронной почты и хотябы один аккаунт. Если, впоследствии, Вы захотите что-либо изменить на Вашей странице, то просто сможете обратиться ко мне. '
/*                '<p><form><fieldset><p>Хочу вступить в вашу группу под именем:'+
                '<div style="text-indent:0px;" align="center"><input type="text" size="50" name="chel_name"class="ym_reg"></input>'+
                '<br/><small>(псевдоним или фамелия, имя, отчество по желанию)</small></div>'+
                '<p><hr align="center"><p>Мой адрес электронной почты:'+
                '<div style="text-indent:0px;" align="center"><input type="text" size="50" name="chel_name"class="ym_reg"></input></div>'+
                '<p>Список моих аккаунтов:'+
                '<div style="text-indent:0px;" align="center"><textarea type="text" style="height:100px;width:400px;" name="chel_name"class="ym_reg"></textarea>'+
                '<br/><small>(псевдоним или фамелия, имя, отчество по желанию)</small></div>'+
                '<p>Мой день рождения: <input type="text"size="14"name="chel_den_rogden" class="ym_reg"></input> <small>(число, месяц)</small>'+
                '<p>Cейчас мне: <input type="text"size="3"name="chel_god_rogden" class="ym_reg"></input> <small>(Ваш возрост)</small>'+
                '<p>Я проживаю в: <div align="center"><input type="text"size="50"name="chel_progiv"class="ym_reg"></input>'+
                '<br/><small>(область, город, село или деревня)</small></div>'+
                '<p>Моё семейное положение: <div style="text-indent:0px;" align="center"><input type="text"size="50"name="chel_progiv"class="ym_reg"></input>'+
                '<br/><small>(холост или женат(замужем), сколько детей)</small></div>'+
                '<p>У меня есть хобби, которыми я хочу поделиться с другими пользователями: <div style="text-indent:0px;" align="center"><textarea type="text"name="chel_hobby"style="height:100px;width:300px"resize="false"></textarea>'+
                '<br/><small>(перечислите виды творчества, которыми Вы увлекаетесь и хотите, чтобы знали другие)</small></div>'+
                '</fieldset></form>'*/
  
                ]
                
            ],
            [//Творческие работы
                [//Все изделия
                    'Пока что не заполнен '
                ],
                [//Работы по категории творчества
                    '<p>Многие из представленных работ находяться сразу в нескольких категориях. Выберите нужный Вам вид творчества: <p>' 
                   
                ],
                [//Категории применяемости в быту
                    '<p>Многие из представленных работ находяться сразу в нескольких категориях. Выберите нужный Вам пункт:<p>' 
                   
                ],
                [//Выстовочные работы
                    ''
                ],
            ],
            [//Поиск по сайту
                [//Искать везде
                    '<p>Поисковик не обращает внимание на заглавные буквы и читает их как прописные<p>Введите искомый текст:<p> ' +
                    'Искать<p>' +
                    'Результаты поиска с возможностью перейти в данный раздел:<p>'
                ],
                [//Только среди умельцев
                    '<p>Поисковик ищет только среди умельцев!<p>'
                ],
                [//Среди творческих работ
                    '<p>Поисковик ищет только среди представленных здесь работ умельцев и их описании!<p>'
                ],
                [//По названию статей и параграфов
                    '<p>Поисковик ищет только среди оглавлений и параграфов!<p>'
                ],
                [//По тексту
                    '<p>Поисковик ищет только лишь по тексту статей!<p>'
                ],
                [//Результаты поиска за посещение
                    'Здесь находяться результаты поиска за последнее посещение сайта "Творчество во всём": '
                ]
            ],
            [//История просмотра
                [//Ваша история просмотра страниц

                ],
                [//Уточнения по данному вопросу
                    '<p>Представленный здесь путь Вашего следования будет доступен только Вам. После обнавления сайта или нажатия на кнопку "Обнулить" путь сотрётся и будет записываться с чистого листа.<p> ' +
                    'В пункте "Ваша история просмотра страниц" содержаться все Ваши перемещения по сайту с датой и временем захождения и выхода в разделы. Вы можете перейти в указанный раздел снова, нажав на данную надпись.'
                ]
            ],
            [//Регистрация
                [//Зачем нужна регистрация
                    '<p>Я не сторонник слежки за своими пользователями и не люблю когда принуждают к регистрации на некоторых сайтах. <p>Данная регистрация нужна Вам, если хотите получать новости об изменениях на сайте, или по определённым разделам.'
                ],
                [//Что входит в регистрацию
                    '<p>Для регистрации будет запрашиваться:<p><ul>' +
                    '<li>Ваш ник или Фамелия, Имя, отчество</li><p>' +
                    '<li>Адрес электронной почты.</li><p>Проверять на подленность данного адреса не буду. Вы просто не будете получать новости, если окажется фейковая почта.<p>' +
                    '<li>Будет предоставлен выбор между новостями по всему сайту или только определённым разделам</li><p>' +
                    '<li>Если вы выберете второй пункт, то откроется список интересующих Вас разделов. Вы сможете назначить сразу несколько категорий из представленных.</li><p>' +
                    '</ul>'
                ],
                [//Регистрация
                    '<p>Для получения новостей лучше завести отдельно новый адрес электронной почты для своей же безопасности. '
                ]
            ]
        ],
        [//Обучение
            [//Обучение от умельцев
                [//Обучающие уроки по мере поступления
                    '<p>Здесь видны толь загаловок с кратким описанием и автор. Если захотите увидеть полностью занятие, то нажмите на его оглавление.<p> ' 
                    
                ],
                [//Обучение от конкретного мастера
                    '<p>Выберите нужного Вам мастера:<p>' 
                    
                ],
                [//Обучение по категориям творчества
                    '<p>Выберите категорию творчества, по которой Вы хотели бы получить обучение от наших умельцев:<p>' 
                ],
                [//Обучающие схемы от умельцев
                    '<p>Схемы могут совпадать или принадлежать другим, неисзестным, авторам. Вы должны понимать, что всё попавшее в Internet становится достоянием общества. Здесь указывается человек, который выложил материал, для общего обозрения<p>' 
                ],
                [//Особенности данного обучения
                    '<p> '
                ],
            ],
            [//Творчество
                [//Рисование
                 [   'Умение рисовать во мне заложено генетически. Мой отец и его брат тому прямое подтверждение. Папа выполнял интересные, красивые работы по дереву, когда был отвлечён от других дел. А его брат обучался в художке и рисовал потрясающие портреты. <p>Но, не смотря на это, мне кажется, что каждый после обучающих занятий сможет создавать прекрасные картины, выражая свой внутренний мир на бумаге или холсте.<p>Я собрала здесь все типы рисования, которые смогла освоить сама и хочу обучить Вас этому замечатильному ремеслу! Большинство работ сделано мною в 2026 году.'
                ,'<p>При раскрытии надписи на розовом фоне в правом верхнем углу будет кнопка ... При её нажатии открывшийся материал будет показан в отдельном окне для более лучшего усвоенния данных.' ]
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                 ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет','<p>12']
                ,['<p>Привет']
    
            ],
                [//Создание скульптур
                'Создание скульптур с помощью разных материалов это неотъемлимая часть художника. Здесь представленны те виды лепки, которые я смогла освоить. Приглашаю и Вас окунуться в этот вид творчества. <p>Если Вы не сможете лепить красивые вещи, то хотябы с пользой проведёте время. Ведь маторика рук сильно увеличиться, когда Вы на практике будете изучать данный материал.'
                ],
                [//Вязание
                'Не считаю что вязание это удел старушек. Просто подобное высказывание лишь благородная отмазка для тех, кто не усидчив и ленив. Я могу привести кучу примеров, где вязанием занимаются молодые девушки (мужчины тоже) и не плохо на этом зарабатывают. <p>Я отъявленная вязальщица и могу показать Вам то, что умею сама. По крайней мере деменция Вам точно не светит, пока будете осваивать данный вид творчества. Кстати, вязание хорошо успокаивает нервишки!'
                ],
                [//Валяние
                'Обожаю создавать прекрасное из камочков шерсти. Это называется валянием. С помощью него получаются дельные вещи от простых покрывал до обуви, игрушек и так далее.<p>Советую Вам тоже изучить этот очень интересный вид творчества. '
                ],
                [//Вышивка
                    'Иногда занимаюсь вышивкой. Конечно, можно было бы больше времени проводить за этим занятием, но это уж слишком кропотливая работа! Времени у меня на это совсем ограниченное количество. Хотя создание чюлочных игрушек происходит достаточно быстро (за что можно ему поставить маленький плюсик).<p>Попробуйте себя в изучении данного мастерства! '
                ],
                [//Плетение
                'Плетение это ещё один вид творчества, освоенный мной за последнее время. Я не могу сказать, что это мой любимый досуг, но если время есть, а другие хобби надоели, можно и позаниматься им. Его не сложно освоить, но чтобы создать что-то дельное уходит приличное количество времени (впринципе, как и при других видах творчества). <p>Но попробовать себя в этом деле, просто из любопытства, рекомендую. Кто знает, может эта литература поможет стать Вам професионалом в данном виде творчества! '
                ],
                [//Резьба по дереву
                'Сразу скажу, что это опасное занятие. Если Вам нет 18, то лучше не забивайте себе голову данным творчеством. Мой отец проткнул себе стамеской кисть на сквозь, когда вырезал фигурку из бруска дерева. У меня была небольшая травма, но тоже от этого инструмента. Всё же я не прикратила заниматься резьбой по дереву, хотя это сложное и опасное хобби. Чаще им увлекаются мужчины, а не женщины.   <p>Если Вы всё же решили рискнуть в изучении этого мастерства, то в начале буквально наизусть выучите меры предосторожности и безопасности из данной литературы. Ещё рекомендую запастись ватой, бинтом, перекесью водорода и спиртом. Да даст Вам Бог терпения, сил и внимания при практическом применении новых знаний!'
                ]
                ,[//Используемая литература
                    ]
            ],
            [//Информатика
                [//Информатика(школьный курс)
                    'При открытии "Содержания" или "Подготовка к контрольным и ЕГЭ" Вы не раз увидите в начале параграфа в правом верхнем углу кнопку ... При нажатии на неё весь материал откроется на отдельной страничке. Это сделано для более лучшего усвоения текста.<p>Но вначале, рекомендую, зайти в "Шпоргалки" и открыть нужный Вам фрагмент изучаемого материала поверх другого содержимого сайта. Мне, например, эта функция помогает более продуктивно повторять темы и решать задачки. '
                    //'Информатика мне понравилась сразу при начальном изучении её в школе. Только книг по данному предмету в те годы, когда я училась, ещё не выдавали. <p>Если хотите как я шарить в компьютерах, то для начала советую пройти данный школьный курс, чтобы понять сможете Вы или нет двигаться дальше в этом направлении.'
                    ,[
                        'Записать в шпору'
                    ]

                ],
                [//Редакторы изображения и видео
                    'Часто требуется создать или подредактировать изображения (картинки) или видео. Могу посоветовать, то чем пользовалась сама.<p> Но для новичков рекомендую для начала ознакомиться с представленой ниже литературой, чтобы потом применить свои знания на практике.'
                ],
                [//Работа с текстом
                    'Для работы с текстом использую средства Microsoft, поэтому рассказала в ниже приведённой литературе все хитрости для разных редакторов этой компании.'
                ],
                [//Работа с Windows
                'Если Вы касались Windows поверхностно и не знаете некоторых хитростей при работе с этой операционной системой, то эта литература для Вас.<p>Я изложила здесь всё, что знаю по данной теме сама. Читайте и отрабатывайте свои навыки в системе!'
                ],
                [//Работа с публикацией сайта в интернете
                    'Главной проблемой для публикации своего сайта в интернете, с полным доступом всех пользователей, стало моя малая осведомлённость в этом деле.<p>Мне пришлось поднять кучу информации, изучить некоторые темы из разных источников, чтобы добиться желаемого.<p>Теперь Вы сможете перемахнуть через этот барьер с публикацией Вашего сайта без проблем, если изучете нижеприведенную литературу, собранную мной в одном месте. Желаю удачи!'
                ],
                [//Языки программирования
                    'Здесь представленны все, изученные мной в разные годы, языки программирования. При создании этого сайта, использовала HTML, CSS, JavaScrept. <p>Из данного списка самым быстрым при выполнении команд компьютером является Assembler, но самым удобным для программиста, по моему мнению, остаётся С# (уж простите меня поклоники JavaScript).<p>Мне интересно узнать каким будет Ваше мнение после изучения ниже приведённой литературы... '
                ],
                [//Кодирование страниц
                'Я обожаю разные головоломки и компьютерное кодирование входит в их число. Может и Вы относитесь к числу таких двинутых любителей. Кто знает...<p>В ниже приведённой литературе я представила только часть из того, что знаю о кодах сама. Если хотите, можете освоить некоторые способы шифрования. '
                ],
                [//Используемая литература
                ],
                
            ],
            [//Алгебра и Геометрия
                [//Геометрия(школьный курс)
                ],
                [//Алгебра(школьный курск)
                ],
                [//Элементы логики и теории множеств
                    'При открытии "Содержания" Вы не раз увидите в начале параграфа в правом верхнем углу кнопку ... При нажатии на неё весь материал откроется на отдельной страничке. Это сделано для более лучшего усвоения текста.<p>Но вначале, рекомендую, зайти в "Шпоргалки" и открыть нужный Вам фрагмент изучаемого материала поверх другого содержимого сайта. Мне, например, эта функция помогает более продуктивно повторять темы. '
                ],
                [//Углублённый курс алгебры для абитуриентов
                ],
                [//Используемая литература
                ],
            ],
            [//Физика
                [//Физика(школьный курс)
                ],
                [//Теоретическая электроника
                ],
                [//Практическая электроника
                ],
                [//Используемая литература
                ],
            ],
            [//Химия
                [//Общая и неорганическая химия(школьный курс)
                ],
                [//Органическая химия(школьный курс)
                ],
                [//Таблица Менделеева
                ],
                [//Энциклопедия о бактериях

                ],
                [//Используемая литература
                ],
            ],
            [//Биология
                [//Биология(школьный курс)
                ],
                [//Медецина
                ],
                [//Атлас строения человека
                ],
                [//Энциклопедии о насекомых, животных и растениях

                ],
                [//Используемая литература
                ],
            ],
            [//История
                [//Всеобщая история(школьный курс)
                ],
                [//История России(школьный курс)
                ],
                [//Истрория Великой Отечественной войны
                ],
                [//История регионов России
                ],
                [//Исторический атлас и карты
                ],
                [//Используемая литература
                ],
            ],
            [//География
                [//География(школьный курс)
                ],
                [//Географический атлас и карты
                ],
                [//Используемая литература
                ],
            ],
            [//Обществознание
                [//Обществознание(школьный курс)
                ],
                [//Конституция Российской Федерации
                ],
                [//Используемая литература
                ],
            ],
            [//Экономика
                [//Экономика
                ],
                [//Используемая литература
                ],
            ],
            [//Философия
                [//Философия

                ],
                [//Используемая литература

                ]
            ],
            [//Литература
                [//Литература(школьный курс)
                ],
                [//Произведения русских классиков
                ],
                [//Используемая литература
                ],
            ],
            [//Языки народов мира
                [//Русский язык
                ],
                [//Английский язык(для начинающих)
                ],
                [//Немецкий язык(для начинающих)
                ],
                [//Французский язык(для начинающих)
                ],
                [//Китайский язык(для начинающих)
                ],
                [//Используемая литература
                ],
            ],
            [//Астрономия
                [//Астрономия
                ],
                [//Атлас звездного неба
                ],
                [//Используемая литература
                ],
            ],
            [//Черчение
                [//Черчение
                ],
                [//Используемая литература
                ],
            ],
            [//Музыка
                [//Музыка(общие знания)
                ],
                [//Игра на синтезаторе
                ],
                [//Игра на шестиструнной гитаре
                ],
                [//Игра на аккордеоне
                ],
                [//Используемая литература
                ],
            ],
            [//Физкультура
                [//Зарядка
                ],
                [//Йога
                ],
                [//Карате
                ],
                [//Правила спортивных игр

                ]
                ,[//Используемая литература
                    ]
            ],
            [//Для дошколят
                [//Обучающие игры для детей
                ],
                [//Чтение вслух с картинками
                ],
                [//Родителям на заметку
                ],
            ],
            [//Энциклопедии
                [//Исторические личности
                ],
                [//Интересные факты
                ],
                [//Бактерии
                ]
                ,[//Насекомые

                ]
                ,[//Животные

                ]
                ,[//Растения

                ]
                ,[//Динозавры

                ]
                
                ,[//Используемая литература
                    ]
            ],
            [//Атласы и карты
                [//Исторический атлас и карты
                    
                ],
                [//Географический атлас и карты
                    
                ]
                ,[//Атлас звёздного неба

                ]
                ,[//Атлас анатомии человека

                ]
                ,[//Используемая литература
                    ]

            ],
            [//Законы и кодексы
                [//Написание жалоб
                    'При открытии "Содержания" вы не раз увидите в начале параграфа в правом верхнем углу кнопку ... При нажатии на неё весь материал откроется на отдельной страничке. Это сделано для более лучшего усвоения текста.'
                ],
                [//ПДД-правила дорожного движения(2025 год)
                    
                ],
                [//Гражданский кодекс(2025 год)
                    
                ],
                [//Кодекс административных правонарушений(2025 год)
                    
                ],
                [//Уголовный кодекс(2025 год)
                    
                ],
                [//Уголовный процесуальный кодекс(2025 год)
                    
                ]
                ,[//Используемая литература
                    ]
            ],
            [//Заметки
                [//Все заметки
                ],
                [//Зачем нужны заметки
                ],
            ]
        ],
        [//Обсуждение 
            [//Беседы
                [//Все беседы
                ],
                [//Беседы по категориям
                ],
                [//Мнения по разделам
                ],
                [//Ответы от автора сайта
                ],
            ],
            [//Предложения/критика
                [//Предложения 
                ],
                [//Критика
                ],
            ],
            [//Написать письмо
                [//Бланк отправки
                ]
            ]
        ],
        [//Справка
            [//Инструкция по сайту
                [//Вся инструкция
                ],
                [//Меню сайта
                ],
                [//Содержимое раздела
                ],
                [//Страница
                ],
                [//Боковая панель с окнами
                ],
                [//Смайлик
                ],
            ],
            [//Донаты
                [//Что такое донаты
                ],
                [//Отчёт о полученных донатах
                ],
            ],
            [//Об авторе сайта
                [//Вся история
                ],
                [//Детство и школа
                ],
                [//Переломный момент
                ],
                [//Творческий подъём
                ],
            ]
        ]
    ];
//=================================================================================================
ar_shp=
    [
        [
        [
['шпора',0]
,['шпора 2',0]
        ]
    ]
        ,[]
        ,[
            
        ]

    ];
//=================================================================================================
ar_tp=
    [
        [//Главное
            [//От создателя сайта
                [//Приветствие
                    ['розовый',0,0,0,0]
                ]
                //----------------------------------------------------------------------------
                ,[//Особенности сайта   
                    
                    ['Здесь перечисленны цвета, действие которых возможно на всём сайте:',0,1,2,0]
                    ,['Здесь перечисленны конкретные разделы содержащие списки из цветных контейнеров с текстом и, если нужно, фотографиями: ',1,1,2,0]
                    ,['<b>Розовым цветом</b>',0,3,3,1]
                    ,['Раздел "Чего новенького" содержит список новостей.',0,4,5,2]
                    ,['Раздел "Люди-умельцы" содержит список учасников группы.',0,4,6,2]
                    ,['Раздел "Творческие работы" содержит список изделий от авторов.',0,5,7,2]
                    ,['Раздел "История просмотра" содержит пополняемый список Ваших передвижений по сайту при данном посящении.',0,6,8,2]
                    ,['Раздел "Обучение от умельцев" содержит список уроков от мастеров.',0,7,9,2]
                    ,['Раздел "Обучение от умельцев" содержит пункт <b>"Обучение от конкретного мастера"</b>, где указывается список умельцев, способных обучить определённым навыкам пользователя.',0,8,10,2]
                    ,['Раздел "Обучение от умельцев" еще содержит пункт <b>"Схемы и картинки от умельцев"</b>, в котором представлены коллекции различного фото-материала.',0,9,10,2]
                ] 
                //----------------------------------------------------------------------------
                ,[//Содержимое сайта
                    ['"Главное" содержит разделы:',0,0,1,0]
                    ,['"Обучение" содержит разделы:',0,0,2,0]
                    ,['"Обсуждение" содержит разделы:',0,1,3,0]
                    ,['"Справка" содержит разделы:',0,2,3,0]
                    ,['Почему сделала участие в группе "Люди-умельцы" обсалютно бесплатным?',0,4,5,0]
                    ,['Почему заостила внимание в обучении на школьной программе?',0,4,6,0]
                    ,['Зачем создала раздел "Законы и кодексы" выходящий за рамки обучающей программы?',0,5,6,0]
                    ,["От создателя сайта",0,7,8,1]
                    ,["Чего новенького",0,7,9,1]
                    ,["Люди-умельцы",0,8,10,1]
                    ,["Творческие работы",0,9,11,1]
                    ,["Поиск по сайту",0,10,12,1]
                    ,["История просмотра",0,11,13,1]
                    ,["Регистрация",0,12,13,1]
                    ,["Обучение от умельцев",0,14,15,2]
                    ,["Творчество",0,14,16,2]
                    ,["Информатика",0,15,17,2]
                    ,["Алгебра и Геометрия",0,16,18,2]
                    ,["Физика",0,17,19,2]
                    ,["Химия",0,18,20,2]
                    ,["Биология",0,19,21,2]
                    ,["История",0,20,22,2]
                    ,["География",0,21,23,2]
                    ,["Обществознание",0,22,24,2]
                    ,["Экономика",0,23,25,2]
                    ,["Философия",0,24,26,2]
                    ,["Литература",0,25,27,2]
                    ,["Языки стран мира",0,26,28,2]
                    ,["Астрономия",0,27,29,2]
                    ,["Черчение",0,28,30,2]
                    ,["Музыка",0,29,31,2]
                    ,["Физкультура",0,30,32,2]
                    ,["Для дошколят",0,31,33,2]
                    ,["Энциклопедии",0,32,34,2]
                    ,["Атласы и карты",0,33,35,2]
                    ,["Законы и кодексы",0,34,36,2]
                    ,["Заметки",0,35,36,2]
                    ,["Беседы",0,37,38,3]
                    ,["Предложения/критика",0,37,39,3]
                    ,["Написать письмо",0,38,39,3]
                    ,["Инструкция по сайту",0,40,41,4]
                    ,["Донаты",0,40,42,4]
                    ,["Об авторе сайта",0,41,42,4]
                ]
                //----------------------------------------------------------------------------
                ,[//Настройки сайта
                    ['дизайн сайта',0,0,1,0]
                    ,['цвет элементов сайта',0,0,1,0]
                    ,['задний фон сайта',0,2,3,0]
                    ,['страницы сайта',0,2,3,0]

                    ,['меню сайта',0,4,5,0]
                    ,['панели с окнами',0,4,6,0]
                    ,['Смайлика',0,5,6,0]
                    

                    
                ]
            ]
            ,[//Чего новенького
                [],[],[]
                ,[
                    ['Люди-умельцы',0,0,1,0]
                    ,['Творческие работы',0,0,2,0]
                    ,['Обучение',0,1,3,0]
                    ,['Ответы на предложения',0,2,3,0]
                ]
            ]
            ,[//Люди-умельцы
                [
                    ['Все работы',0,0,1,0]
                    ,['Все уроки',0,0,2,0]
                    ,['Схемы и рисунки из интернета',0,1,3,0]
                    ,['Полезные советы',0,2,4,0]
                    ,['Личные фотографии и видео',0,3,4,0]
                    ,['Связаные мною куклы',0,5,6,1]
                    ,['Моя игра на гитаре',0,5,6,1]
                    ,['Обучение искуству вязания кукол',0,7,8,2]
                    ,['Обучение игре на гитаре',0,7,8,2]
                    ,['При вязании',0,9,9,4]
                    ,['Это я, любимая',0,10,11,5]
                    ,['С ребятами',0,10,12,5]
                    ,['На природе',0,11,12,5]
                ]
                ,[
                    
                    ['Все работы',0,0,1,0]
                    ,['Все уроки',0,0,3,0]
                    ,['',0,0,0,0]
                    ,['Полезные советы',0,1,4,0]
                    ,['Личные фотографии и видео',0,3,4,0]
                    ,['Незавершённые программируемые игры и сайт',0,5,6,1]
                    ,['Только планируемые компьютерные игры',0,5,7,1]
                    ,['Нарисованые картины',0,6,8,1]
                    ,['Связаные крючком и спицами дорожки, вещи, игрушки, композиции',0,7,9,1]
                    ,['С помощью валяния созданные игрушки и бижутерия',0,8,10,1]
                    ,['Плетёные из бисера брелки',0,9,11,1]
                    ,['Плетёные в технике фливоите вещицы',0,10,12,1]
                    ,['Плоды резьбы по дереву и сделанная мебель',0,11,12,1]
                ]
                ,[
                    
                    ['Все работы',0,0,3,0]
                    ,['',0,0,0,0]
                    ,['',0,0,0,0]
                    ,['Полезные советы',0,0,4,0]
                    ,['Личные фотографии и видео',0,3,4,0]
                    ,['Незавершённые программируемые игры и сайт',0,5,6,1]
                    ,['Только планируемые компьютерные игры',0,5,7,1]
                    ,['Нарисованые картины',0,6,8,1]
                    ,['Связаные крючком и спицами дорожки, вещи, игрушки, композиции',0,7,9,1]
                    ,['С помощью валяния созданные игрушки и бижутерия',0,8,10,1]
                    ,['Плетёные из бисера брелки',0,9,11,1]
                    ,['Плетёные в технике фливоите вещицы',0,10,12,1]
                    ,['Плоды резьбы по дереву и сделанная мебель',0,11,12,1]
                ]
            ],
            [//Творческие работы
                [],
                [
                    ['Рисование',0,0,1,0]
                    ,['Лепка скульптур',0,0,2,0]
                    ,['Созданее из метала',0,1,3,0]
                    ,['Резьба по дереву',0,2,4,0]
                    ,['Вязание',0,3,5,0]
                    ,['Воляние',0,4,6,0]
                    ,['Шитьё',0,5,7,0]
                    ,['Вышивка',0,6,8,0]
                    ,['Плетение',0,7,9,0]
                    ,['Литература',0,8,10,0]
                    ,['Музыка',0,9,11,0]
                    ,['Программирование',0,10,12,0]
                    ,['Электроника',0,11,12,0]
                ],[
                    ['Дизайн интеръера',0,0,1,0]
                    ,['Ковры и дорожки',0,0,2,0]
                    ,['Покрывала и седушки',0,1,3,0]
                    ,['Кухонная утварь',0,2,4,0]
                    ,['Мебель',0,3,5,0]
                    ,['Картины',0,4,6,0]
                    ,['Скульптуры',0,5,7,0]
                    ,['Часы',0,6,8,0]
                    ,['Светильники',0,7,9,0]
                    ,['Горшки и коробы',0,8,10,0]
                    ,['Бижутерии',0,9,11,0]
                    ,['Одежда',0,10,12,0]
                    ,['Обувь',0,11,13,0]
                    ,['Игрушки',0,12,14,0]
                    ,['Поделки',0,13,15,0]
                    ,['Книги',0,14,16,0]
                    ,['Для сада и огорода',0,15,17,0]
                    ,['Электронные приборы',0,16,18,0]
                    ,['Компьютерные программы',0,17,18,0]
                ]
            ]
        ],
        [
            [//Обучение от умельцев
                [],[],
                [
                    ['Рисование',0,0,1,0]
                    ,['Лепка скульптур',0,0,2,0]
                    ,['Созданее из метала',0,1,3,0]
                    ,['Резьба по дереву',0,2,4,0]
                    ,['Вязание',0,3,5,0]
                    ,['Воляние',0,4,6,0]
                    ,['Шитьё',0,5,7,0]
                    ,['Вышивка',0,6,8,0]
                    ,['Плетение',0,7,9,0]
                    ,['Литература',0,8,10,0]
                    ,['Музыка',0,9,11,0]
                    ,['Программирование',0,10,12,0]
                    ,['Электроника',0,11,12,0]
                ]
            ],[//Творчество
                [
                    
                    ['Рисование в карандаше',0,0,1,0]
                    ,['Рисование красками',0,0,2,0]
                    ,['Рисование сухой пастэлью',0,1,3,0]
                    ,['Рисование шерстью',0,2,4,0]
                    ,['Рисование нитками',0,3,5,0]
                    ,['Создание картин из ленточек',0,4,6,0]
                    ,['Создание картин с помощью квиллинга',0,5,6,0]
                    //-----------------------------------
                    //-----------------------------------
                    //Рисование в карандаше
                    ,['От автора Ильиной Людмилы',0,7,8,1]
                    ,['Первичная подготовка',0,7,9,1]
                    ,['Первые штрихи',0,8,10,1]
                    ,['Рисуем предметы',0,9,11,1]
                    ,['Рисуем растения',0,10,12,1]
                    ,['Рисуем животных',0,11,13,1]
                    ,['Рисуем людей',0,12,14,1]
                    ,['Рисуем портреты',0,13,15,1]
                    ,['Рисуем натюрморты',0,14,16,1]
                    ,['Рисуем пейзажи',0,15,17,1]
                    ,['Мои работы',0,16,18,1]
                    ,['Рисунки в карандаше у других художников',0,17,19,1]
                    ,['Рекомендуемые источники информации',0,18,19,1]
                    //-----------------------------------
                    //Рисование красками
                    ,['От автора Ильиной Людмилы',0,20,21,2]
                    ,['Выбор вида краски',0,20,22,2]
                    ,['Подготовка к рисованию',0,21,23,2]
                    ,['Создание эскиза',0,22,24,2]
                    ,['Первоначальные штрихи',0,23,25,2]
                    ,['Игра света и тени',0,24,26,2]
                    ,['Маленькие хитрости',0,25,27,2]
                    ,['Дорисовываем и поправляем фрагменты',0,26,28,2]
                    ,['Рисуем вместе разными красками',0,27,29,2]
                    ,['Мои работы',0,28,30,2]
                    ,['Работы других художников',0,29,31,2]
                    ,['Рекомендуемые источники информации',0,30,31,2]
                    //-----------------------------------
                    //Рисование сухой пастелью
                    ,['От автора Ильиной Людмилы',0,32,33,3]
                    ,['Необходимые материалы',0,32,34,3]
                    ,['Рисование эскиза',0,33,35,3]
                    ,['Придворительная подготовка',0,34,36,3]
                    ,['Нанесение цветной основы',0,35,37,3]
                    ,['Работа с лицами',0,36,38,3]
                    ,['Втирание света и тени',0,37,39,3]
                    ,['Завершающие штрихи',0,38,40,3]
                    ,['Мои работы',0,39,41,3]
                    ,['Работы с пастелью от других мастеров',0,40,42,3]
                    ,['Рекомендуемые источники информации',0,41,42,3]
                    //-----------------------------------
                    //Рисование шерстью
                    ,['От автора Ильиной Людмилы',0,43,44,4]
                    ,['Подготовка к работе',0,43,45,4]
                    ,['Важно помнить!',0,44,46,4]
                    ,['Виды укладывания шерсти',0,45,47,4]
                    ,['Нанесение эскиза',0,46,48,4]
                    ,['Нанесение красок как основы',0,47,49,4]
                    ,['Нанесение шерсти',0,48,50,4]
                    ,['Завершающие штрихи',0,49,51,4]
                    ,['Мои работы',0,50,52,4]
                    ,['Работы с шерстью у других кудесниц',0,51,53,4]
                    ,['Рекомендуемые источники информации',0,52,53,4]
                    //-----------------------------------
                    //Рисование нитками
                    ,['От автора Ильиной Людмилы',0,54,55,5]
                    ,['Психология человеческого глаза',0,54,56,5]
                    ,['Необходимые инструменты',0,55,57,5]
                    ,['Рисование нитками на полотне',0,56,58,5]
                    ,['Рисование предметов',0,57,59,5]
                    ,['Рисование цветов и растений',0,58,60,5]
                    ,['Рисование животных',0,59,61,5]
                    ,['Рисование людей',0,60,62,5]
                    ,['Первый этап в прорисовке картины',0,61,63,5]
                    ,['Завершение картины',0,62,64,5]
                    ,['Мои работы',0,63,65,5]
                    ,['Работы других художников',0,64,66,5]
                    ,['Рекомендуемые источники информации',0,65,66,5]
                    //-----------------------------------
                    //Рисование картин из ленточек
                    ,['От автора Ильиной Людмилы',0,67,68,6]
                    ,['Необходимый материал',0,67,69,6]
                    ,['Маленькие хитрости',0,68,70,6]
                    ,['Краски в помощь',0,69,71,6]
                    ,['Поиск вдохновения',0,70,72,6]
                    ,['Подготовка полотна',0,71,73,6]
                    ,['Создание картины',0,72,74,6]
                    ,['Комбинация материала в картинах',0,73,75,6]
                    ,['Мои работы',0,74,76,6]
                    ,['Картины с ленточками других кудесниц',0,75,77,6]
                    ,['Рекомендуемые источники информации',0,76,77,6]
                    //-----------------------------------
                    //Рисование картин с помощью квиллинга
                    ,['От автора Ильиной Людмилы',0,78,79,7]
                    ,['Что необходимо для работы',0,78,80,7]
                    ,['Работа с квиллингом',0,79,81,7]
                    ,['Создаём чудо',0,80,82,7]
                    ,['Мои работы',0,81,83,7]
                    ,['Картины других рукодельниц',0,82,84,7]
                    ,['Рекомендуемые источники информации',0,83,84,7]
                    //-----------------------------------
                    //-----------------------------------
                    //Рисование в карандаше
                    //-----------------------------------
                    //Первичная подготовка
                    ,['Необходимый инвентарь',0,85,86,9]
                    ,['Что нужно знать перед началом',0,85,87,9]
                    ,['Создание приблизительных контуров',0,86,88,9]
                    ,['Переход к форме',0,87,89,9]
                    ,['Создание перспектив',0,88,90,9]
                    ,['Штриховка и растушёвка',0,89,91,9]
                    ,['Созданее заднего фона теней',0,90,91,9]
                    //-----------------------------------
                    //Первые штрихи
                    ,['Рисуем набросок',0,92,93,10]
                    ,['Переходим от наброска к приблизительной форме',0,92,94,10]
                    ,['Игра со светом и тенью',0,93,95,10]
                    ,['Использование штрихов',0,94,96,10]
                    ,['Подключаем фантазию',0,95,97,10]
                    ,['Используем фотографии',0,96,97,10]
                    //-----------------------------------
                    //Рисуем предметы
                    ,['Рисование отдельных предметов',0,98,99,11]
                    ,['Груда книг',0,98,100,11]
                    ,['Стулья',0,99,101,11]
                    ,['Столы для письма',0,100,102,11]
                    ,['Лавочки',0,101,103,11]
                    ,['Машины',0,102,103,11]
                    //-----------------------------------
                    //Рисуем растения
                    ,['Рисование отдельных растений',0,104,105,12]
                    ,['Кувшинки',0,104,106,12]
                    ,['Кактусы',0,105,107,12]
                    ,['Сосновая шишка',0,106,108,12]
                    ,['Хмель',0,107,109,12]
                    ,['Крапива',0,108,110,12]
                    ,['Папоротники',0,109,111,12]
                    ,['Тюльпаны',0,110,112,12]
                    ,['Гвоздики',0,111,113,12]
                    ,['Лилии',0,112,114,12]
                    ,['Розы',0,113,115,12]
                    ,['Яблоки и груши',0,114,116,12]
                    ,['Вишня',0,115,117,12]
                    ,['Виноград',0,116,118,12]
                    ,['Арбуз',0,117,119,12]
                    ,['Клубника',0,118,120,12]
                    ,['Ананас',0,119,120,12]
                    //-----------------------------------
                    //Рисуем животных
                    ,['Рисование отдельных животных',0,121,122,13]
                    ,['Змей',0,121,123,13]
                    ,['Черепахи',0,122,124,13]
                    ,['Лошади',0,123,125,13]
                    ,['Свиньи',0,124,126,13]
                    ,['Крысы',0,125,127,13]
                    ,['Коты',0,126,128,13]
                    ,['Собаки',0,127,129,13]
                    ,['Морские свинки',0,128,130,13]
                    ,['Хорьки',0,129,131,13]
                    ,['Кролики',0,130,132,13]
                    ,['Шимпан',0,131,133,13]
                    ,['Голуби',0,132,134,13]
                    ,['Попугаи',0,133,135,13]
                    ,['Павлины',0,134,135,13]
                    //-----------------------------------
                    //Рисуем людей
                    ,['Особенности тела человека',0,136,137,14]
                    ,['Анатомия человека',0,136,138,14]
                    ,['Пропорции частей тела',0,137,139,14]
                    ,['Перспектива',0,138,140,14]
                    ,['Движение и равновесие',0,139,141,14]
                    ,['Волосы и причёска',0,140,142,14]
                    ,['Складки одежды',0,141,143,14]
                    ,['Дети в игре',0,142,144,14]
                    ,['Веселящиеся девушки',0,143,145,14]
                    ,['Балерины',0,144,146,14]  
                    ,['Акробаты',0,145,147,14]
                    ,['Мужчины',0,146,148,14]
                    ,['Спортсмены',0,147,149,14]
                    ,['Старики',0,148,149,14]
                    //-----------------------------------
                    //Рисуем портреты
                    ,['Композиция портрета',0,150,151,15]
                    ,['Освещение',0,150,152,15]
                    ,['Последовательность действий',0,151,153,15]
                    ,['Детские портреты',0,152,154,15]
                    ,['Портреты знаменитостей',0,153,155,15]
                    ,['Портреты учёных',0,154,155,15]
                    //-----------------------------------
                    //Рисуем натюрморты
                    ,['Расположение компонентов',0,156,157,16]
                    ,['Освещение композиции',0,156,158,16]
                    ,['Контраст текстур',0,157,159,16]
                    ,['Новогодний стол',0,158,160,16]
                    ,['Утренний чай',0,159,161,16]
                    ,['Предкушающий вечер',0,160,162,16]
                    ,['Милый букетик',0,161,162,16]
                    //-----------------------------------
                    //Рисуем пейзажи
                    ,['Выбор темы',0,163,164,17]
                    ,['Композиция пейзажа',0,163,165,17]
                    ,['Первые наброски',0,164,166,17]
                    ,['Отдельные пометки',0,165,167,17]
                    ,['Скалы и камни',0,166,168,17]
                    ,['Деревья и кусты',0,167,169,17]
                    ,['Строения с перспективой',0,168,170,17]
                    ,['Реки, поля, пустыни',0,169,171,17]
                    ,['Незабываем про игру света и тени',0,170,172,17]
                    ,['Контраст текстур',0,171,173,17]
                    ,['Включаем воображение',0,172,174,17]
                    ,['Возле реки',0,173,175,17]
                    ,['Прогулка по парку',0,174,176,17]
                    ,['Поляна голубей',0,175,177,17]
                    ,['Перед "Молодёжным центром"',0,176,177,17]
                    //-----------------------------------
                    //-----------------------------------
                    //Рисование красками
                    //-----------------------------------
                    //Выбор вида красок
                    ,['Общее понятие',0,178,179,21]
                    ,['Рисование гуашью',0,178,180,21]
                    ,['Акварель',0,179,181,21]
                    ,['Акриловые краски',0,180,182,21]
                    ,['Масляные краски',0,181,182,21]
                    //-----------------------------------
                    //Подготовка к рисованию
                    ,['Холст или бумага?',0,183,184,22]
                    ,['Выбор типа картины',0,183,185,22]
                    ,['Композиция картины',0,184,186,22]
                    ,['Использование фотографий',0,185,187,22]
                    ,['Умение проектировать объект в уме',0,186,188,22]
                    ,['Учимся сочетать фотографии и предметы',0,187,189,22]
                    ,['Подключаем воображение',0,188,189,22]
                    //-----------------------------------
                    //Создание эскиза
                    ,['Выбор материала для эскиза',0,190,191,23]
                    ,['Первоначальное нанесение решётки',0,190,192,23]
                    ,['Создание общего фона',0,191,193,23]
                    ,['Последующая прорисовка мелочей',0,192,193,23]
                    //-----------------------------------
                    //Первоначальные штрихи
                    ,['Различные типы покраски',0,194,195,24]
                    ,['Виды штриховки',0,194,196,24]
                    ,['Ориентация по главному объекту',0,195,197,24]
                    ,['Приблизительное закрашивание заднего фона',0,196,197,24]
                    
                    //-----------------------------------
                    //Игра света и тени
                    ,['Соблюдение правил бликования',0,198,199,25]
                    ,['Падение лучей света',0,198,200,25]
                    ,['Правильно лежащие тени',0,199,201,25]
                    ,['Контрастность',0,200,202,25]
                    ,['Ошибки при изнытке теней или света',0,201,202,25]
                    //-----------------------------------
                    //Маленькие хитрости
                    ,['Затимнение краёв',0,203,204,26]
                    ,['Осветлённый верх, затемнённый низ',0,203,205,26]
                    ,['Эфект размытости заднего фона',0,204,206,26]
                    ,['Невырозительные задние кружева',0,205,207,26]
                    ,['Прозрачные пузырьки',0,206,208,26]
                    ,['Радужный феерверк',0,207,209,26]
                    ,['Рисунок деревянного среза',0,208,210,26]
                    ,['Капельки воды',0,209,211,26]
                    ,['Снежинки',0,210,212,26]
                    ,['Снежная пурга',0,211,213,26]
                    ,['След неакуратной крупной кисти',0,212,214,26]
                    ,['Потрескавшийся цемент',0,213,215,26]
                    ,['Пористый материал',0,214,216,26]
                    ,['Извилистый шёлк',0,215,217,26]
                    ,['Рисованные персонажи',0,216,218,26]
                    ,['Зелень с краёв',0,217,219,26]
                    ,['Цветочный фон',0,218,220,26]
                    ,['Денежный фон',0,219,220,26]
                    //-----------------------------------
                    //Дорисовываем и попровляем фрагменты
                    ,['Растушёвка неправельных границ или линий',0,221,222,27]
                    ,['Повышение чёткости линий границ',0,221,223,27]
                    ,['Закраска мелких деталей',0,222,223,27]
                    //-----------------------------------
                    //Рисуем вместе с разными красками
                    ,['Портреты гуашью',0,224,225,28]
                    ,['Портреты акварелью',0,224,226,28]
                    ,['Портреты акрилом',0,225,227,28]
                    ,['Портреты маслом',0,226,228,28]
                    ,['Натюрморты гуашью',0,227,229,28]
                    ,['Натюрморты акварелью',0,228,230,28]
                    ,['Натюрморты акрилом',0,229,231,28]
                    ,['Натюрморты маслом',0,230,232,28]
                    ,['Пейзажи гуашью',0,231,233,28]
                    ,['Пейзажи акварелью',0,232,234,28]
                    ,['Пейзажи акрилом',0,233,235,28]
                    ,['Пейзажи маслом',0,234,235,28]
                    //-----------------------------------
                    //-----------------------------------
                    //Рисование сухой пастэлью
                    //-----------------------------------
                    //Рисование эскиза
                    ,['Выбор средства для наброска',0,236,237,34]
                    ,['Поменьше линий',0,236,238,34]
                    ,['Общий вид картины',0,237,238,34]
                    //-----------------------------------
                    //Нанесение цветной основы
                    ,['Типы нанесений',0,239,240,36]
                    ,['Оформление заднего фона',0,239,241,36]
                    ,['Перемешивание цветов',0,240,241,36]
                    //-----------------------------------
                    //Работа с лицами
                    ,['Внешний и внутрений контур',0,242,243,37]
                    ,['Ограничение при растирании',0,242,243,37]
                    //-----------------------------------
                    //Втирание цвета и тени
                    ,['Оттенки',0,244,245,38]
                    ,['Придание объёма',0,244,246,38]
                    ,['Оживление картины',0,245,246,38]
                    //-----------------------------------
                    //-----------------------------------
                    //Рисование шерстью
                    //-----------------------------------
                    //Виды укладывания шерсти
                    ,['Простое',0,247,248,46]
                    ,['Круговое',0,247,249,46]
                    ,['Змейкообразное',0,248,250,46]
                    ,['Перекрученное',0,249,251,46]
                    ,['Шахмотообразное',0,250,252,46]
                    ,['Плетёное',0,251,253,46]
                    ,['Стволы деревьев',0,252,254,46]
                    ,['Листва на деревьях',0,253,255,46]
                    ,['Солнце',0,254,256,46]
                    ,['Небо',0,255,257,46]
                    ,['Луга',0,256,258,46]
                    ,['Комок шерсти',0,257,259,46]
                    ,['Развивающиеся волосы',0,258,260,46]
                    ,['Прически',0,259,260,46]
                    //-----------------------------------
                    //Нанесение красок как основы
                    ,['Использование красок',0,261,262,48]
                    ,['Не переборщите',0,261,262,48]
                    //-----------------------------------
                    //Нанесение шерсти
                    ,['Первоначальное прикладывание',0,263,264,49]
                    ,['Использование клея',0,263,265,49]
                    ,['Начальное оформление заднего фона',0,264,266,49]
                    ,['Приклеивание второстепенных деталей',0,265,267,49]
                    ,['Приклеивание первостепенных деталей',0,266,267,49]
                    //-----------------------------------
                    //Завершающие штрихи
                    ,['Осмотр картины в целом',0,268,269,50]
                    ,['Подклеивание отдельных мест',0,268,270,50]
                    ,['Использование различных нешерстяных деталей',0,269,270,50]
                    //-----------------------------------
                    //-----------------------------------
                    //Рисование нитками
                    //-----------------------------------
                    //Рисование нитками на полотне
                    ,['Разновидности видов',0,271,272,57]
                    ,['Круговое',0,271,273,57]
                    ,['Квадратом и ромбом',0,272,274,57]
                    ,['Змейкой',0,273,275,57]
                    ,['Перекрученное',0,274,276,57]
                    ,['Плетёное',0,275,277,57]
                    ,['Шахмотное',0,276,278,57]
                    ,['Вразнобой',0,277,279,57]
                    ,['В несколько слоёв',0,278,280,57]
                    ,['Создание элюзии объёмности',0,279,280,57]
                    //-----------------------------------
                    //Рисование предметов
                    ,['Об изображении предметов',0,281,282,58]
                    ,['Шкафы',0,281,283,58]
                    ,['Столы',0,282,284,58]
                    ,['Кровати',0,283,285,58]
                    ,['Лавочки',0,284,286,58]
                    ,['Машины',0,285,287,58]
                    ,['Столбы',0,286,287,58]
                    //-----------------------------------
                    //Рисование цветов и растений
                    ,['Об изображении цветов и растений',0,288,289,59]
                    ,['Деревья',0,288,290,59]
                    ,['Кустарники',0,289,291,59]
                    ,['Цветы',0,290,292,59]
                    ,['Листва',0,291,293,59]
                    ,['Луга и поля',0,292,293,59]

                    //-----------------------------------
                    //Рисование животных
                    ,['Об изображении животных',0,294,295,60]
                    ,['Кошки',0,294,296,60]
                    ,['Собаки',0,295,297,60]
                    ,['Домашняя птица',0,296,298,60]
                    ,['Свиньи',0,297,299,60]
                    ,['Лошади',0,298,300,60]
                    ,['Верблюды',0,299,301,60]
                    ,['Слоны',0,300,301,60]
                    //-----------------------------------
                    //Рисование людей
                    ,['Об изображении людей',0,302,303,61]
                    ,['Дети',0,302,304,61]
                    ,['Женщины',0,303,305,61]
                    ,['Мужчины',0,304,306,61]
                    ,['Старики',0,305,306,61]
                    //-----------------------------------
                    //Первые этапы в прорисовки картины
                    ,['Выбор места и действия',0,307,308,62]
                    ,['Слабый набросок в карандаше',0,307,309,62]
                    ,['Подбор ниток',0,308,310,62]
                    ,['Выбор клея',0,309,311,62]
                    ,['Наносим краску для обмана зрения',0,310,312,62]
                    ,['Проклеиваем нитки для создания общего фона',0,311,313,62]
                    ,['Приклеиваем мелкие детали',0,312,313,62]
                    //-----------------------------------
                    //Завершение картины
                    ,['Осматриваем картину в целом',0,314,315,63]
                    ,['Подклеиваем отходящие нитки',0,314,316,63]
                    ,['Прячем и убираем края ниток',0,315,317,63]
                    ,['Дополняем картину разной бежутерией',0,316,317,63]
                    //-----------------------------------
                    //-----------------------------------
                    //Создание картин из ленточек
                    //-----------------------------------
                    //Маленькие хитрости
                    ,['О ленточках',0,318,319,69]
                    ,['Закручевание',0,318,320,69]
                    ,['Вязка',0,319,321,69]
                    ,['Шипы',0,320,322,69]
                    ,['Складки',0,321,323,69]
                    ,['Выступы',0,322,324,69]
                    ,['Шахмотообразное',0,323,325,69]
                    ,['Плетёное',0,324,325,69]
                    //-----------------------------------
                    //Краски в помощь
                    ,['Выбор краски',0,326,327,70]
                    ,['Общий фон',0,326,328,70]
                    ,['Отдельные фрагменты',0,327,328,70]
                    //-----------------------------------
                    //Поиск вдохновения
                    ,['Просматривание картинок, фото',0,329,330,71]
                    ,['Поиск сюжета',0,329,331,71]
                    ,['Включаем воображение',0,330,332,71]
                    ,['Рисование набросков',0,331,332,71]
                    //-----------------------------------
                    //Подготовка полотна
                    ,['Выбор материала',0,333,334,72]
                    ,['Без лишней живности',0,333,335,72]
                    ,['Создание эскиза',0,334,335,72]
                    //-----------------------------------
                    //Создание картины
                    ,['Создание основного фона',0,336,337,73]
                    ,['Приклеивание крупных деталей',0,336,338,73]
                    ,['Переключаемся на мелкие детали',0,337,339,73]
                    ,['Проверяем картину в целом и подклеиваем отстающие детали',0,338,339,73]
                    //-----------------------------------
                    //Комбинация материала в картинах
                    ,['С нитками и бижютерией',0,340,341,74]
                    ,['С другими мотериалами',0,340,341,74]
                    //-----------------------------------
                    //-----------------------------------
                    //Создание картин с помощью квиллинга
                    //-----------------------------------
                    //Работа с квиллингом
                    ,['Общий обзор',0,342,343,80]
                    ,['Кружoчек',0,342,344,80]
                    ,['Капелька',0,343,345,80]
                    ,['Глазик',0,344,346,80]
                    ,['Узор',0,345,346,80]
                    //-----------------------------------
                    //Создаём чудо
                    ,['Делаем приблезительный эскиз',0,347,348,81]
                    ,['Приклеиваем детали из загатовок',0,347,349,81]
                    ,['Проверяем общее состояние картины',0,348,349,81]
                    //-----------------------------------
                    //-----------------------------------
                    //-----------------------------------
                    //Рисуем в карандаше
                    //-----------------------------------
                    //Анатомия человека
                    ,['Скелет',0,350,351,137]
                    ,['Мышцы',0,350,351,137]
                    //-----------------------------------
                    //Пропорции частей тела
                    ,['Общии прошорции у мужчин, женщин и Детей',0,352,353,138]
                    ,['Корпус',0,352,354,138]
                    ,['Нога',0,353,355,138]
                    ,['Рука' ,0,354,356,138]
                    ,['Голова',0,355,357,138]
                    ,['Глаза',0,356,358,138]
                    ,['Нос',0,357,359,138]
                    ,['Губы',0,358,360,138]
                    ,['Уши' ,0,359,360,138]
                ]
                ,[
                    
                    ['Лепка из глины и гипса',0,0,1,0]
                    ,['Лепка из полимерного пластилина',0,0,2,0]
                    ,['Лепка из папье-маше',0,1,3,0]
                    ,['Лепка из ваты',0,2,4,0]
                    ,['Создание фигурок из фоамирана',0,3,4,0]
                    //-----------------------------------
                    //Лепка из глины и гипса
                    ,['От автора Ильиной Людмилы',0,5,6,1]
                    ,['Подготовка к лепке',0,5,7,1]
                    ,['Выбор материала лепки',0,6,8,1]
                    ,['Зарисовка модели лепки или фотография с образа',0,7,9,1]
                    ,['Процесс создания формы',0,8,10,1]
                    ,['Проризание мелких деталей',0,9,11,1]
                    ,['Покраска форм изделия',0,10,12,1]
                    ,['Запекание в духовке',0,11,13,1]
                    ,['Последнии штрихи',0,12,14,1]
                    ,['Создание композиций',0,13,15,1]
                    ,['Мои работы',0,14,16,1]
                    ,['Работы скульпторов',0,15,17,1]
                    ,['Рекомендуемые источники информации',0,16,17,1]
                    //-----------------------------------
                    //Лепка из полимерного пластилина
                    ,['От автора Ильиной Людмилы',0,18,19,2]
                    ,['Подготовка перед лепкой',0,18,20,2]
                    ,['Фото образа или рисование модели лепки',0,19,21,2]
                    ,['Создание разных деталей формы',0,20,22,2]
                    ,['Скрепление деталей',0,21,23,2]
                    ,['Прорезание мелких элементов',0,22,24,2]
                    ,['Покраска для оттенения деталей',0,23,25,2]
                    ,['Исправление недочётов',0,24,26,2]
                    ,['Возможно ли запекать в духовке?',0,25,27,2]
                    ,['Создание композиций',0,26,28,2]
                    ,['Мои работы',0,27,29,2]
                    ,['Работы мастеров',0,28,30,2]
                    ,['Рекомендуемые источники информации',0,29,30,2]
                    //-----------------------------------
                    //Лепка из папье-маше
                    ,['От автора Ильиной Людмилы',0,31,32,3]
                    ,['Подготовка материала',0,31,33,3]
                    ,['Фото или зарисовка модели лепки',0,32,34,3]
                    ,['Создание чучела для обклеивания',0,33,35,3]
                    ,['Смешивание компонентов',0,34,36,3]
                    ,['Первоначальная поклейка',0,35,37,3]
                    ,['Второй этап поклейки',0,36,38,3]
                    ,['Необязательная шлефовка',0,37,39,3]
                    ,['Покраска готового изделия',0,38,40,3]
                    ,['Создание композиций',0,39,41,3]
                    ,['Мои работы',0,40,42,3]
                    ,['Работы мастеров',0,41,43,3]
                    ,['Рекомендуемые источники информации',0,42,43,3]
                    //-----------------------------------
                    //Лепка из ваты
                    ,['От автора Ильиной Людмилы',0,44,45,4]
                    ,['Подготовка материала',0,44,46,4]
                    ,['Фото или зарисовка модели лепки',0,45,47,4]
                    ,['Создание начального чучела',0,46,48,4]                    
                    ,['Склеивание ваты',0,47,49,4]
                    ,['Второй этап склеивания',0,48,50,4]
                    ,['Исправление недочётов',0,49,51,4]
                    ,['Покраска готового изделия',0,50,52,4]
                    ,['Создание композиций',0,51,53,4]
                    ,['Мои работы',0,52,54,4]
                    ,['Работы мастеров',0,53,55,4]
                    ,['Рекомендуемые источники информации',0,54,55,4]
                    //-----------------------------------
                    //Создание фигурок из фоамирана
                    ,['От автора Ильиной Людмилы',0,56,57,5]
                    ,['Необходимый инвентарь',0,56,58,5]
                    ,['Фото или зарисовка фигурки',0,57,59,5]
                    ,['Объёмность фигурки',0,58,60,5]
                    ,['Вырезание деталей по образцу',0,59,61,5]
                    ,['Приклеивание деталей',0,60,62,5]
                    ,['Покраска и лакировка фигурки',0,61,63,5]
                    ,['Созданиём вместе',0,62,64,5]
                    ,['Создание композиций',0,63,65,5]
                    ,['Мои работы',0,64,66,5]
                    ,['Работы мастеров',0,65,67,5]
                    ,['Рекомендуемые источники информации',0,66,67,5]
                    //-----------------------------------
                    //-----------------------------------
                    //-----------------------------------
                    //Лепка из глины и гипса
                    //-----------------------------------
                    //Выбор материала лепки
                    ,['']
                    //-----------------------------------
                    //
                    //-----------------------------------
                    //
                    //-----------------------------------
                    //
                    //-----------------------------------
                    //
                    //-----------------------------------
                    //
                    //-----------------------------------
                    //
                    //-----------------------------------
                    //-----------------------------------
                    //-----------------------------------
                    //Лепка из полимерного пластилина
                    //-----------------------------------
                    //
                    //-----------------------------------
                    //
                    //-----------------------------------
                    //
                    //-----------------------------------
                    //
                    //-----------------------------------
                    //
                    //-----------------------------------
                    //
                    //-----------------------------------
                    //
                    //-----------------------------------
                    //-----------------------------------
                    //-----------------------------------
                    //Лепка из папье-маше
                    //-----------------------------------
                    //
                    //-----------------------------------
                    //
                    //-----------------------------------
                    //
                    //-----------------------------------
                    //
                    //-----------------------------------
                    //
                    //-----------------------------------
                    //
                    //-----------------------------------
                    //
                    //-----------------------------------
                    //-----------------------------------
                    //-----------------------------------
                    //Лепка из ваты
                    //-----------------------------------
                    //
                    //-----------------------------------
                    //
                    //-----------------------------------
                    //
                    //-----------------------------------
                    //
                    //-----------------------------------
                    //
                    //-----------------------------------
                    //
                    //-----------------------------------
                    //
                    //-----------------------------------
                    //-----------------------------------
                    //-----------------------------------
                    //Создание фигурок из фоамирана
                ]
                ,[
                    
                    ['Вязание крючком',0,0,1,0]
                    ,['Вязание спицами',0,0,2,0]
                    ,['Вязание в технике Фливоите',0,1,3,0]
                    ,['Комбинированое вязание',0,2,3,0]
                    //-----------------------------------
                    //Вязание крючком
                    ,['От автора Ильиной Людмилы',0,4,5,1]
                    ,['Подготовка материала для вязки',0,4,6,1]
                    ,['Начальные навыки',0,5,7,1]
                    ,['Условные обозначения',0,6,8,1]
                    ,['Применение обозначений на практике',0,7,9,1]
                    ,['Как вязать по схемам',0,8,10,1]
                    ,['Виды вязания для крючка',0,9,11,1]
                    ,['Изученные и используемые мною виды',0,10,12,1]
                    ,['Коллекция схем для вязания',0,11,13,1]
                    ,['Маленькие хитрости',0,12,14,1]
                    ,['Свяжем вместе',0,13,15,1]
                    ,['Мои работы',0,14,16,1]
                    ,['Работы вязальщиц',0,15,17,1]
                    ,['Рекомендуемые источники информации',0,16,17,1]                    
                    //-----------------------------------
                    //Вязание спицами
                    ,['От автора Ильиной Людмилы',0,18,19,2]
                    ,['Подготовка материала для вязки',0,18,20,2]
                    ,['Начальные навыки',0,19,21,2]
                    ,['Условные обозначения',0,20,22,2]
                    ,['Применение обозначений на практике',0,21,23,2]
                    ,['Как вязать по схемам',0,22,24,2]
                    ,['Коллекция схем для вязания',0,23,25,2]
                    ,['Маленькие хитрости',0,24,26,2]
                    ,['Свяжем вместе',0,25,27,2]
                    ,['Мои работы',0,26,28,2]
                    ,['Работы вязальщиц',0,27,29,2]
                    ,['Рекомендуемые источники информации',0,28,29,2]                    
                    //-----------------------------------
                    //Вязание в технике Фливоите
                    ,['От автора Ильиной Людмилы',0,30,31,3]
                    ,['Подготовка материала для вязки',0,30,32,3]
                    ,['Основы плетения',0,31,33,3]
                    ,['Условные обозначения',0,32,34,3]
                    ,['Применение обозначений на практике',0,33,35,3]
                    ,['Как вязать по схемам',0,34,36,3]
                    ,['Коллекция схем для вязания',0,35,37,3]
                    ,['Вязание с бисером',0,36,38,3]
                    ,['Свяжем вместе',0,37,39,3]
                    ,['Мои работы',0,38,40,3]
                    ,['Работы вязальщиц',0,39,41,3]
                    ,['Рекомендуемые источники информации',0,40,41,3]                    
                    //-----------------------------------
                    //Комбинированое вязание
                    ,['От автора Ильиной Людмилы',0,42,43,4]
                    ,['Подготовка материала для вязки',0,42,44,4]
                    ,['Вязание крючком по связаному спицами',0,43,45,4]
                    ,['Вставка элемента фливоите в вязанные крючком или спицами вещи',0,44,46,4]
                    ,['Свяжем вместе',0,45,47,4]
                    ,['Мои работы',0,46,48,4]
                    ,['Работы вязальщиц',0,47,49,4]
                    ,['Рекомендуемые источники информации',0,48,49,4]
                    //-----------------------------------
                    //-----------------------------------
                    //-----------------------------------
                    //Вязание крючком
                    //-----------------------------------
                    //Свяжем вместе
                    ,['Свяжем кружевные салфетки',0,0,0,14]
                    ,['Свяжем салфетки с цветными рисунками',0,0,0,14]
                    ,['Свяжем по тунисской технике головные уборы',0,0,0,14]
                    ,['Свяжем филейной техникой летние накидки',0,0,0,14]
                    ,['Свяжем детские игрушки',0,0,0,14]
                    ,['Свяжем корзины и коробки',0,0,0,14]
                    ,['Свяжем ковры обычные',0,0,0,14]
                    ,['Свяжем ковры рельефные',0,0,0,14]
                    //-----------------------------------
                    //-----------------------------------
                    //-----------------------------------
                    //Вязание спицами
                    //-----------------------------------
                    //Свяжем вместе
                    ,['Свяжем шарф',0,0,0,26]
                    ,['Свяжем носочки',0,0,0,26]
                    ,['Свяжем варежки',0,0,0,26]
                    ,['Свяжем шапку',0,0,0,26]
                    ,['Свяжем накидку с узором',0,0,0,26]
                    ,['Свяжем свитер с узором',0,0,0,26]
                    ,['Свяжем свитер с цветным узором',0,0,0,26]
                    ,['Свяжем одежду для кукол' ,0,0,0,26]
                    //-----------------------------------
                    //-----------------------------------
                    //-----------------------------------
                    //Вязание в технике Фливоите
                    //-----------------------------------
                    //Свяжем вместе
                    ,['Свяжем кружевные салфетки',0,0,0,36]
                    ,['Свяжем салфетки с цветными рисунками',0,0,0,36]
                    ,['Свяжем ажурные вороты',0,0,0,36]
                    ,['Свяжем медальончик с бисером',0,0,0,36]
                    ,['Свяжем кружевную вставку',0,0,0,36]
                    
                ]
                ,[
                    
                    ['Сухое валяние',0,0,1,0]
                    ,['Мокрое валяние',0,0,2,0]
                    ,['Комбинированое валяние',0,1,2,0]
                    //-----------------------------------
                    //Сухое валяние
                    ,['От автора Ильиной Людмилы',0,3,4,1]
                    ,['Подготовка к работе',0,3,5,1]
                    ,['Краски в помощь',0,4,6,1]
                    ,['Сухое валяние плоских форм',0,5,7,1]
                    ,['Сухое валяние объёмных форм',0,6,8,1]
                    ,['Сваляем вместе',0,7,9,1]
                    ,['Финальные шкрихи',0,8,10,1]
                    ,['Мои работы',0,9,11,1]
                    ,['Работы рукодельниц',0,10,12,1]
                    ,['Рекомендуемые источники информации',0,11,12,1]
                    //-----------------------------------
                    //Мокрое валяние
                    ,['От автора Ильиной Людмилы',0,13,14,2]
                    ,['Подготовка к работе',0,13,15,2]
                    ,['Краски в помощь',0,14,16,2]
                    ,['Особенности мокрого валяния',0,15,17,2]
                    ,['Сваляем вместе',0,16,18,2]
                    ,['Финальные шкрихи',0,17,19,2]
                    ,['Мои работы',0,18,20,2]
                    ,['Работы рукодельниц',0,19,21,2]
                    ,['Рекомендуемые источники информации',0,20,21,2]
                    //-----------------------------------
                    //Комбинированое валяние
                    ,['От автора Ильиной Людмилы',0,22,23,3]
                    ,['Подготовка к работе',0,22,24,3]
                    ,['Комбинация с вязаными вещами',0,23,25,3]
                    ,['Комбинация с бисером',0,24,26,3]
                    ,['Комбинация с бижютерией',0,25,27,3]
                    ,['Сваляем вместе',0,26,28,3]
                    ,['Мои работы',0,27,29,3]
                    ,['Работы рукодельниц',0,28,30,3]
                    ,['Рекомендуемые источники информации',0,29,30,3]
                ]
                ,[
                    ['Вышивка нитками',0,0,1,0]
                    ,['Вышивка лентами',0,0,2,0]
                    ,['Создание чюлочных игрушек',0,1,3,0]
                    ,['Шитьё книжек и настольных игрушек для малышей',0,2,4,0]
                    ,['Комбинированая вышивка',0,3,4,0]
                    //-----------------------------------
                    //Вышивка нитками
                    ,['От автора Ильиной Людмилы',0,5,6,1]
                    ,['Подготовка материала для вышивки',0,5,7,1]
                    ,['Условные обозначения',0,6,8,1]
                    ,['Разновидности вышивки нитками',0,7,9,1]
                    ,['Разновидности швов',0,8,10,1]
                    ,['Создание заготовки',0,9,11,1]
                    ,['Выбор техники создания швов',0,10,12,1]
                    ,['Вышивка с применением бисера',0,11,13,1]
                    ,['Объемная вышивка',0,12,14,1]
                    ,['Вышьем вместе',0,13,15,1]
                    ,['Мои работы',0,14,16,1]
                    ,['Работы вышивальщиц',0,15,17,1]
                    ,['Рекомендуемые источники информации',0,16,17,1]
                    //-----------------------------------
                    //Вышивка лентами
                    ,['От автора Ильиной Людмилы',0,18,19,2]
                    ,['Подготовка материала для вышивки',0,18,20,2]
                    ,['Условные обозначения',0,19,21,2]
                    ,['Необходимые навыки',0,20,22,2]
                    ,['Создание заготовки',0,21,23,2]
                    ,['Краски в помощь',0,22,24,2]
                    ,['Вышивка с применением бисера',0,23,25,2]
                    ,['Вышьем вместе',0,24,26,2]
                    ,['Мои работы',0,25,27,2]
                    ,['Работы вышивальщиц',0,26,28,2]
                    ,['Рекомендуемые источники информации',0,27,28,2]
                    //-----------------------------------
                    //Создание чюлочных игрушек
                    ,['От автора Ильиной Людмилы',0,29,30,3]
                    ,['Подготовка к созданию игрушки',0,29,31,3]
                    ,['Создание чучела',0,30,32,3]
                    ,['Создание частей тела',0,31,33,3]
                    ,['Подготовка одежды и другой утвари',0,32,34,3]
                    ,['Краски в помощь',0,33,35,3]
                    ,['Создание композиции',0,34,36,3]
                    ,['Сделаем вместе',0,35,37,3]
                    ,['Мои работы',0,36,38,3]
                    ,['Работы рукодельниц',0,37,39,3]
                    ,['Рекомендуемые источники информации',0,38,39,3]
                    //-----------------------------------
                    //Шитьё книжек и настольных игрушек для малышей
                    ,['От автора Ильиной Людмилы',0,40,41,4]
                    ,['Подготовка к работе',0,40,42,4]
                    ,['Подбор персонажей и места действия',0,41,43,4]
                    ,['Создание страниц книжки',0,42,44,4]
                    ,['Создание кусочка игры',0,43,45,4]
                    ,['Краски в помощь',0,44,46,4]
                    ,['Окончание работы',0,45,47,4]
                    ,['Сделаем вместе',0,46,48,4]
                    ,['Мои работы',0,47,49,4]
                    ,['Работы рукодельниц',0,48,50,4]
                    ,['Рекомендуемые источники информации',0,49,50,4]
                    //-----------------------------------
                    //Комбинированая вышивка
                    ,['От автора Ильиной Людмилы',0,51,52,5]
                    ,['Вышивка на игрушке',0,51,53,5]
                    ,['Вышивка в книжке',0,52,54,5]
                    ,['Вышивка на вязаной вещи',0,53,55,5]
                    ,['Вышивка вместе с валянием',0,54,56,5]
                    ,['Валяние на игрушке',0,55,57,5]
                    ,['Вышьем вместе',0,56,58,5]
                    ,['Мои работы',0,57,59,5]
                    ,['Работы вышивальщиц',0,58,60,5]
                    ,['Рекомендуемые источники информации',0,59,60,5]
                ]
                ,[
                    ['Плетение из ниток',0,0,1,0]
                    ,['Плетение из бумажной лозы',0,0,2,0]
                    ,['Бисероплетение',0,1,2,0]
                    //-----------------------------------
                    //Плетение из ниток
                    //-----------------------------------
                    //Плетение из бумажной лозы
                    //-----------------------------------
                    //Бисероплетение
                ]
                ,[
                    ['Плоскорельефная резьба по дереву',0,0,1,0]
                    ,['Вырезание фигур из дерева',0,0,2,0]
                    ,['Выжигание по дереву',0,1,3,0]
                    ,['Изготовление мебели',0,2,3,0]
                    //-----------------------------------
                    //Плоскорельефная резьба по дереву
                    //-----------------------------------
                    //Вырезание фигур из дерева
                    //-----------------------------------
                    //Выжигание по дереву
                    //-----------------------------------
                    //Изготовление мебели
                ]
            ],[//Информатика
                [
                    ['Школьный курс информатики',0,0,1,0]
                    ,['Шпоргалки',0,0,2,0]
                    ,['Подготовка к контрольным и ЕГЭ',0,1,2,0]
                    //-----------------------------------
                    //Школьный курс информатики
                    ,['Информационные процессы',0,3,4,1]
                    ,['Компьютерные технологии (КТ)',0,3,5,1]
                    ,['Алгоритмы и программирование',0,4,6,1]
                    ,['Информационная деятельность',0,5,6,1]
                    //-----------------------------------
                    //Шпоргалки
                    ,['Системы счисления',0,7,8,2]
                    ,['',0,,]
                    ,['',0,,]
                    //-----------------------------------
                    //Подготовка к контрольным и ЕГЭ
                ]
                ,[
                    ['Paint - редактор точечного изображения',0,0,1,0]
                    ,['PhotoShop - редактор изображения',0,0,2,0]
                    ,['Видео редактор',0,1,2,0]
                ]
                ,[   
                    ['Microsoft Word - создание документов с проверкой на ошибки',0,0,1,0]
                    ,['Microsoft Exel - создание таблиц с итоговым вычислением по заданным формулам',0,0,1,0]
                ]
                ,[
                    ['Стандартная работа с операционной системой для начинающих',0,0,1,0]
                    ,['Командная строка для Windows',0,0,1,0]
                ]
                ,[    
                    ['Домен, хостинг, репозиторий - то, что нужно для размещения Web-сайта в интернете',0,0,1,0]
                    ,['.md документ',0,0,2,0]
                    ,['git - мини-файловая система контроля версиями необходимая для репозитория',0,1,2,0]
                ]
                ,[
                    ['CSS - каскадные таблицы стилей',0,0,1,0]
                    ,['HTML - язык создания Web-страниц',0,0,2,0]
                    ,['JavaScript - мультифункциональный язык для Web-разработчиков',0,1,3,0]
                    ,['Basic - простой язык разработки маленьких программ',0,2,4,0]
                    ,['Pascal - более сложный язык разработки маленьких программ',0,3,5,0]
                    ,['Delphi - язык программирования, основанный на Pascal, но уже устаревший',0,4,6,0]
                    ,['C++ и C# - достаточно сложный язык программирования больших проектов высокого уровня',0,5,7,0]
                    ,['Assembler - очень простой и, в то же время, невероятно сложный язык программирования низкого уровня',0,6,7,0]
                ]
                ,[
                    ['Основы криптографии или шифрования',0,0,1,0]
                    ,['Кодирование данных',0,0,1,0]
                ],
            ],
            [//Алгебра и Геометрия
                [
                    ['Содержание',0,0,1,0]
                    ,['Шпоргалки',0,0,2,0]
                    ,['Подготовка к  контрольным и ЕГЭ',0,1,2,0]
                ]
                ,[
                    ['Содержание',0,0,1,0]
                    ,['Шпоргалки',0,0,2,0]
                    ,['Подготовка к контрольным и ЕГЭ',0,1,2,0]
                ]
                ,[
                    ['Содержание',0,0,1,0]
                    ,['Шпоргалки',0,0,1,0]
                ]
                ,[
                    ['Содержание',0,0,1,0]
                    ,['Шпоргалки',0,0,1,0]
                ]
            ],
            [//Физика
                [
                    ['Содержание',0,0,1,0]
                    ,['Шпоргалки',0,0,2,0]
                    ,['Подготовка к контрольным и ЕГЭ',0,1,2,0]
                ]
                ,[
                    ['Содержание',0,0,1,0]
                    ,['Шпоргалки',0,0,1,0]
                ]
                ,[
                    ['Содержание',0,0,1,0]
                    ,['Шпоргалки',0,0,1,0]
                ]
            ],
            [//Химия
                [
                    ['Содержание',0,0,1,0]
                    ,['Шпоргалки',0,0,2,0]
                    ,['Подготовка к контрольным и ЕГЭ',0,1,2,0]
                ]
                ,[
                    ['Содержание',0,0,1,0]
                    ,['Шпоргалки',0,0,2,0]
                    ,['Подготовка к контрольным и ЕГЭ',0,1,2,0]
                ]
                ,[
                    ['Таблица Менделеева',0,0,1,0]
                    ,['Ряд напряжений металов',0,0,2,0]
                    ,['Контакт с водой и цвет осадка',0,1,3,0]
                    ,['Окрас индикаторов',0,2,4,0]
                    ,['Качественные реакции на катионы и анионы',0,3,5,0]
                    ,['Качественные реакции на органику',0,4,6,0]
                    ,['Углеводороды',0,5,7,0]
                    ,['Углеводородные радикалы',0,6,8,0]
                    ,['Функциональные производные углеводородов',0,7,9,0]
                    ,['Генетическая связь органических соединений',0,8,10,0]
                    ,['Распознавание волокон',0,9,11,0]
                    ,['Распознавание полимеров',0,10,11,0]
                ]
            ],
            [//Биология
                [
                    ['Содержание',0,0,1,0]
                    ,['Шпоргалки',0,0,2,0]
                    ,['Подготовка к контрольным и ЕГЭ',0,1,2,0]
                ]
                ,[
                    ['Содержание',0,0,1,0]
                    ,['Шпоргалки',0,0,1,0]
                ]
                ,[
                    ['Условные обозначения',0,0,1,0]
                    ,['Атлас строения',0,0,2,0]
                    ,['Атлас заболеваний человека',0,1,2,0]
                ]
                ,[
                    ['Насекомые',0,0,1,0]
                    ,['Животные',0,0,2,0]
                    ,['Растения',0,1,3,0]
                    ,['Вирусы и бактерии',0,2,3,0]
                ]
            ],
            [//История
                [
                    ['Содержание',0,0,1,0]
                    ,['Шпоргалки',0,0,2,0]
                    ,['Подготовка к контрольным и ЕГЭ',0,1,2,0]
                ]
               ,[
                    ['Содержание',0,0,1,0]
                    ,['Шпоргалки',0,0,2,0]
                    ,['Подготовка к контрольным и ЕГЭ',0,1,2,0]
                ]
                ,[
                    ['Содержание',0,0,1,0]
                    ,['Шпоргалки',0,0,1,0]
                ]
                ,[
                    ['Содержание',0,0,1,0]
                    ,['Шпоргалки',0,0,1,0]
                ]
                ,[
                    ['Условные обозначения',0,0,1,0]
                    ,['Исторический атлас',0,0,2,0]
                    ,['Исторические карты',0,1,3,0]
                    ,['Карты сражений',0,2,3,0]
                ]
            ],
            [//География
                [
                    ['Содержание',0,0,1,0]
                    ,['Шпоргалки',0,0,2,0]
                    ,['Подготовка к контрольным и ЕГЭ',0,1,2,0]
                ]
                ,[
                    ['Условные обозначения',0,0,1,0]
                    ,['Географический атлас',0,0,2,0]
                    ,['Географические карты',0,1,2,0]
                ]
            ],
            [//Обществознание
                [
                    ['Содержание',0,0,1,0]
                    ,['Шпоргалки',0,0,2,0]
                    ,['Подготовка к контрольным и ЕГЭ',0,1,2,0]
                ]
                ,[
                    ['Содержание',0,0,1,0]
                    ,['Шпоргалки',0,0,1,0]
                ]
            ],
            [//Экономика
                [
                    ['Содержание',0,0,1,0]
                    ,['Шпоргалки',0,0,1,0]
                ]
            ],
            [//Философия
                [
                    ['Содержание',0,0,1,0]
                    ,['Шпоргалки',0,0,1,0]
                ]
            ],
            [//Литература
                [
                    ['Содержание',0,0,1,0]
                    ,['Шпоргалки',0,0,2,0]
                    ,['Подготовка к контрольным и ЕГЭ',0,1,2,0]
                ]
                ,[
                    ['Содержание',0,0,0,0]
                ]
            ],
            [//Языки стран мира
                [
                    ['Содержание',0,0,1,0]
                    ,['Шпоргалки',0,0,2,0]
                    ,['Подготовка к контрольным и ЕГЭ',0,1,3,0]
                    ,['Толковый словарь',0,2,3,0]
                ]
                ,[
                    ['Содержание',0,0,1,0]
                    ,['Шпоргалки',0,0,2,0]
                    ,['Словарь',0,1,2,0]
                ]
                ,[
                    ['Содержание',0,0,1,0]
                    ,['Шпоргалки',0,0,2,0]
                    ,['Словарь',0,1,2,0]
                ]
                ,[
                    ['Содержание',0,0,1,0]
                    ,['Шпоргалки',0,0,2,0]
                    ,['Словарь',0,1,2,0]
                ]
                ,[
                    ['Содержание',0,0,1,0]
                    ,['Шпоргалки',0,0,2,0]
                    ,['Словарь',0,1,2,0]
                ]
            ],
            [//Астрономия
                [
                    ['Содержание',0,0,1,0]
                    ,['Шпоргалки',0,0,1,0]
                ]
                ,[
                    ['Условные обозначения',0,0,1,0]
                    ,['Атлас звёздного неба',0,0,2,0]
                    ,['Cозвездия',0,1,2,0]
                ]
            ],
            [//Черчение
                [
                    ['Содержание',0,0,1,0]
                    ,['Шпоргалки',0,0,1,0]
                ]
            ],
            [//Музыка
                [
                    ['Содержание',0,0,1,0]
                    ,['Шпоргалки',0,0,1,0]
                ]
                ,[
                    ['Содержание',0,0,1,0]
                    ,['Шпоргалки',0,0,1,0]
                ]
                ,[
                    ['Содержание',0,0,1,0]
                    ,['Шпоргалки',0,0,1,0]
                ]
                ,[
                    ['',0,0,1,0]
                    ,['',0,0,1,0]
                ]
            ],
            [//Физкультура
                [
                    ['Содержание',0,0,1,0]
                    ,['Шпоргалка',0,0,1,0]
                ]
                ,[
                    ['Содержание',0,0,1,0]
                    ,['Шпоргалка',0,0,1,0]
                ]
                ,[
                    ['Содержание',0,0,1,0]
                    ,['Шпоргалка',0,0,1,0]
                ]
                ,[
                    ['Содержание',0,0,1,0]
                    ,['Шпоргалка',0,0,1,0]
                ]
            ],
            [//Для дошколят
                [
                    ['Запоминание слов',0,0,1,0]
                    ,['Запоминание мест',0,0,2,0]
                    ,['Математика',0,1,3,0]
                    ,['Простые игры',0,2,4,0]
                    ,['Песенки',0,3,4,0]
                ]
                ,[
                    ['Сказки',0,0,1,0]
                    ,['Стихотворения',0,0,2,0]
                    ,['Расказы',0,1,2,0]
                ]
            ],
            [//Энциклопедии
                [
                    ['По алфавиту',0,0,1,0]
                    ,['По датам их рождения',0,0,2,0]
                    ,['По дате в которой они проявили себя в первый раз',0,1,3,0]
                    ,['По стране в которой они родились',0,2,4,0]
                    ,['По стране в которой они проявили себя',0,3,5,0]
                    ,['По роду их деятельности',0,4,5,0]
                ]
                ,[
                    ['По алфавиту',0,0,1,0]
                    ,['По виду факта',0,0,2,0]
                    ,['По времени происхождения факта',0,1,2,0]
                ]
                ,[
                    ['По алфавиту',0,0,1,0]
                    ,['По виду вирусов и бактерий',0,0,1,0]
                ]
                ,[
                    ['По алфавиту',0,0,1,0]
                    ,['По виду насекомых',0,0,1,0]
                ]
                ,[
                    ['По алфавиту',0,0,1,0]
                    ,['По виду животных',0,0,1,0]
                ]
                ,[
                    ['По алфавиту',0,0,1,0]
                    ,['По виду растений',0,0,1,0]
                ]
                ,[
                    ['По алфавиту',0,0,1,0]
                    ,['По виду динозавров',0,0,1,0]
                ]
            ],
            [//Атласы и карты
                [
                    ['Условные обозначения',0,0,1,0]
                    ,['Исторический атлас',0,0,2,0]
                    ,['Исторические карты',0,1,3,0]
                    ,['Карты сражений',0,2,3,0]
                ]
                ,[
                    ['Условные обозначения',0,0,1,0]
                    ,['Географический атлас',0,0,2,0]
                    ,['Географические карты',0,1,2,0]
                ]
                ,[
                    ['Условные обозначения',0,0,1,0]
                    ,['Атлас звёздного неба',0,0,2,0]
                    ,['Cозвездия',0,1,2,0]
                ]
                ,[
                    ['Условные обозначения',0,0,1,0]
                    ,['Атлас строения',0,0,2,0]
                    ,['Атлас заболеваний человека',0,1,2,0]
                ]
            ],
            [//Законы и кодексы
                [
                    ['Содержание',0,0,1,0]
                    ,['Шпоргалка',0,0,1,0]
                ]
                ,[
                    ['Содержание',0,0,1,0]
                    ,['Шпоргалка',0,0,1,0]
                ]
                ,[
                    ['Содержание',0,0,1,0]
                    ,['Шпоргалка',0,0,1,0]
                ]
                ,[
                    ['Содержание',0,0,1,0]
                    ,['Шпоргалка',0,0,1,0]
                ]
                ,[
                    ['Содержание',0,0,1,0]
                    ,['Шпоргалка',0,0,1,0]
                ]
                ,[
                    ['Содержание',0,0,1,0]
                    ,['Шпоргалка',0,0,1,0]
                ]
            ],
            [//Заметки
                [
                    ['Содержание',0,0,0,0]
                ]
            ]
        ],
        [//Обсуждение 
            [//Беседы
                [//Все беседы
                    ['Содержание',0,0,0,0]
                ],
                [//Беседы по категориям
                    ['Содержание',0,0,0,0]
                ],
                [//Мнения по разделам
                    ['Содержание',0,0,0,0]
                ],
                [//Ответы от автора сайта
                    ['Содержание',0,0,0,0]
                ],
            ],
            [//Предложения/критика
                [//Предложения 
                    ['Содержание',0,0,0,0]
                ],
                [//Критика
                    ['Содержание',0,0,0,0]
                ],
            ],
            [//Написать письмо
                [//Бланк отправки
                    ['Содержание',0,0,0,0]
                ]
            ]
        ],
        [//Справка
            [//Инструкция по сайту
                [//Вся инструкция
                    ['Содержание',0,0,0,0]
                ],
                [//Меню сайта
                    ['Содержание',0,0,0,0]
                ],
                [//Содержимое раздела
                    ['Содержание',0,0,0,0]
                ],
                [//Страница
                    ['Содержание',0,0,0,0]
                ],
                [//Боковая панель с окнами
                    ['Содержание',0,0,0,0]
                ],
                [//Смайлик
                    ['Содержание',0,0,0,0]
                ],
            ],
            [//Донаты
                [//Что такое донаты
                    ['Содержание',0,0,0,0]
                ],
                [//Отчёт о полученных донатах
                    ['Содержание',0,0,0,0]
                ],
            ],
            [//Об авторе сайта
                [//Вся история
                ['Содержание',0,0,0,0]
                ],
                [//Детство и школа
                ['Содержание',0,0,0,0]
                ],
                [//Переломный момент
                ['Содержание',0,0,0,0]
                ],
                [//Творческий подъём
                ['Содержание',0,0,0,0]
                ],
            ]
        ]     
    ];
//=================================================================================================
ar_np_nom=
[
    [
        [
            [
                [
                    [0,0,0]
                ]
            ]
            ,[
                [
                    [1,0,0]
                ]
                ,[
                    [2,1,0]
                ]
            ]
            ,[
                [
                    7
                ]
                ,[
                    23
                ]

            ]
        ]
    ]
]


//=================================================================================================
nachalo_istorii = '<h2>История Ваших путешествий начиная с конца:</h2>';    
//=================================================================================================
function on_tp_t(nomer_pt){ 
    pp='';   
    switch(nm-0){
        case 0://Главное
            switch(nr-0){
                case 1://От создателя сайта
                    switch(np-0){
                        case 0:pp= '<dd>'+array_text[0][0][0][22]+'</dd>';break; 
                        case 1:
                            switch(nomer_pt){
                                case 0:
                                    pp+='<ul><li>'+tp_telo(2)+array_text[0][0][1][8]+'</li><li>';
                                    pp+=tr_telo(0,0)+array_text[0][0][1][9]+'</li><li>';
                                    pp+=ts_telo(0)+array_text[0][0][1][10]+'</li><li>';
                                    pp+=tm_telo(0)+array_text[0][0][1][11]+'</li><li>';
                                    pp+=ti_telo(0)+array_text[0][0][1][12]+ '</li></ul>';
                                    break;
                                case 1:pp=tp_t(3,10); break;
                                case 2:pp='<dd>'+ array_text[0][0][1][13]+'</dd>';break;
                                case 3:pp=array_text[0][0][1][17]+tn_telo(0,0)+array_text[0][0][1][24]; break;
                                case 4:pp=array_text[0][0][1][18]+tym_telo(0)+array_text[0][0][1][24];break;
                                case 5:pp=array_text[0][0][1][19]+tym_rab_telo(0,0)+ array_text[0][0][1][24];break;
                                case 6:pp=array_text[0][0][1][20]+tistor_telo(0)+array_text[0][0][1][24];break;
                                case 7:pp=array_text[0][0][1][21]+tym_yrok_telo(0,0,0)+ array_text[0][0][1][24];break;
                                case 8:pp=array_text[0][0][1][22]+tym_yroki_mast_telo(0)+array_text[0][0][1][24];break;
                                case 9:pp=array_text[0][0][1][23]+tym_pik_telo(0,0)+ array_text[0][0][1][24];break;
                            }
                        break;
                        case 2:
                            ar1=array_menu[1].length+7;
                            ar2=array_menu[2].length+ar1;
                            ar3=array_menu[3].length+ar2;
                            ar4=array_menu[4].length+ar3;
                            
                            switch(nomer_pt){
                                case 0:pp=tp_t2(7,ar1);break;
                                case 1:pp=tp_t2(ar1,ar2);break;
                                case 2:pp=tp_t2(ar2,ar3);break;
                                case 3:pp=tp_t2(ar3,ar4);break;
                                case 4:case 5:case 6:pp=array_text[0][0][2][nomer_pt-2];break; 
                                default:pp=ts_telo(nomer_pt-7)+ array_text[0][0][2][nomer_pt-2];break;
                            }
                        break;
                        case 3:
                            switch(nomer_pt){
                                case 0:
                                    pp+='<p align="center"><span><table border="2px"><tr><td align="center"><img src="dizain/f1.png"class="foto_rab"></img></td></tr><tr><td align="center">hikuh</td></tr></table></span><img src="dizain/f1.png"class="foto_rab"></img><img src="dizain/f1.png"class="foto_rab"></img>';
                                    for(i=0;i<5;i++)pp+='<span id="dizain_sait_'+i+'"class="dizain"> text </span>';
                                break;
                            }
                        
                        break;
                    }
                break;
                case 2://Чего новенького
                    switch(np-0){
                        case 0:
                            
                            break;
                    }
                break;
                case 3://Люди-умельцы
                    switch(np-0){
                        case 0:case 1:case 2:case 3:
                            switch(np_1){
                                case 1:
                                
                                    switch(nomer_pt){

                                        case 0:pp='<dd>'+array_text[0][2][0][0]+'</dd>'+tp_t(5,7);  break;
                                        case 1:pp='<dd>'+array_text[0][2][0][1]+'</dd>'+tp_t(7,9);  break;
                                        case 2:pp='<dd>'+array_text[0][2][0][3]+'</dd>'+ts_intt(2);  break;
                                        case 3:pp='<dd>'+array_text[0][2][0][4]+'</dd>'+tp_t(9,10);  break;
                                        case 4:pp='<dd>'+array_text[0][2][0][5]+'</dd>'+tp_t(10,13);  break;
                                        case 5:pp='<dd>'+array_text[0][2][0][2]+'</dd>'+tizd(0);  break;
                                        case 6:pp='<dd>'+array_text[0][2][0][6]+'</dd>';  break;
                                        case 7:pp='<dd>'+array_text[0][2][0][7]+'</dd>';  break;
                                        case 8:pp='<dd>'+array_text[0][2][0][8]+'</dd>';  break;
                                        case 9:pp='<dd>'+array_text[0][2][0][9]+'</dd>';  break;
                                        case 10:pp='<dd>'+array_text[0][2][0][6]+'</dd>';  break;
                                        case 11:pp='<dd>'+array_text[0][2][0][6]+'</dd>';  break;
                                        case 12:pp='<dd>'+array_text[0][2][0][6]+'</dd>';  break;
                                    }
                                break;
                                case 2:
                                   switch(nomer_pt){
                                       case 0:pp=tp_t(5,13);break;
                                   } 
                                break;
                                case 3:
                                switch(nomer_pt){
                                       case 0:pp=tp_t(5,13);break;
                                   } 
                                break;
                            }
                        break;
                
                        case 5:
                
                        break;
                    }
                break;
                case 4://Творческие работы
                break;

            }
            
        break;
        case 1://Обучение
       // bob.innerHTML='yra';
       //pp='yra';    
            switch(nr-0){
                case 1://Обучение от умельцев
                break;
                case 2://Творчество
                    switch(np-0){
                        case 0://Рисование
                        
                            switch(nomer_pt){
                                case 0: pp=tp_to(7,20); break;
                                case 1: pp=tp_to(20,32); break;
                                case 2: pp=tp_to(32,43);break;
                                case 3: pp=tp_to(43,54);  break;
                                case 4: pp=tp_to(54,67); break;
                                case 5: pp=tp_to(67,78); break;
                                case 6: pp=tp_to(78,85); break;
                                //----------------------
                                //Рисование в карандаше
                                case 7: pp=array_text[nm][nr-1][np][2][0]; break;
                                case 8: pp=tp_to2(85,92); break;
                                case 9: pp=tp_to2(92,98); break;
                                case 10: pp=tp_to2(98,104); break;
                                case 11: pp=tp_to2(104,121); break;
                                case 12: pp=tp_to2(121,136); break;
                                case 13: pp=tp_to2(136,150); break;
                                case 14: pp=tp_to2(150,156); break;
                                case 15: pp=tp_to2(156,163); break;
                                case 16: pp=tp_to2(163,178); break;
                                case 17:pp=array_text[nm][nr-1][np][3]; break;
                                case 18:pp=array_text[nm][nr-1][np][4]; break;
                                case 19: pp=array_text[nm][nr-1][np][5]; break;
                                //----------------------
                                //Рисование красками
                                case 20:pp=array_text[nm][nr-1][np][6]; break;
                                case 21: pp=tp_to2(178,183); break;
                                case 22: pp=tp_to2(183,190); break;
                                case 23: pp=tp_to2(190,194); break;
                                case 24: pp=tp_to2(194,198); break;
                                case 25: pp=tp_to2(198,203); break;
                                case 26: pp=tp_to2(203,221); break;
                                case 27: pp=tp_to2(221,224); break;
                                case 28: pp=tp_to2(224,236); break;
                                case 29:pp=array_text[nm][nr-1][np][7]; break;
                                case 30:pp=array_text[nm][nr-1][np][8]; break;
                                case 31:pp=array_text[nm][nr-1][np][9]; break;
                                //----------------------
                                //Рисование сухой пастелью
                                
                                case 32:pp=array_text[nm][nr-1][np][10]; break;
                                case 33:pp=array_text[nm][nr-1][np][11]; break;
                                case 34: pp=tp_to2(236,239); break;
                                case 35:pp=array_text[nm][nr-1][np][12]; break;
                                case 36:pp=tp_to2(239,242); break;
                                case 37:pp=tp_to2(242,244); break;
                                case 38:pp=tp_to2(244,247); break;
                                case 39:pp=array_text[nm][nr-1][np][13]; break;
                                case 40:pp=array_text[nm][nr-1][np][14]; break;
                                case 41:pp=array_text[nm][nr-1][np][15]; break;
                                case 42:pp=array_text[nm][nr-1][np][16]; break;
                                //----------------------
                                //Рисование шерстью
                                case 43:pp=array_text[nm][nr-1][np][17]; break;
                                case 44:pp=array_text[nm][nr-1][np][18]; break;
                                case 45:pp=array_text[nm][nr-1][np][19]; break;
                                case 46:pp=tp_to2(247,261); break;
                                case 47: pp=array_text[nm][nr-1][np][20]; break;
                                case 48:pp=tp_to2(261,263); break;
                                case 49:pp=tp_to2(263,268); break;
                                case 50:pp=tp_to2(268,271); break;
                                case 51:pp=array_text[nm][nr-1][np][21]; break;
                                case 52:pp=array_text[nm][nr-1][np][22]; break;
                                case 53:pp=array_text[nm][nr-1][np][23]; break;
                                
                                //----------------------
                                //Рисование нитками
                                case 54:pp=array_text[nm][nr-1][np][24]; break;
                                case 55:pp=array_text[nm][nr-1][np][25]; break;
                                case 56:pp=array_text[nm][nr-1][np][26]; break;
                                case 57:pp=tp_to2(271,281); break;
                                case 58:pp=tp_to2(281,288); break;
                                case 59:pp=tp_to2(288,294); break;
                                case 60:pp=tp_to2(294,302); break;
                                case 61:pp=tp_to2(302,307); break;
                                case 62:pp=tp_to2(307,314); break;
                                case 63:pp=tp_to2(314,318); break;
                                case 64:pp=array_text[nm][nr-1][np][27]; break;
                                case 65:pp=array_text[nm][nr-1][np][28]; break;
                                case 66:pp=array_text[nm][nr-1][np][29]; break;
                                //----------------------
                                //Создание картин из ленточек
                                
                                case 67:pp=array_text[nm][nr-1][np][30]; break;
                                case 68:pp=array_text[nm][nr-1][np][31]; break;
                                case 69:pp=tp_to2(318,326); break;
                                case 70:pp=tp_to2(326,329); break;
                                case 71:pp=tp_to2(329,333); break;
                                case 72:pp=tp_to2(333,336); break;
                                case 73:pp=tp_to2(336,340); break;
                                case 74:pp=tp_to2(340,342); break;
                                case 75:pp=array_text[nm][nr-1][np][32]; break;
                                case 76:pp=array_text[nm][nr-1][np][33]; break;
                                case 77:pp=array_text[nm][nr-1][np][34]; break;
                                //----------------------
                                //Создание картин с помощью квиллинга 
                                case 78:pp=array_text[nm][nr-1][np][35]; break;
                                case 79:pp=array_text[nm][nr-1][np][36]; break;
                                case 80:pp=tp_to2(342,347); break;
                                case 81:pp=tp_to2(347,350); break;
                                case 82:pp=array_text[nm][nr-1][np][37]; break;
                                case 83:pp=array_text[nm][nr-1][np][38]; break;
                                case 84:pp=array_text[nm][nr-1][np][39]; break;
                                //----------------------
                                //----------------------
                                //----------------------
                                //----------------------
                                //Рисуем в карандаше
                                //----------------------
                                //Первичная подготовка
                                case 85:pp=array_text[nm][nr-1][np][40]; break;
                                case 86:pp=array_text[nm][nr-1][np][41]; break;
                                case 87:pp=array_text[nm][nr-1][np][42]; break;
                                case 88:pp=array_text[nm][nr-1][np][43]; break;
                                case 89:pp=array_text[nm][nr-1][np][44]; break;
                                case 90:pp=array_text[nm][nr-1][np][45]; break;
                                case 91:pp=array_text[nm][nr-1][np][46]; break;
                                //----------------------
                                //Первые штрихи
                                case 92:pp=array_text[nm][nr-1][np][47]; break;
                                case 93:pp=array_text[nm][nr-1][np][48]; break;
                                case 94:pp=array_text[nm][nr-1][np][49]; break;
                                case 95:pp=array_text[nm][nr-1][np][50]; break;
                                case 96:pp=array_text[nm][nr-1][np][51]; break;
                                case 97:pp=array_text[nm][nr-1][np][52]; break;
                                //----------------------
                                //Рисуем предметы
                                case 98:pp=array_text[nm][nr-1][np][53]; break;
                                case 99:pp=array_text[nm][nr-1][np][54]; break;
                                case 100:pp=array_text[nm][nr-1][np][55]; break;
                                case 101:pp=array_text[nm][nr-1][np][56]; break;
                                case 102:pp=array_text[nm][nr-1][np][57]; break;
                                case 103:pp=array_text[nm][nr-1][np][58]; break;
                                //----------------------
                                //Рисуем растения
                                case 104:pp=array_text[nm][nr-1][np][59]; break;
                                case 105:pp=array_text[nm][nr-1][np][60]; break;
                                case 106:pp=array_text[nm][nr-1][np][61]; break;
                                case 107:pp=array_text[nm][nr-1][np][62]; break;
                                case 108:pp=array_text[nm][nr-1][np][63]; break;
                                case 109:pp=array_text[nm][nr-1][np][64]; break;
                                case 110:pp=array_text[nm][nr-1][np][65]; break;
                                case 111:pp=array_text[nm][nr-1][np][66]; break;
                                case 112:pp=array_text[nm][nr-1][np][67]; break;
                                case 113:pp=array_text[nm][nr-1][np][68]; break;
                                case 114:pp=array_text[nm][nr-1][np][69]; break;
                                case 115:pp=array_text[nm][nr-1][np][70]; break;
                                case 116:pp=array_text[nm][nr-1][np][71]; break;
                                case 117:pp=array_text[nm][nr-1][np][72]; break;
                                case 118:pp=array_text[nm][nr-1][np][73]; break;
                                case 119:pp=array_text[nm][nr-1][np][74]; break;
                                case 120:pp=array_text[nm][nr-1][np][75]; break;
                                //----------------------
                                //Рисуем животных
                                case 121:pp=array_text[nm][nr-1][np][76]; break;
                                case 122:pp=array_text[nm][nr-1][np][77]; break;
                                case 123:pp=array_text[nm][nr-1][np][78]; break;
                                case 124:pp=array_text[nm][nr-1][np][79]; break;
                                case 125:pp=array_text[nm][nr-1][np][80]; break;
                                case 126:pp=array_text[nm][nr-1][np][81]; break;
                                case 127:pp=array_text[nm][nr-1][np][82]; break;
                                case 128:pp=array_text[nm][nr-1][np][83]; break;
                                case 129:pp=array_text[nm][nr-1][np][84]; break;
                                case 130:pp=array_text[nm][nr-1][np][85]; break;
                                case 131:pp=array_text[nm][nr-1][np][86]; break;
                                case 132:pp=array_text[nm][nr-1][np][87]; break;
                                case 133:pp=array_text[nm][nr-1][np][88]; break;
                                case 134:pp=array_text[nm][nr-1][np][89]; break;
                                case 135:pp=array_text[nm][nr-1][np][90]; break;
                                //----------------------
                                //Рисуем людей
                                case 136:pp=array_text[nm][nr-1][np][91]; break;
                                case 137:pp=tp_to3(350,352); break;
                                case 138:pp=tp_to3(352,361); break;
                                case 139:pp=array_text[nm][nr-1][np][92]; break;
                                case 140:pp=array_text[nm][nr-1][np][93]; break;
                                case 141:pp=array_text[nm][nr-1][np][94]; break;
                                case 142:pp=array_text[nm][nr-1][np][95]; break;
                                case 143:pp=array_text[nm][nr-1][np][96]; break;
                                case 144:pp=array_text[nm][nr-1][np][97]; break;
                                case 145:pp=array_text[nm][nr-1][np][98]; break;
                                case 146:pp=array_text[nm][nr-1][np][99]; break;
                                case 147:pp=array_text[nm][nr-1][np][100]; break;
                                case 148:pp=array_text[nm][nr-1][np][101]; break;
                                case 149:pp=array_text[nm][nr-1][np][102]; break;
                                //----------------------
                                //Рисуем портреты
                                case 150:pp=array_text[nm][nr-1][np][103]; break;
                                case 151:pp=array_text[nm][nr-1][np][104]; break;
                                case 152:pp=array_text[nm][nr-1][np][105]; break;
                                case 153:pp=array_text[nm][nr-1][np][106]; break;
                                case 154:pp=array_text[nm][nr-1][np][107]; break;
                                case 155:pp=array_text[nm][nr-1][np][108]; break;
                                //----------------------
                                //Рисуем натюрморты
                                case 156:pp=array_text[nm][nr-1][np][109]; break;
                                case 157:pp=array_text[nm][nr-1][np][110]; break;
                                case 158:pp=array_text[nm][nr-1][np][111]; break;
                                case 159:pp=array_text[nm][nr-1][np][112]; break;
                                case 160:pp=array_text[nm][nr-1][np][113]; break;
                                case 161:pp=array_text[nm][nr-1][np][114]; break;
                                case 162:pp=array_text[nm][nr-1][np][115]; break;
                                //----------------------
                                //Рисуем пейзажи
                                case 163:pp=array_text[nm][nr-1][np][116]; break;
                                case 164:pp=array_text[nm][nr-1][np][117]; break;
                                case 165:pp=array_text[nm][nr-1][np][118]; break;
                                case 166:pp=array_text[nm][nr-1][np][119]; break;
                                case 167:pp=array_text[nm][nr-1][np][120]; break;
                                case 168:pp=array_text[nm][nr-1][np][121]; break;
                                case 169:pp=array_text[nm][nr-1][np][122]; break;
                                case 170:pp=array_text[nm][nr-1][np][123]; break;
                                case 171:pp=array_text[nm][nr-1][np][124]; break;
                                case 172:pp=array_text[nm][nr-1][np][125]; break;
                                case 173:pp=array_text[nm][nr-1][np][126]; break;
                                case 174:pp=array_text[nm][nr-1][np][127]; break;
                                case 175:pp=array_text[nm][nr-1][np][128]; break;
                                case 176:pp=array_text[nm][nr-1][np][129]; break;
                                case 177:pp=array_text[nm][nr-1][np][130]; break;
                                //----------------------
                                //----------------------
                                //----------------------
                                //----------------------
                                //Рисование красками
                                //----------------------
                                //Выбор вида красок
                                case 178:pp=array_text[nm][nr-1][np][131]; break;
                                case 179:pp=array_text[nm][nr-1][np][132]; break;
                                case 180:pp=array_text[nm][nr-1][np][133]; break;
                                case 181:pp=array_text[nm][nr-1][np][134]; break;
                                case 182:pp=array_text[nm][nr-1][np][135]; break;
                                //----------------------
                                //Подготовка к рисованию
                                case 183:pp=array_text[nm][nr-1][np][136]; break;
                                case 184:pp=array_text[nm][nr-1][np][137]; break;
                                case 185:pp=array_text[nm][nr-1][np][138]; break;
                                case 186:pp=array_text[nm][nr-1][np][139]; break;
                                case 187:pp=array_text[nm][nr-1][np][140]; break;
                                case 188:pp=array_text[nm][nr-1][np][141]; break;
                                case 189:pp=array_text[nm][nr-1][np][142]; break;
                                //----------------------
                                //Создание эскиза
                                case 190:pp=array_text[nm][nr-1][np][143]; break;
                                case 191:pp=array_text[nm][nr-1][np][144]; break;
                                case 192:pp=array_text[nm][nr-1][np][145]; break;
                                case 193:pp=array_text[nm][nr-1][np][146]; break;
                                //----------------------
                                //Первоначальные штрихи
                                case 194:pp=array_text[nm][nr-1][np][147]; break;
                                case 195:pp=array_text[nm][nr-1][np][148]; break;
                                case 196:pp=array_text[nm][nr-1][np][149]; break;
                                case 197:pp=array_text[nm][nr-1][np][150]; break;
                                //----------------------
                                //Игра света и тени
                                case 198:pp=array_text[nm][nr-1][np][151]; break;
                                case 199:pp=array_text[nm][nr-1][np][152]; break;
                                case 200:pp=array_text[nm][nr-1][np][153]; break;
                                case 201:pp=array_text[nm][nr-1][np][154]; break;
                                case 202:pp=array_text[nm][nr-1][np][155]; break;
                                //----------------------
                                //Маленькие хитрости
                                case 203:pp=array_text[nm][nr-1][np][156]; break;
                                case 204:pp=array_text[nm][nr-1][np][157]; break;
                                case 205:pp=array_text[nm][nr-1][np][158]; break;
                                case 206:pp=array_text[nm][nr-1][np][159]; break;
                                case 207:pp=array_text[nm][nr-1][np][160]; break;
                                case 208:pp=array_text[nm][nr-1][np][161]; break;
                                case 209:pp=array_text[nm][nr-1][np][162]; break;
                                case 210:pp=array_text[nm][nr-1][np][163]; break;
                                case 211:pp=array_text[nm][nr-1][np][164]; break;
                                case 212:pp=array_text[nm][nr-1][np][165]; break;
                                case 213:pp=array_text[nm][nr-1][np][166]; break;
                                case 214:pp=array_text[nm][nr-1][np][167]; break;
                                case 215:pp=array_text[nm][nr-1][np][168]; break;
                                case 216:pp=array_text[nm][nr-1][np][169]; break;
                                case 217:pp=array_text[nm][nr-1][np][170]; break;
                                case 218:pp=array_text[nm][nr-1][np][171]; break;
                                case 219:pp=array_text[nm][nr-1][np][172]; break;
                                case 220:pp=array_text[nm][nr-1][np][173]; break;
                                //----------------------
                                //Дорисовываем и поправляем фрагменты
                                case 221:pp=array_text[nm][nr-1][np][174]; break;
                                case 222:pp=array_text[nm][nr-1][np][175]; break;
                                case 223:pp=array_text[nm][nr-1][np][176]; break;
                                //----------------------
                                //Рисуем вместе с разными красками
                                case 224:pp=array_text[nm][nr-1][np][177]; break;
                                case 225:pp=array_text[nm][nr-1][np][178]; break;
                                case 226:pp=array_text[nm][nr-1][np][179]; break;
                                case 227:pp=array_text[nm][nr-1][np][180]; break;
                                case 228:pp=array_text[nm][nr-1][np][181]; break;
                                case 229:pp=array_text[nm][nr-1][np][182]; break;
                                case 230:pp=array_text[nm][nr-1][np][183]; break;
                                case 231:pp=array_text[nm][nr-1][np][184]; break;
                                case 232:pp=array_text[nm][nr-1][np][185]; break;
                                case 233:pp=array_text[nm][nr-1][np][186]; break;
                                case 234:pp=array_text[nm][nr-1][np][187]; break;
                                case 235:pp=array_text[nm][nr-1][np][188]; break;
                                //----------------------
                                //----------------------
                                //----------------------
                                //----------------------
                                //Рисование сухой пастэлью
                                //----------------------
                                //Рисование эскиза
                                case 236:pp=array_text[nm][nr-1][np][189]; break;
                                case 237:pp=array_text[nm][nr-1][np][190]; break;
                                case 238:pp=array_text[nm][nr-1][np][191]; break;
                                //----------------------
                                //Нанесение цветной основы
                                case 239:pp=array_text[nm][nr-1][np][192]; break;
                                case 240:pp=array_text[nm][nr-1][np][193]; break;
                                case 241:pp=array_text[nm][nr-1][np][194]; break;
                                //----------------------
                                //Работа с лицами
                                case 242:pp=array_text[nm][nr-1][np][195]; break;
                                case 243:pp=array_text[nm][nr-1][np][196]; break;
                                //----------------------
                                //Втирание цвета и тени
                                case 244:pp=array_text[nm][nr-1][np][197]; break;
                                case 245:pp=array_text[nm][nr-1][np][198]; break;
                                case 246:pp=array_text[nm][nr-1][np][199]; break;
                                //----------------------
                                //----------------------
                                //----------------------
                                //----------------------
                                //Рисование шерстью
                                //----------------------
                                //Виды укладывания шерсти
                                case 247:pp=array_text[nm][nr-1][np][200]; break;
                                case 248:pp=array_text[nm][nr-1][np][201]; break;
                                case 249:pp=array_text[nm][nr-1][np][202]; break;
                                case 250:pp=array_text[nm][nr-1][np][203]; break;
                                case 251:pp=array_text[nm][nr-1][np][204]; break;
                                case 252:pp=array_text[nm][nr-1][np][205]; break;
                                case 253:pp=array_text[nm][nr-1][np][206]; break;
                                case 254:pp=array_text[nm][nr-1][np][207]; break;
                                case 255:pp=array_text[nm][nr-1][np][208]; break;
                                case 256:pp=array_text[nm][nr-1][np][209]; break;
                                case 257:pp=array_text[nm][nr-1][np][210]; break;
                                case 258:pp=array_text[nm][nr-1][np][211]; break;
                                case 259:pp=array_text[nm][nr-1][np][212]; break;
                                case 260:pp=array_text[nm][nr-1][np][213]; break;
                                //----------------------
                                //Нанесение красок как основы
                                case 261:pp=array_text[nm][nr-1][np][214]; break;
                                case 262:pp=array_text[nm][nr-1][np][215]; break;
                                //----------------------
                                //Нанесение шерсти
                                case 263:pp=array_text[nm][nr-1][np][216]; break;
                                case 264:pp=array_text[nm][nr-1][np][217]; break;
                                case 265:pp=array_text[nm][nr-1][np][218]; break;
                                case 266:pp=array_text[nm][nr-1][np][219]; break;
                                case 267:pp=array_text[nm][nr-1][np][220]; break;
                                //----------------------
                                //Завершающие штрихи
                                case 268:pp=array_text[nm][nr-1][np][221]; break;
                                case 269:pp=array_text[nm][nr-1][np][222]; break;
                                case 270:pp=array_text[nm][nr-1][np][223]; break;
                                //----------------------
                                //----------------------
                                //----------------------
                                //----------------------
                                //Рисование нитками
                                //----------------------
                                //Рисование нитками на полотне
                                case 271:pp=array_text[nm][nr-1][np][224]; break;
                                case 272:pp=array_text[nm][nr-1][np][225]; break;
                                case 273:pp=array_text[nm][nr-1][np][226]; break;
                                case 274:pp=array_text[nm][nr-1][np][227]; break;
                                case 275:pp=array_text[nm][nr-1][np][228]; break;
                                case 276:pp=array_text[nm][nr-1][np][229]; break;
                                case 277:pp=array_text[nm][nr-1][np][230]; break;
                                case 278:pp=array_text[nm][nr-1][np][231]; break;
                                case 279:pp=array_text[nm][nr-1][np][232]; break;
                                case 280:pp=array_text[nm][nr-1][np][233]; break;
                                //----------------------
                                //Рисование предметов
                                case 281:pp=array_text[nm][nr-1][np][234]; break;
                                case 282:pp=array_text[nm][nr-1][np][235]; break;
                                case 283:pp=array_text[nm][nr-1][np][236]; break;
                                case 284:pp=array_text[nm][nr-1][np][237]; break;
                                case 285:pp=array_text[nm][nr-1][np][238]; break;
                                case 286:pp=array_text[nm][nr-1][np][239]; break;
                                case 287:pp=array_text[nm][nr-1][np][240]; break;
                                //----------------------
                                //Рисование цветов и растений
                                case 288:pp=array_text[nm][nr-1][np][241]; break;
                                case 289:pp=array_text[nm][nr-1][np][242]; break;
                                case 290:pp=array_text[nm][nr-1][np][243]; break;
                                case 291:pp=array_text[nm][nr-1][np][244]; break;
                                case 292:pp=array_text[nm][nr-1][np][245]; break;
                                case 293:pp=array_text[nm][nr-1][np][246]; break;
                                //----------------------
                                //Рисование животных
                                case 294:pp=array_text[nm][nr-1][np][247]; break;
                                case 295:pp=array_text[nm][nr-1][np][248]; break;
                                case 296:pp=array_text[nm][nr-1][np][249]; break;
                                case 297:pp=array_text[nm][nr-1][np][250]; break;
                                case 298:pp=array_text[nm][nr-1][np][251]; break;
                                case 299:pp=array_text[nm][nr-1][np][252]; break;
                                case 300:pp=array_text[nm][nr-1][np][253]; break;
                                case 301:pp=array_text[nm][nr-1][np][254]; break;
                                //----------------------
                                //Рисование людей
                                case 302:pp=array_text[nm][nr-1][np][255]; break;
                                case 303:pp=array_text[nm][nr-1][np][256]; break;
                                case 304:pp=array_text[nm][nr-1][np][257]; break;
                                case 305:pp=array_text[nm][nr-1][np][258]; break;
                                case 306:pp=array_text[nm][nr-1][np][259]; break;
                                //----------------------
                                //Первые этапы в прорисовки картины
                                case 307:pp=array_text[nm][nr-1][np][260]; break;
                                case 308:pp=array_text[nm][nr-1][np][261]; break;
                                case 309:pp=array_text[nm][nr-1][np][262]; break;
                                case 310:pp=array_text[nm][nr-1][np][263]; break;
                                case 311:pp=array_text[nm][nr-1][np][264]; break;
                                case 312:pp=array_text[nm][nr-1][np][265]; break;
                                case 313:pp=array_text[nm][nr-1][np][266]; break;
                                //----------------------
                                //Завершение картины
                                case 314:pp=array_text[nm][nr-1][np][267]; break;
                                case 315:pp=array_text[nm][nr-1][np][268]; break;
                                case 316:pp=array_text[nm][nr-1][np][269]; break;
                                case 317:pp=array_text[nm][nr-1][np][270]; break;
                                //----------------------
                                //----------------------
                                //----------------------
                                //----------------------
                                //Создание картин из ленточек
                                //----------------------
                                //Маленькие хитрости
                                case 318:pp=array_text[nm][nr-1][np][271]; break;
                                case 319:pp=array_text[nm][nr-1][np][272]; break;
                                case 320:pp=array_text[nm][nr-1][np][273]; break;
                                case 321:pp=array_text[nm][nr-1][np][274]; break;
                                case 322:pp=array_text[nm][nr-1][np][275]; break;
                                case 323:pp=array_text[nm][nr-1][np][276]; break;
                                case 324:pp=array_text[nm][nr-1][np][277]; break;
                                case 325:pp=array_text[nm][nr-1][np][278]; break;
                                //----------------------
                                //Краски в помощь
                                case 326:pp=array_text[nm][nr-1][np][279]; break;
                                case 327:pp=array_text[nm][nr-1][np][280]; break;
                                case 328:pp=array_text[nm][nr-1][np][281]; break;
                                //----------------------
                                //Поиск вдохновения
                                case 329:pp=array_text[nm][nr-1][np][282]; break;
                                case 330:pp=array_text[nm][nr-1][np][283]; break;
                                case 331:pp=array_text[nm][nr-1][np][284]; break;
                                case 332:pp=array_text[nm][nr-1][np][285]; break;
                                //----------------------
                                //Подготовка полотна
                                case 333:pp=array_text[nm][nr-1][np][286]; break;
                                case 334:pp=array_text[nm][nr-1][np][287]; break;
                                case 335:pp=array_text[nm][nr-1][np][288]; break;
                                //----------------------
                                //Создание картины
                                case 336:pp=array_text[nm][nr-1][np][289]; break;
                                case 337:pp=array_text[nm][nr-1][np][290]; break;
                                case 338:pp=array_text[nm][nr-1][np][291]; break;
                                case 339:pp=array_text[nm][nr-1][np][292]; break;
                                //----------------------
                                //Комбинация материала в картинах
                                case 340:pp=array_text[nm][nr-1][np][293]; break;
                                case 341:pp=array_text[nm][nr-1][np][294]; break;
                                //----------------------
                                //----------------------
                                //----------------------
                                //----------------------
                                //Создание картин с помощью квиллинга
                                //----------------------
                                //Работа с квилингом
                                case 342:pp=array_text[nm][nr-1][np][295]; break;
                                case 343:pp=array_text[nm][nr-1][np][296]; break;
                                case 344:pp=array_text[nm][nr-1][np][297]; break;
                                case 345:pp=array_text[nm][nr-1][np][298]; break;
                                case 346:pp=array_text[nm][nr-1][np][299]; break;
                                //----------------------
                                //Создаём чудо
                                case 347:pp=array_text[nm][nr-1][np][300]; break;
                                case 348:pp=array_text[nm][nr-1][np][301]; break;
                                case 349:pp=array_text[nm][nr-1][np][302]; break;
                                //----------------------
                                //----------------------
                                //----------------------
                                //----------------------
                                //Рисуем в карандаше/Рисуем людей
                                //----------------------
                                //Анатомия человека
                                case 350:pp=array_text[nm][nr-1][np][303]; break;
                                case 351:pp=array_text[nm][nr-1][np][304]; break;
                                //----------------------
                                //Пропорции частей тела
                                case 352:pp=array_text[nm][nr-1][np][305]; break;
                                case 353:pp=array_text[nm][nr-1][np][306]; break;
                                case 354:pp=array_text[nm][nr-1][np][307]; break;
                                case 355:pp=array_text[nm][nr-1][np][308]; break;
                                case 356:pp=array_text[nm][nr-1][np][309]; break;
                                case 357:pp=array_text[nm][nr-1][np][310]; break;
                                case 358:pp=array_text[nm][nr-1][np][311]; break;
                                case 359:pp=array_text[nm][nr-1][np][312]; break;
                                case 360:pp=array_text[nm][nr-1][np][313]; break;
                            }
                        break;
                        case 1://Лепка 
                        switch(nomer_pt){
                            case 0:pp=tp_to(5,18); break;
                            case 1:pp=tp_to(18,31); break;
                            case 2:pp=tp_to(31,44); break;
                            case 3:pp=tp_to(44,56); break;
                            case 4:pp=tp_to(56,68);break;
                            //----------------------
                            //Лепка из глины и гипса
                            //----------------------
                            //Лепка из полимерного пластилина
                            //----------------------
                            //Лепка из папье-маше
                            //----------------------
                            //Лепка из ваты

                        }

                        
                        break;
                        case 2://Вязание
                        switch(nomer_pt){
                            case 0:pp=tp_to(4,18); break;
                            case 1:pp=tp_to(18,30); break;
                            case 2:pp=tp_to(30,42); break;
                            case 3:pp=tp_to(42,50); break;
                        }
                        break;
                        case 3://Валяние
                        switch(nomer_pt){
                            case 0:pp=tp_to(3,13); break;
                            case 1:pp=tp_to(13,22); break;
                            case 2:pp=tp_to(22,31); break;
                        }
                        break;
                        case 4://Вышивка и шитьё
                        switch(nomer_pt){
                            case 0:pp=tp_to(5,18); break;
                            case 1:pp=tp_to(18,29); break;
                            case 2:pp=tp_to(29,40); break;
                                case 3:pp=tp_to(40,51); break;
                                    case 4:pp=tp_to(51,61); break;
                        }
                        break;
                        case 5://Плетение
                        break;
                        case 6://Работа с деревом
                        break;
                        case 7://
                        break;        
                    }    
                break;
                case 3://Информатика
                    switch(np-0){
                        case 0:
                            switch(nomer_pt){
                                case 0:pp=tp_to(3,7);break;
                                case 1:pp=tp_to(7,8);break;
                                case 7:pp=tshp_telo(0)+tshp_telo(1)+ar_ts[nm][nr-1][np][0][0]+'<p>'+array_text[nm][nr-1][np][1];break;
                            }
                        break;

                    }
                break;
                case 4://Алгебра и геометрия
                break;
                case 5://Физика
                break;
                case 6://Химия
                break;
                case 7://Биология
                break;
                case 8://История
                break;
                case 9://География
                break;
                case 10://Обществознание
                break;
                case 11://Экономика
                break;
                case 12://Философия
                break;
                case 13://Литература
                break;
                case 14://Языки народов мира
                break;
                case 15://Астрономия
                break;
                case 16://Черчение
                break;
                case 17://Музыка
                break;
                case 18://Физкультура
                break;
                case 19://Для дошколят
                break;
                case 20://Энциклопедии
                break;
                case 21://Атласы и карты
                break;
                case 22://Законы и кодексы
                break;
                case 23://Заметки
                break;
            }
        break;
        case 3://Обсуждение
        break;
        case 4://Справка
        break;
        

    }
    return pp;
}

//=================================================================================================
function text_str() {
    mrp();
    //tm_telos(0,pamyt_metka);
    //ti_telos(0,pamyt_interes);
    
    str_text='';
    switch(nm-0){
        case 0:
            switch(nr-0){
                case 1://от создателя сайта
                    switch(np-0){
                        case 0:
                            str_text+=array_text[0][0][0][0]+tym_telo(1);
                            str_text+=array_text[0][0][0][1]+ts_telo(1);
                            str_text+=array_text[0][0][0][2]+tp_telo(0);
                            str_text+=array_text[0][0][0][3]+tr_telo(0,0);
                            str_text+=array_text[0][0][0][4]+ts_telo(0);
                            str_text+=array_text[0][0][0][5]+tm_telo(0);
                            str_text+=array_text[0][0][0][6]+ti_telo(0)+ ts_tn(2,7,7);
                            str_text+=array_text[0][0][0][12]+ ts_t(7,13,13)+ ts_tn(13,20,14);
                            str_text+=array_text[0][0][0][21];
                        break;
                        case 1:

                            str_text+=array_text[0][0][1][0]+tp_telo(0);
                            str_text+=array_text[0][0][1][1]+tp_telo(1)+  ts_tn(1,6,2);
                            str_text+=array_text[0][0][1][7];//7
                        break;
                        case 2:
                            str_text+=array_text[0][0][2][0]+ tp_t(0,4);
                            str_text+=array_text[0][0][2][1]+    '<ul><li>'+  tp_telo(4)+'</li><p><li>'+tp_telo(5)+'</li><p><li>'+tp_telo(6)+'</li><p></ul>';
                        break;
                        case 3:
                            str_text+=array_text[0][0][3][0]+ tp_t(0,2);
                            str_text+=array_text[0][0][3][1]+ tp_t(2,4);
                            str_text+=array_text[0][0][3][2]+tp_t(4,7);
                            str_text+=array_text[0][0][3][3];
                        break;
                    }
                break;
                case 2://чего новенького
                    switch(np-0){
                        case 0: str_text+=array_text[0][1][0][0]+ tnow_t(); break;
                            case 1: str_text+=array_text[0][1][1][0]; break;
                            case 2: str_text+=array_text[0][1][2][0]; break;
                            case 3: str_text+=array_text[0][1][3][0]+tp_t(0,4);  break;
                    }
                break;
                case 3://люди-умельцы
                   switch(np-0){
                        case 0:          
                            str_text+='<p>1' +tym_telo(1);
                            str_text+='<p>2' +tym_telo(2);
                        break;
                        case 1:
                            str_text+='<p>2' +tym_telo(2);
                            str_text+='<p>1' +tym_telo(1);
                        break;
                        case 2: str_text+=array_text[0][2][2][0]; break;
                        case 3: str_text+=array_text[0][2][3][0]; break;
                        case 4: str_text+=array_text[0][2][4][0]; break;
                        case 5: str_text+=array_text[0][2][5][0]+form_chel(); break;
                    }
                break;
                case 4://творческие работы
                    switch(np-0){
                        case 0: str_text+=array_text[0][3][0][0]; break;
                        case 1: str_text+=array_text[0][3][1][0]+tp_t(0,13); break;
                        case 2: str_text+=array_text[0][3][2][0]+tp_t(0,19); break;
                        case 3: str_text+=array_text[0][3][3][0]; break;
                    }
                break;
                case 5://поиск по сайту
                    switch(np-0){
                        case 0: str_text+=array_text[0][4][0][0]; break;
                        case 1: str_text+=array_text[0][4][1][0]; break;
                        case 2: str_text+=array_text[0][4][2][0]; break;
                        case 3: str_text+=array_text[0][4][3][0]; break;
                        case 4: str_text+=array_text[0][4][4][0]; break;
                        case 5: str_text+=array_text[0][4][5][0]; break;
                    }
                break;
                case 6://история просмотра
                    switch(np-0){
                        case 0: str_text+=array_text[0][5][0][0]; break;
                        case 1: str_text+=array_text[0][5][1][0]; break;
                    }
                break;
                case 7://регистрация
                    switch(np-0){
                        case 0: str_text+=array_text[0][6][0][0]; break;
                        case 1: str_text+=array_text[0][6][1][0]; break;
                        case 2: str_text+=array_text[0][6][2][0]; break;
                    }
                break;
            }
        break;
        case 1:
            switch(nr-0){ 
                case 1://обучение от умельцев
                    switch(np-0){
                        case 0: str_text+=array_text[1][0][0][0]+tym_yrok_telo(0,0); break;
                        case 1: str_text+=array_text[1][0][1][0] +tym_yroki_mast_telo(0)+'<p>'+tym_yroki_mast_telo(0); break;
                        case 2: str_text+=array_text[1][0][2][0]+tp_t(0,10); break;
                        case 3: str_text+=array_text[1][0][3][0]+tym_pik_telo(0,0)+'<p>'+tym_pik_telo(0,1); break;
                        case 4: str_text+=array_text[1][0][4][0]; break;
                    }
                break;
                case 2://творчество
                    switch(np-0){
                        case 0: str_text+=array_text[1][1][0][0]+tp_t(0,7); break;
                        case 1: str_text+=array_text[1][1][1][0]+tp_t(0,5); break;
                        case 2: str_text+=array_text[1][1][2][0]+tp_t(0,4); break;
                        case 3: str_text+=array_text[1][1][3][0]+tp_t(0,3); break;
                        case 4: str_text+=array_text[1][1][4][0]+tp_t(0,5); break;
                        case 5: str_text+=array_text[1][1][5][0]+tp_t(0,3); break;
                        case 6: str_text+=array_text[1][1][6][0]+tp_t(0,4); break;
                        case 7: str_text+=array_text[1][1][7][0]; break;
                        
                    }
                break;
                case 3://информатика
                    switch(np-0){
                        case 0: str_text+=array_text[1][2][0][0]+tp_t(0,3); break;
                        case 1: str_text+=array_text[1][2][1][0]+tp_t(0,3); break;
                        case 2: str_text+=array_text[1][2][2][0]+tp_t(0,2); break;
                        case 3: str_text+=array_text[1][2][3][0]+tp_t(0,2); break;
                        case 4: str_text+=array_text[1][2][4][0]+tp_t(0,3); break;
                        case 5: str_text+=array_text[1][2][5][0]+tp_t(0,8); break;
                        case 6: str_text+=array_text[1][2][6][0]+tp_t(0,2); break;
                        case 7: str_text+=array_text[1][2][7][0]; break;
                    }
                break;
                case 4://Алгебра и геометрия
                    switch(np-0){
                        case 0: str_text+=array_text[1][2][0][0]+tp_t(0,3); break;
                        case 1: str_text+=array_text[1][2][0][0]+tp_t(0,3); break;
                        case 2: str_text+=array_text[1][3][2][0]+tp_t(0,2); break;
                        case 3: str_text+=array_text[1][3][2][0]+tp_t(0,2); break;
                        case 4: str_text+=array_text[1][3][4][0]; break;
                    }
                break;
                case 5://Физика
                    switch(np-0){
                        case 0: str_text+=array_text[1][2][0][0]+tp_t(0,3); break;
                        case 1: str_text+=array_text[1][3][2][0]+tp_t(0,2); break;
                        case 2: str_text+=array_text[1][3][2][0]+tp_t(0,2); break;
                        case 3: str_text+=array_text[1][4][3][0]; break;
                    }
                break;
                case 6://Химия
                    switch(np-0){
                        case 0: str_text+=array_text[1][2][0][0]+tp_t(0,3); break;
                        case 1: str_text+=array_text[1][2][0][0]+tp_t(0,3); break;
                        case 2: str_text+=array_text[1][5][2][0]+tp_t(0,12); break;
                        case 3: str_text+=array_text[1][5][3][0]; break;

                    }
                break;
                case 7://Биология
                    switch(np-0){
                        case 0: str_text+=array_text[1][2][0][0]+tp_t(0,3); break;
                        case 1: str_text+=array_text[1][3][2][0]+tp_t(0,2); break;
                        case 2: str_text+=array_text[1][6][2][0]+tp_t(0,3); break;
                        case 3: str_text+=array_text[1][6][3][0]+tp_t(0,4); break;
                        case 4: str_text+=array_text[1][6][4][0]; break;
                    }
                break;
                case 8://История
                    switch(np-0){
                        case 0: str_text+=array_text[1][2][0][0]+tp_t(0,3); break;
                        case 1: str_text+=array_text[1][2][0][0]+tp_t(0,3); break;
                        case 2: str_text+=array_text[1][3][2][0]+tp_t(0,2); break;
                        case 3: str_text+=array_text[1][3][2][0]+tp_t(0,2); break;
                        case 4: str_text+=array_text[1][7][4][0]+tp_t(0,4); break;
                        case 5: str_text+=array_text[1][7][5][0]; break;

                    }
                break;
                case 9://География
                    switch(np-0){
                        case 0: str_text+=array_text[1][2][0][0]+tp_t(0,3); break;
                        case 1: str_text+=array_text[1][8][1][0]+tp_t(0,3); break;
                        case 2: str_text+=array_text[1][8][2][0]; break;
                    }
                break;
                case 10://Обществознание
                    switch(np-0){
                        case 0: str_text+=array_text[1][2][0][0]+tp_t(0,3); break;
                        case 1: str_text+=array_text[1][3][2][0]+tp_t(0,2); break;
                        case 2: str_text+=array_text[1][9][2][0]; break;
                    }
                break;
                case 11://Экономика
                    switch(np-0){
                        case 0: str_text+=array_text[1][3][2][0]+tp_t(0,2); break;
                        case 1: str_text+=array_text[1][10][1][0]; break;
                    }
                break;
                case 12://Философия
                    switch(np-0){
                        case 0: str_text+=array_text[1][3][2][0]+tp_t(0,2); break;
                        case 1: str_text+=array_text[1][11][1][0]; break;
                    }
                break;
                case 13://Литература
                    switch(np-0){
                        case 0: str_text+=array_text[1][2][0][0]+tp_t(0,3); break;
                        case 1: str_text+=array_text[1][12][1][0]+tp_t(0,3); break;
                        case 2: str_text+=array_text[1][12][2][0]; break;
                    }
                break;
                case 14://Языки народов мира
                    switch(np-0){
                        case 0: str_text+=array_text[1][2][0][0]+tp_t(0,4); break;
                        case 1: str_text+=array_text[1][3][2][0]+tp_t(0,3); break;
                        case 2: str_text+=array_text[1][3][2][0]+tp_t(0,3); break;
                        case 3: str_text+=array_text[1][3][2][0]+tp_t(0,3); break;
                        case 4: str_text+=array_text[1][3][2][0]+tp_t(0,3); break;
                        case 5: str_text+=array_text[1][13][5][0]; break;
                    }
                break;
                case 15://Астрономия
                    switch(np-0){
                        case 0: str_text+=array_text[1][3][2][0]+tp_t(0,2); break;
                        case 1: str_text+=array_text[1][14][1][0]+tp_t(0,3); break;
                        case 2: str_text+=array_text[1][14][2][0]; break;
                    }
                break;
                case 16://Черчение
                    switch(np-0){
                        case 0: str_text+=array_text[1][3][2][0]+tp_t(0,2); break;
                        case 1: str_text+=array_text[1][15][1][0]; break;
                    }
                break;
                case 17://Музыка
                    switch(np-0){
                        case 0: str_text+=array_text[1][3][2][0]+tp_t(0,2); break;
                        case 1: str_text+=array_text[1][3][2][0]+tp_t(0,2); break;
                        case 2: str_text+=array_text[1][3][2][0]+tp_t(0,2); break;
                        case 3: str_text+=array_text[1][3][2][0]+tp_t(0,2); break;
                        case 4: str_text+=array_text[1][16][3][0]; break;
                    }
                break;
                case 18://Физкультура
                    switch(np-0){
                        case 0: str_text+=array_text[1][3][2][0]+tp_t(0,2); break;
                        case 1: str_text+=array_text[1][3][2][0]+tp_t(0,2); break;
                        case 2: str_text+=array_text[1][3][2][0]+tp_t(0,2); break;
                        case 3: str_text+=array_text[1][3][2][0]+tp_t(0,2); break;
                        case 4: str_text+=array_text[1][17][4][0]; break;
                    }
                break;
                case 19://Для дошколят
                    switch(np-0){
                        case 0: str_text+=array_text[1][18][0][0]+tp_t(0,5); break;
                        case 1: str_text+=array_text[1][18][1][0]+tp_t(0,3); break;
                        case 2: str_text+=array_text[1][18][2][0]; break;
                    }
                break;
                case 20://Энциклопедии
                    switch(np-0){
                        case 0: str_text+=array_text[1][19][0][0]+tp_t(0,6); break;
                        case 1: str_text+=array_text[1][19][1][0]+tp_t(0,3); break;
                        case 2: str_text+=array_text[1][19][2][0]+tp_t(0,2); break;
                        case 3: str_text+=array_text[1][19][3][0]+tp_t(0,2); break;
                        case 4: str_text+=array_text[1][19][4][0]+tp_t(0,2); break;
                        case 5: str_text+=array_text[1][19][5][0]+tp_t(0,2); break;
                        case 6: str_text+=array_text[1][19][6][0]+tp_t(0,2); break;
                        case 7: str_text+=array_text[1][19][7][0]; break; 
                    }
                break;
                case 21://Атласы
                    switch(np-0){
                        case 0: str_text+=array_text[1][20][0][0]+tp_t(0,4); break;
                        case 1: str_text+=array_text[1][20][1][0]+tp_t(0,3); break;
                        case 2: str_text+=array_text[1][20][2][0]+tp_t(0,3); break;
                        case 3: str_text+=array_text[1][20][3][0]+tp_t(0,3); break;
                        case 4: str_text+=array_text[1][20][4][0]; break;
                    }
                break;
                case 22://Законы и кодексы
                    switch(np-0){
                        case 0: str_text+=array_text[1][21][0][0]+tp_t(0,1); break;
                        case 1: str_text+=array_text[1][3][2][0]+tp_t(0,2); break;
                        case 2: str_text+=array_text[1][3][2][0]+tp_t(0,2); break;
                        case 3: str_text+=array_text[1][3][2][0]+tp_t(0,2); break;
                        case 4: str_text+=array_text[1][3][2][0]+tp_t(0,2); break;
                        case 5: str_text+=array_text[1][3][2][0]+tp_t(0,2); break;
                        case 6: str_text+=array_text[1][21][6][0]; break;
                    }
                break;
                case 23://Заметки
                    switch(np-0){
                        case 0: str_text+=array_text[1][22][0][0]+tp_t(0,1); break;
                        case 1: str_text+=array_text[1][22][1][0]; break;
                    }
                break;
            }
        break;
        case 2://Обсуждение
            switch(nr-0){
                case 1://Беседы
                    switch(np-0){
                        case 0: str_text+=array_text[2][0][0][0]+tp_t(0,1);break;
                        case 1: str_text+=array_text[2][0][1][0]+tp_t(0,1);break;
                        case 2: str_text+=array_text[2][0][2][0]+tp_t(0,1);break;
                        case 3: str_text+=array_text[2][0][3][0]+tp_t(0,1);break;
                    }
                break;
                case 2://Предложения/критика
                    switch(np-0){
                        case 0: str_text+=array_text[2][1][0][0]+tp_t(0,1); break;
                        case 1: str_text+=array_text[2][1][1][0]+tp_t(0,1); break;
                    }
                break;
                case 3://Написать письмо
                    switch(np-0){
                        case 0: str_text+=array_text[2][2][0][0]+tp_t(0,1); break;
                    }
                break;
            }            
        break;
        case 3://Справка
            switch(nr-0){
                case 1://Инструкция по сайту
                    switch(np-0){
                        case 0: str_text+=array_text[3][0][0][0]+tp_t(0,1); break;
                        case 1: str_text+=array_text[3][0][1][0]+tp_t(0,1); break;
                        case 2: str_text+=array_text[3][0][2][0]+tp_t(0,1); break;
                        case 3: str_text+=array_text[3][0][3][0]+tp_t(0,1); break;
                        case 4: str_text+=array_text[3][0][4][0]+tp_t(0,1); break;
                        case 5: str_text+=array_text[3][0][5][0]+tp_t(0,1); break;
                    }
                break;
                case 2://Донаты
                    switch(np-0){
                        case 0: str_text+=array_text[3][1][0][0]+tp_t(0,1); break;
                        case 1: str_text+=array_text[3][1][1][0]+tp_t(0,1); break;
                    }
                break;
                case 3://Об авторе сайта
                    switch(np-0){
                        case 0: str_text+=array_text[3][2][0][0]+tp_t(0,1); break;
                        case 1: str_text+=array_text[3][2][1][0]+tp_t(0,1); break;
                        case 2: str_text+=array_text[3][2][2][0]+tp_t(0,1); break;
                        case 3: str_text+=array_text[3][2][3][0]+tp_t(0,1); break;
                    }
                break;
            }            
        break;
    }
    document.getElementById('t_s').innerHTML = str_text;
    
}
//=================================================================================================
function on_tr_t(nomer){ 
    rr='';   
    switch(nm-0){
        case 0:
            switch(nr-0){
                case 1:
                    switch(np-0){
                        case 0:rr= array_text[0][0][0][23];break; 
                        case 1:rr=array_text[0][0][1][14]; break;
                    }
                break;
            }
        break;
    }
    return rr;
}
//=================================================================================================
function on_ts_t(nomer){ 
    switch(nm-0){
        case 0:
            switch(nr-0){
                case 1:
                    switch(np-0){
                        case 0:
                            switch(nomer){
                                case 1:nm = 0; nr = 1;np = 1;break;
                                case 2:nm = 0; nr = 3;np = 0;break;
                                case 3:nm = 0; nr = 4;np = 0;break;
                                case 4:nm = 0; nr = 3;np = 0;break;
                                case 5:nm = 0; nr = 3;np = 5;break;
                                case 6:nm = 1; nr = 1;np = 0;break;
                                case 7:nm = 1; nr = 13;np = 1;break;
                                case 8:nm = 1; nr = 20;np = 0;break;
                                case 9:nm = 1; nr = 21;np = 0;break;
                                case 10:nm = 1; nr = 10;np = 1;break;
                                case 11:nm = 1; nr = 22;np = 0;break;
                                case 12:nm = 1; nr = 19;np = 0;break;
                                case 13:nm = 0; nr = 2;np = 0;break;
                                case 14:nm = 2; nr = 1;np = 0;break;
                                case 15:nm = 2; nr = 3;np = 0;break;
                                case 16:nm = 2; nr = 1;np = 0;break;
                                case 17:nm = 0; nr = 1;np = 1;break;
                                case 18:nm = 0; nr = 1;np = 2;break;
                                case 19:nm = 3; nr = 1;np = 0;break;
                            }
                        break; 
                        case 1:
                            switch(nomer){
                                case 0:nm=0;nr=1;np=0; break;
                                case 1:nm = 1; nr = 23;np = 0;break;
                                case 2:nm = 2; nr = 1;np = 0;break;
                                case 3:nm = 0; nr = 2;np = 0;break;
                                case 4:nm = 3; nr = 1;np = 4;break;
                                case 5:nm = 3; nr = 1;np = 0;break;
                            }
                        break;
                        case 2:
                            switch(nomer){
                                case 0:case 1:case 2:case 3:case 4:case 5:case 6:nm=0;nr=nomer+1;np=0;break;
                                case 7:case 8:case 9:case 10:case 11:case 12:case 13:case 14:case 15:case 16:case 17:case 18:case 19:case 20:case 21:case 22:case 23:case 24:case 25:case 26:case 27:case 28:case 29:nm=1;nr=nomer-6;np=0;break;
                                case 30:case 31:case 32:nm=2;nr=nomer-29;np=0;break;
                                case 33:case 34:case 35:nm=3;nr=nomer-32;np=0;break;
                            }
                        break;
                    }
                break;
            }
        break;
    }
    
    //if(nm==localStorage.getItem('nm')-0&&nr==localStorage.getItem('nr')-0)smena_deistvie=11;
    //else if(np==0)smena_deistvie=2;    
    //else
    smena_deistvie=10;
        
    on_pamyt(nm,nr,np);
  smena_var=0;  
switch(dz){
        case 1:smena_stranic_1();break;
        default:smena_stranic_0();break;
    
    }

}

//=================================================================================================
function on_tm_t(nomer){ 
    mm='';   
    switch(nm-0){
        case 0:
            switch(nr-0){
                case 1:
                    switch(np-0){
                        case 0:mm=array_text[0][0][0][24];break; 
                        case 1:mm=array_text[0][0][1][15]; break;
                    }
                break;
            }
        break;
    }
    return mm;
}
//=================================================================================================
function on_ti_t(nomer){ 
    ii='';   
    switch(nm-0){
        case 0:
            switch(nr-0){
                case 1:
                    switch(np-0){
                        case 0:ii=array_text[0][0][0][24];break; 
                        case 1:ii=array_text[0][0][1][16];break;
                    }
                break;
            }
        break;
    }
    return ii;
}

//=================================================================================================
function tp_t(tp_n,tp_k){ s_pp='<ul>';for(ii=tp_n;ii<tp_k;ii++) s_pp+='<li>'+tp_telo(ii)+'</li><p>';s_pp+='</ul>';return s_pp;}
//=================================================================================================
function tp_t2(tp_n,tp_k){ s_pp='<ul>';for(ii2=tp_n;ii2<tp_k;ii2++) s_pp+='<li>'+tp_telo(ii2)+'</li><p>';s_pp+='</ul>';return s_pp;}
//=================================================================================================
function tp_t3(tp_n,tp_k){ s_pp='<ul>';for(ii3=tp_n;ii3<tp_k;ii3++) s_pp+='<li>'+tp_telo(ii3)+'</li><p>';s_pp+='</ul>';return s_pp;}
//=================================================================================================
function tp_to(tp_n,tp_k){ s_po='<ol>';for(ij=tp_n;ij<tp_k;ij++) s_po+='<li>'+tp_telo(ij)+'</li><p>';s_po+='</ol>';return s_po;}
//=================================================================================================
function tp_to2(tp_n,tp_k){ s_po='<ol>';for(ij2=tp_n;ij2<tp_k;ij2++) s_po+='<li>'+tp_telo(ij2)+'</li><p>';s_po+='</ol>';return s_po;}
//=================================================================================================
function tp_to3(tp_n,tp_k){ s_po='<ol>';for(ij3=tp_n;ij3<tp_k;ij3++) s_po+='<li>'+tp_telo(ij3)+'</li><p>';s_po+='</ol>';return s_po;}
//=================================================================================================
function tp_to4(tp_n,tp_k){ s_po='<ol>';for(ij4=tp_n;ij4<tp_k;ij4++) s_po+='<li>'+tp_telo(ij4)+'</li><p>';s_po+='</ol>';return s_po;}

//=================================================================================================
function tp_ts(tp_n,tp_k){ s_pp='';for(iii=tp_n;iii<tp_k;iii++) s_pp+=tp_telo(iii)+'<p>';return s_pp;}
//=================================================================================================
function ar_text(ar_t_n,ar_t_k){ s_pp='';for(i=ar_t_n;i<ar_t_k;i++) s_pp+=array_text[nm][nr-1][np][i];return s_pp;}
//=================================================================================================
function ts_t(ts_n,ts_k,n_text){ s_pp='';for(i=ts_n;i<ts_k;i++) s_pp+=array_text[nm][nr-1][np][n_text]+ts_telo(i);return s_pp; }
//=================================================================================================
function ts_tn(ts_n,ts_k,n_text_n){s_pp='';for(i=ts_n;i<ts_k;i++){s_pp+=array_text[nm][nr-1][np][n_text_n]+ts_telo(i); n_text_n++; }return s_pp;}
//=================================================================================================
function tnow_t(){ s_pp='';for(i=ar_now.length/3;i>0;i--) s_pp+=tn_telo(0,i)+'<p>';return s_pp;}
//=================================================================================================
function tym_tn(){ s_pp='';for(i=0;i<3;i++) s_pp+=tym_telo(i);return s_pp;}
//=================================================================================================
function tp_up(nomer_tp_up){return ar_tp_up[nm-0][nr-1][np-0][nomer_tp_up];}
//=================================================================================================
function ts_intt(nomer_ts_up){ s_pp='';for(rit=0;rit<nomer_ts_up;rit++) s_pp+=ts_int(rit);return s_pp;}
//=================================================================================================
//=================================================================================================
//=================================================================================================
osnova_razvernuta=false;
odin_na_stranice=false;
//=================================================================================================
ar_np_1=
[
    [
        [
            [
                1
            ]
            ,[
                1
                ,7

            ]
            ,[
                7,
                23,
                3,
                3,
                0,
                0
            ]    
            ,[
                
            ]    
        ]
        ,[0,0,0,4]

    ]

]
//=================================================================================================

//=================================================================================================
function Sait_load() {
    
    if(localStorage.getItem('odin')){}else
        localStorage.setItem('odin',0);//0-не один,1-один на странице,2-один на сайте
    odin=localStorage.getItem('odin');
    if (localStorage.getItem('nm')) { }else
    localStorage.setItem('nm', 0);//nomer_menu (p_m)
    
    if (localStorage.getItem('nr')){}else 
        localStorage.setItem('nr', 1);//nomer_razdela_v_menu (r_p)
    if (localStorage.getItem('np')) { } else
        localStorage.setItem('np', 0);//nomer_punkta_v_razdele (n_r)
    if(localStorage.getItem('np_1')){}else
    localStorage.setItem('np_1',0);//nomer_paragraf_1_v_punkte
    if(localStorage.getItem('np_2')){}else
    localStorage.setItem('np_2',0);//nomer_paragraf_2_v_punkte
    if(localStorage.getItem('np_3')){}else
    localStorage.setItem('np_3',0);//nomer_paragraf_3_v_punkte
    localStorage.setItem('nn', 1);//nomer_name
    nm=localStorage.getItem('nm');
    nr=localStorage.getItem('nr');
    np=localStorage.getItem('np');

    np_1=localStorage.getItem('np_1');
    np_2=localStorage.getItem('np_2');
    np_3=localStorage.getItem('np_3');
    
    if(localStorage.getItem('nom_t')){}else
        localStorage.setItem('nom_t',0);//номер выбранной розовой полоски

    nom_t=localStorage.getItem('nom_t');
    if(localStorage.getItem('dz')){}else
        localStorage.setItem('dz',0);//номер дизайна сайта
    dz=localStorage.getItem('dz')-0;
    dz=0;
    
if(localStorage.getItem('not')){}else
    localStorage.setItem('not',0);

    if(odin==2){
        
        osnova.style.fontSize='36px';
        osnova.style.wordSpacing='10px';
        osnova.style.textIndent='30px';
        osnova.innerHTML='<table id="porydok"><tr><td><p><div id="zagol"></div><p></td></tr><tr><td><div id="knopki_os"></div></td></tr><tr><td><br/><div id="text_osnov"></div><br/></td></tr><tr><td><div id="knopki_os_2"></div></td></tr></table>';
        knopki_os.innerHTML='<span id="kn_tp_na_str_1"onmouseover="on_kn_tp_na_str(1,1)"onmouseout="on_kn_tp_na_str(2,1)"onmousedown="on_kn_tp_na_str(4,1)"><b>< Назад</b></span><span id="kn_tp_na_str_2"onmouseover="on_kn_tp_na_str(1,2)"onmouseout="on_kn_tp_na_str(2,2)"onmousedown="on_kn_tp_na_str(4,2)"><b>Вперёд ></b></span><span id="kn_tp_na_str_3"onmouseover="on_kn_tp_na_str(1,3)"onmouseout="on_kn_tp_na_str(2,3)"onmousedown="on_kn_tp_na_str(4,3)"><b>^ В раздел</b></span><span id="kn_tp_na_str_4"onmouseover="on_kn_tp_na_str(1,4)"onmouseout="on_kn_tp_na_str(2,4)"onmousedown="on_kn_tp_na_str(4,4)"><b>Свернуть</b></span>';
        knopki_os_2.innerHTML='<span id="kn_tp_na_str_5"onmouseover="on_kn_tp_na_str(1,5)"onmouseout="on_kn_tp_na_str(2,5)"onmousedown="on_kn_tp_na_str(4,5)"><b>< Назад</b></span><span id="kn_tp_na_str_6"onmouseover="on_kn_tp_na_str(1,6)"onmouseout="on_kn_tp_na_str(2,6)"onmousedown="on_kn_tp_na_str(4,6)"><b>Вперёд ></b></span><span id="kn_tp_na_str_7"onmouseover="on_kn_tp_na_str(1,7)"onmouseout="on_kn_tp_na_str(2,7)"onmousedown="on_kn_tp_na_str(4,7)"><b>^ В раздел</b></span><span id="kn_tp_na_str_8"onmouseover="on_kn_tp_na_str(1,8)"onmouseout="on_kn_tp_na_str(2,8)"onmousedown="on_kn_tp_na_str(4,8)"><b>Свернуть</b></span>';
        zagol.style.width=osnova.clientWidth;
        zagol.style.visibility='visible';
        zagol.innerHTML='<big><center ><b>'+(np_1>0?'<span style="color:green">'+(np_3>0?ar_ym[np_1-1][1]+' /</br></span><span style="color:orange">'+ar_tp[nm][nr-1][np_1-1][np_2-1][0]+' / Изделие '+np_3:'Один из умельцев')+'</span>':'<big><span style="color:red">'+array_menu[(nm-0)+1][nr-1]+' /</span> <br/><span style="color:green">'+array_razd_p[nm][nr-1][np]+' / </span><br/></big>'+ ar_tp[nm][nr-1][np][nom_t][0])+'</b></center></big><p>';
        zagol.style.left=Math.floor((osnova.clientWidth-zagol.clientWidth)/2)+'px';
        osnova.style.backgroundColor=bob.style.backgroundColor='white';
       
        kn_tp_na_str_1.style.left=kn_tp_na_str_5.style.left='5px';
        kn_tp_na_str_2.style.left=kn_tp_na_str_6.style.left=kn_tp_na_str_1.clientWidth+10+'px';

        kn_tp_na_str_4.style.right=kn_tp_na_str_8.style.right='5px';

        kn_tp_na_str_3.style.right=kn_tp_na_str_7.style.right=kn_tp_na_str_4.clientWidth+10+'px';
        kn_tp_na_str_1.style.top=kn_tp_na_str_2.style.top=kn_tp_na_str_3.style.top=kn_tp_na_str_4.style.top=zagol.clientHeight+30+'px';
        kn_tp_na_str_5.style.bottom=kn_tp_na_str_6.style.bottom=kn_tp_na_str_7.style.bottom=kn_tp_na_str_8.style.bottom='10px';
        if(osnova.clientWidth<kn_tp_na_str_1.clientWidth+kn_tp_na_str_2.clientWidth+kn_tp_na_str_3.clientWidth+kn_tp_na_str_4.clientWidth+25){
            kn_tp_na_str_1.innerHTML=kn_tp_na_str_5.innerHTML='<';
            kn_tp_na_str_2.innerHTML=kn_tp_na_str_6.innerHTML='>';
            kn_tp_na_str_3.innerHTML=kn_tp_na_str_7.innerHTML='^';
        }
        text_osnov.style.width=osnova.clientWidth-50+'px';
        text_osnov.style.marginLeft='20px';
        text_osnov.style.marginRight='30px';
                       
        if(np_1!=0){
if(np_2!=0){                switch(np_2){
                    case 1:
                        text_osnov.innerHTML=chel_rab(np_1-1,np_3-1);
                        
                    break;
                    case 2:
                        text_osnov.innerHTML=chel_yr(np_1-1,np_3-1);
                    break;
                    case 3:
                        text_osnov.innerHTML =chel_inter(np_1-1,np_3-1);
                    break;
                    case 4:
                        text_osnov.innerHTML=chel_all_yr(np_1-1);
                    break;
                }
            }else
                    text_osnov.innerHTML=chel(np_1-1);
                
        }else text_osnov.innerHTML=on_tp_t(nom_t-0);
        //ar_tp[nm][nr-1][np][nom_t];


        text_osnov.style.top=zagol.clientHeight+kn_tp_na_str_1.clientHeight+50+'px';
        porydok.style.height=zagol.clientHeight+text_osnov.clientHeight+200+'px';
        

        osnova.style.height=porydok.clientHeight+200+'px';
        
        osnova.innerHTML=porydok.innerHTML;
        
    }else{

        osnova.innerHTML='<div id="in_load_1"></div><div id="in_load_2"></div><table id="stranica"valign="top" onmousemove="stranica_izmen(3)" onmousedown="stranica_izmen(4)" onmouseup="stranica_izmen(5)"><tr><td><div id="knopki_os"></div></td></tr><tr><td><table id="text_stranici"><tr><td><div id="t_s" class="tm"></div></td></tr></table></td></tr><tr><td><div id="knopki_os_2"></div></td></tr></table><div id="in_load_3"></div><div id="in_load_4"></div>';
        knopki_os.innerHTML='<span id="kn_tp_na_str_1"onmouseover="on_kn_tp_na_str(1,1)"onmouseout="on_kn_tp_na_str(2,1)"onmousedown="on_kn_tp_na_str(4,1)"><b>< Назад</b></span><span id="kn_tp_na_str_2"onmouseover="on_kn_tp_na_str(1,2)"onmouseout="on_kn_tp_na_str(2,2)"onmousedown="on_kn_tp_na_str(4,2)"><b>Вперёд ></b></span><span id="kn_tp_na_str_3"onmouseover="on_kn_tp_na_str(1,3)"onmouseout="on_kn_tp_na_str(2,3)"onmousedown="on_kn_tp_na_str(4,3)"><b>^ В раздел</b></span><span id="kn_tp_na_str_4"onmouseover="on_kn_tp_na_str(1,4)"onmouseout="on_kn_tp_na_str(2,4)"onmousedown="on_kn_tp_na_str(4,4)"><b>Развернуть</b></span>';
        knopki_os_2.innerHTML='<span id="kn_tp_na_str_5"onmouseover="on_kn_tp_na_str(1,5)"onmouseout="on_kn_tp_na_str(2,5)"onmousedown="on_kn_tp_na_str(4,5)"><b>< Назад</b></span><span id="kn_tp_na_str_6"onmouseover="on_kn_tp_na_str(1,6)"onmouseout="on_kn_tp_na_str(2,6)"onmousedown="on_kn_tp_na_str(4,6)"><b>Вперёд ></b></span><span id="kn_tp_na_str_7"onmouseover="on_kn_tp_na_str(1,7)"onmouseout="on_kn_tp_na_str(2,7)"onmousedown="on_kn_tp_na_str(4,7)"><b>^ В раздел</b></span><span id="kn_tp_na_str_8"onmouseover="on_kn_tp_na_str(1,8)"onmouseout="on_kn_tp_na_str(2,8)"onmousedown="on_kn_tp_na_str(4,8)"><b>Развернуть</b></span>';
        knopki_os.style.fontSize=knopki_os_2.style.fontSize='22px';
        if(stranica.clientWidth<kn_tp_na_str_1.clientWidth+kn_tp_na_str_2.clientWidth+kn_tp_na_str_3.clientWidth+kn_tp_na_str_4.clientWidth+25){
            kn_tp_na_str_1.innerHTML=kn_tp_na_str_5.innerHTML='<';
            kn_tp_na_str_2.innerHTML=kn_tp_na_str_6.innerHTML='>';
            kn_tp_na_str_3.innerHTML=kn_tp_na_str_7.innerHTML='^';
        }
        kn_tp_na_str_1.style.left=kn_tp_na_str_5.style.left='-2px';
        kn_tp_na_str_2.style.left=kn_tp_na_str_6.style.left=kn_tp_na_str_1.clientWidth+10+'px';
        kn_tp_na_str_4.style.right=kn_tp_na_str_8.style.right='-2px';
        kn_tp_na_str_3.style.right=kn_tp_na_str_7.style.right=kn_tp_na_str_4.clientWidth+10+'px';
        kn_tp_na_str_5.style.bottom=kn_tp_na_str_6.style.bottom=kn_tp_na_str_7.style.bottom=kn_tp_na_str_8.style.bottom='2px';

        if(odin==1){
        text_stranici.style.paddingTop='30px';
        kn_tp_na_str_1.style.visibility=kn_tp_na_str_2.style.visibility=kn_tp_na_str_3.style.visibility=kn_tp_na_str_4.style.visibility=kn_tp_na_str_5.style.visibility=kn_tp_na_str_6.style.visibility=kn_tp_na_str_7.style.visibility=kn_tp_na_str_8.style.visibility='visible';
        }else{
        kn_tp_na_str_1.style.visibility=kn_tp_na_str_2.style.visibility=kn_tp_na_str_3.style.visibility=kn_tp_na_str_4.style.visibility=kn_tp_na_str_5.style.visibility=kn_tp_na_str_6.style.visibility=kn_tp_na_str_7.style.visibility=kn_tp_na_str_8.style.visibility='hidden';
        }


    
    

    razd=1;
    
    //---------------------------------------------------------------------------------------------
    if(localStorage.getItem('ok_r')){}else
        localStorage.setItem('ok_r',270);//размер панели с окнами
    ok_r=localStorage.getItem('ok_r');

    if(osnova_razvernuta!=true) pamyt_resurs=['','','#306090',30,0,20,-2,-2,110,140,-2,-2];//запоминает t_s.innerHTML, osnova.заднийфон, fontSize, wordSpacing, textIndent, кнопки на t_s значение top у 4-х, bottom у оставшихся, и поочередно left и right
    bob.style.overflowX = 'hidden';
    
    bob.style.backgroundColor=osnova.style.backgroundColor = '#306090';

    arra='';
    metka_chet=0;
    interes_chet=0;
    
    
    gl_p_aktiv=false;//true;
    gl_p_vibor=false;

    form_text_aktiv=false;
    form_shetchik=0;
    form_text_palka='|';
    form_text_palka_plus=false;
    name_chel_form_text='';
    id_form=document.getElementById('form_'+0);
    nomer_f_text_cop=0;
    on_str_nazad=false;
    tp_text=tp_str=tp_str_p=tr_text=tr_str=ts_text=ts_str=tm_text=tm_str=ti_text=ti_str='';
interes_on=metka_on=false;
    okna_width = 20; 
    pamyt_p_0_0_3 = 0;
    pamyt_metka=pamyt_interes=0;
    ym_nomer=1;
chel_kolvo_p=0;
dat=new Date();
//---------------------------------------------------------------------------------------------
    //тень страницы
    in_load_2.innerHTML = "<div id='ten_stranici'></div><div id='ten'></div>";
 
    //---------------------------------------------------------------------------------------------
    //кнопка для возвращения назад на верх страницы и содержимое раздела по пунктам
      //---------------------------------------------------------------------------------------------
    //вызов функции SODERG_RAZDELA_? для каждого дизайна DZ свой
    
    switch(dz){
        case 1:soderg_razdela_1();break;
        default:soderg_razdela_0();break;
    }
    //smena_var=0;

   //не использовать!!!! setTimeout('soderg_razdela_'+dz+'()',0);
    
    //---------------------------------------------------------------------------------------------
    //---------------------------------------------------------------------------------------------
   // bob.innerHTML='ff';
    //---------------------------------------------------------------------------------------------
    str="";
    //---------------------------------------------------------------------------------------------
    //тень под названием раздела
    str += "<div id='razdel_teni'></div>";
    //---------------------------------------------------------------------------------------------
    //название раздела
    str += "<div id='razdel'></div>";
    //---------------------------------------------------------------------------------------------
    
    
    //помошник

    str += "<div id='ten_line_pomoshnik'></div>";

    str += "<span id='pomoshnik'></span><hr id='line_pomoshnik' color='#80b0ff' />";

    //предупреждение
    str += "<span id='ten_kn_prydki'></span><span id='kn_prydki'onmouseover='kn_prydki_(1)'onmouseout='kn_prydki_(2)'onmousedown='kn_prydki_(4)'></span>";
    //---------------------------------------------------------------------------------------------
    //список содержимого раздела
    str += "<div id='okna'onmousemove='panel_izmen(3)'onmousedown='panel_izmen(4)'onmouseup='panel_izmen(5)'> ";
    //---------------------------------------------------------------------------------------------
    //кнопки на 3 окне 
    str_plus = "<td id='na_meste_3'class='c_okno_knopki'onmouseover = 'kn_okna_videlen(1,5)' onmouseout = 'kn_okna_videlen(2,5)'onmousedown='kn_okna_videlen(4,5)'><span id='na_meste_3_a'class='c_na_meste_a'></span><span id='na_meste_3_b'class='c_na_meste_b'></span><span id='na_meste_3_c'class='c_na_meste_c'></span></td>";
    str_plus += "<td id='svert_3'class='c_okno_knopki'onmouseover = 'kn_okna_videlen(1,2)' onmouseout = 'kn_okna_videlen(2,2)'onmousedown='kn_okna_videlen(4,2)'><span id='svert_3_a'class='c_svert_a'></span><span id='svert_3_b'class='c_svert_b'></span></td>";
    //свет и тень на заголовке 3 окна 
    str_plus += "<td><span id='svet_3_okna'class='c_svet_okna'></span><span id='ten_3_okna'class='c_ten_okna'></span></td>";
    //3 дополнительное окошко с закладками
    str += "<table id='okno_zametki' class='c_okno'onmousemove='okno_izmen(2,3)'onmousedown='okno_izmen(2,4)'onmouseup='okno_izmen(2,5)'><tr><td id='okno_name_zametki'class='c_okno_name'></td>" + str_plus + "</tr><tr><td id='okno_text_zametki' class='c_okno_text'></td></tr></table>";
    //свет и тень на заголовке 2 окна
    str_plus = "<td><span id='svet_2_okna'class='c_svet_okna'></span><span id='ten_2_okna'class='c_ten_okna'></span></td>";
    //2 дополнительное окошко с новостями
    str += "<table  id='okno_novosti' class='c_okno'onmousemove='okno_izmen(1,3)'onmousedown='okno_izmen(1,4)'onmouseup='okno_izmen(1,5)'><tr><td id='okno_name_novosti'class='c_okno_name'></td>" + str_plus + "</tr><tr><td id='okno_text_novosti' class='c_okno_text'></td></tr></table>";
    //свет и тень на заголовке 1 окна
    str_plus = "<td><span id='svet_1_okna'class='c_svet_okna'></span><span id='ten_1_okna'class='c_ten_okna'></span></td>";
    //1 дополнительное окошко с беседами
    str += "<table id='okno_besedi' class='c_okno'onmousemove='okno_izmen(0,3)'onmousedown='okno_izmen(0,4)'onmouseup='okno_izmen(0,5)'><tr><td id='okno_name_besedi'class='c_okno_name'></td>" + str_plus + "</tr><tr><td id='okno_text_besedi' class='c_okno_text'></td></tr></table>";
    str += "</div>";
    //---------------------------------------------------------------------------------------------
    //тень содержимого раздела 2
    
    
       //---------------------------------------------------------------------------------------------
    //кнопка для двищения оконной панели
    str += "<div id='dvigenie_paneli'onmouseover='kn_dvig_panel(1)'onmouseout='kn_dvig_panel(2)'onmousemove='kn_dvig_panel(3)'onmousedown='kn_dvig_panel(4)'onmouseup='kn_dvig_panel(5)'><div id='dvig_ris'></div></div>";
    //---------------------------------------------------------------------------------------------
    //тень верхней полоски меню
    str += "<div id='ten_menu'></div>";
    //---------------------------------------------------------------------------------------------
    //тени названия сайта
    str += "<div id='name_sait1_teni' ></div><div id='name_sait2_teni'style='filter:blur(7px)'></div>";
    //название сайта
    str += "<div id='name_sait1'></div><div id='name_sait2'></div>";
    //---------------------------------------------------------------------------------------------
    
    //шпоргалки
    str += "<div id='shporgalki'class='shpora_v'><big>Шпорка</big></div>";
    //---------------------------------------------------------------------------------------------
    //верхняя полоска меню
    str += "<table><tr><td id='menu_line'onmouseout = 'menu_(2,0,0)'><table id = 'menu' onmouseout = 'menu_(2,0,0)'><tr><td id = 'm_g' class='c_m_g' onmouseover = 'menu_(1,0,0)' onmouseout = 'menu_(2,0,0)' onmousemove='menu_(3,0,0)'></td ><td id='m_razdelitel'align='center'>|</td><td id='m_y' class='c_m_g' onmouseover='menu_(1,0,1)' onmouseout='menu_(2,0,1)'onmousemove='menu_(3,0,1)'></td><td align='center'>|</td><td id='m_os' class='c_m_g' onmouseover='menu_(1,0,2)' onmouseout='menu_(2,0,2)'onmousemove='menu_(3,0,2)'></td><td align='center'>|</td><td id='m_s' class='c_m_g' onmouseover='menu_(1,0,3)' onmouseout='menu_(2,0,3)'onmousemove='menu_(3,0,3)'></td></tr></table ></td></tr></table>";
    
    //---------------------------------------------------------------------------------------------
    //развёрнутые списки менюшек
    str += "<div id='m1'></div><div id='m2'></div><div id='m3'></div><div id='m4'></div>";
    //---------------------------------------------------------------------------------------------
    
    //кнопка для возвращения назад на верх страницы
    switch(dz){
        case 1: str += "<div id='ten_kn_nazad'></div><div id='kn_nazad'onmouseover='kn_nazad_1(1)'onmouseout='kn_nazad_1(2)'onmousedown='kn_nazad_1(4)'></div>";break;
        default: str += "<div id='ten_kn_nazad'></div><div id='kn_nazad'onmouseover='kn_nazad_0(1)'onmouseout='kn_nazad_0(2)'onmousedown='kn_nazad_0(4)'></div>";break;
    }
    //---------------------------------------------------------------------------------------------
    //создание кнопок, окон для метки и интеса
    str +="<div id='ten_interes'></div><div id='interes_div'></div><canvas id='interes_treug'></canvas><div id='ten_metka'></div><div id='metka_div'></div><canvas id='metka_treug'></canvas>";
    //---------------------------------------------------------------------------------------------
    
    in_load_4.innerHTML = '<table><tr><td>'+str+'</td></tr></table>';
    //bob.innerHTML='yy';
    //---------------------------------------------------------------------------------------------
    if (screen.width < screen.height) {

    }
   //////
    //svet_nadpisi_1.style.visibility=svet_nadpisi_2.style.visibility=svet_nadpisi_3.style.visibility='hidden';
    
    minus = plus = 0;
    okgran = 45;
    //---------------------------------------------------------------------------------------------
    //  if (localStorage.getItem('w_s')) { } else localStorage.setItem('w_s', 650);//width_soderganiy_razdela
    //---------------------------------------------------------------------------------------------
   
        if(localStorage.getItem('svo')){}else
        localStorage.setItem('svo',1);//содержание раздела + выбранная страница + один = true-0 + false-1
        svo=localStorage.getItem('svo');
    //---------------------------------------------------------------------------------------------
    
    ogl_vibrono = localStorage.getItem('np');
    
    
  // }   
    pamyt_istorii='<p>'+tistor_telo(localStorage.getItem('nn'));
    localStorage.setItem('nn', localStorage.getItem('nn') - 0 + 1);

//    nomer_str_nazad=0;
//////
    //n_str_nazad();
    //---------------------------------------------------------------------------------------------
    okna.style.width=ok_r+'px';
    okno_besedi.style.width=okno_novosti.style.width=okno_zametki.style.width=ok_r-30+'px';
    dvigenie_paneli.style.left=osnova.clientWidth-okna.clientWidth-27+'px';
    document.getElementById('t_s').style.display = 'block';
    if (okna.clientWidth < 130) {
        peremeshenie_okon_svernut = true;
    } else {
        peremeshenie_okon_svernut = false;
    }
    if (scrollY > 150) okno_top = 60; else okno_top = 210 - scrollY;
    
    //---------------------------------------------------------------------------------------------
    if (localStorage.getItem('o_b')) { } else
        localStorage.setItem('o_b', 250);//okno_besedi
    if (localStorage.getItem('o_n')) { } else
        localStorage.setItem('o_n', 250);//okno_novosti
    if (localStorage.getItem('o_z')) { } else
        localStorage.setItem('o_z', 250);//okno_zametki
    //---------------------------------------------------------------------------------------------
     
    okno_besedi.style.height = localStorage.getItem('o_b');
    okno_novosti.style.height = localStorage.getItem('o_n');
    okno_zametki.style.height = localStorage.getItem('o_z');
    //---------------------------------------------------------------------------------------------
    if (innerHeight < okno_top + okno_besedi.clientHeight + okno_novosti.clientHeight + okno_zametki.clientHeight + 30) okna_umen();
    //---------------------------------------------------------------------------------------------
    perem = okno_top;
    okb = perem;
    okno_besedi.style.top = perem + 'px';
    perem += okno_besedi.clientHeight + 10;
    okn = perem;
    okno_novosti.style.top = perem + 'px';
    perem += okno_novosti.clientHeight + 10;
    okz = perem;
    okno_zametki.style.top = perem + 'px';
    //---------------------------------------------------------------------------------------------
    limit = 270;
    okna.style.height = osnova.clientHeight+'px';//limit + stranica.clientHeight + 'px';
    //---------------------------------------------------------------------------------------------
    soderg_width = 650;
    soderg_left=70;
    soderg_del = (650) / 10;
    //---------------------------------------------------------------------------------------------
   na_meste_3.style.right = '40px';
    svert_3.style.right = '10px';
    /////
okno_name_besedi.innerHTML = 'Беседы';
    okno_name_novosti.innerHTML = 'Новости';
    okno_name_zametki.innerHTML = 'Заметки';
    
    //---------------------------------------------------------------------------------------------
    stranica.style.width = innerWidth - 152 - okna.clientWidth + 'px';
    ten_stranici.style.width = stranica.clientWidth + 'px';
    //---------------------------------------------------------------------------------------------
    stranica_top = 220;
    if(odin==0) {text_stranici.style.paddingTop = gl_p.clientHeight - 20 + 'px';}
    
    //---------------------------------------------------------------------------------------------
    if(nm==0&&nr==3&&(np>-1&&np<3)&&np_1>0){}else{
    
    }
    //---------------------------------------------------------------------------------------------
//    na_meste_3.style.right = '40px';
//    svert_3.style.right = '10px';
    
    
    //---------------------------------------------------------------------------------------------
    if (innerHeight < 840) okno_besedi.style.height = okno_novosti.style.height = okno_zametki.style.height = (innerHeight - 240) / 3 + 'px';
    //---------------------------------------------------------------------------------------------
    perem = 0;
   
    
    //// -------------УРА!!!! Зделала ;) -------------------
    if(odin!=0){
        if(odin==1){
            tex=document.getElementById('t_s');
        }else{
            tex=document.getElementById('text_osnov');
        }
        if(np_1!=0){
        if(np_3>0){
            switch(np_2){
                case 1:
                    tex.innerHTML=chel_rab(np_1-1,np_3-1);
                    
                break;
                case 2:
                    tex.innerHTML=chel_yr(np_1-1,np_3-1);
                break;
                case 3:
                    tex.innerHTML =chel_inter(np_1-1,np_3-1);
                break;
                case 4:
                    tex.innerHTML=chel_all_yr(np_1-1);
                break;
            }
        
            
            
        }
        else{ 
            if(np_2>0)tex.innerHTML = chel_all_yr(localStorage.getItem('np_1'));
            else tex.innerHTML = chel(localStorage.getItem('np_1'-1));
        }
    }else tex.innerHTML=on_tp_t(nom_t-0);


        
    }else{

        text_str();

    }
    localStorage.setItem('nom_t',nom_t-0);
    up();
    //---------------------------------------------------------------------------------------------
    //имя с тенью раздела сайта на который перешли
    if(odin!=0){
    
        
        if(nm==0&&nr==3)document.getElementById('razdel_teni').innerHTML = document.getElementById('razdel').innerHTML =ar_ym[np_1-1][1];
        else{
             document.getElementById('razdel_teni').innerHTML = document.getElementById('razdel').innerHTML =array_menu[(nm-0)+1][nr-1]+' / <br/>'+array_razd_p[nm][nr-1][np]+' / <br/><small>'+ ar_tp[nm][nr-1][np][nom_t][0]+'</small>'; 
        ten_stranici.style.top=stranica.style.top= razdel.offsetTop+razdel.clientHeight+10+'px';
        }
        //document.getElementById('razdel_teni').innerHTML = document.getElementById('razdel').innerHTML ='Один из умельцев';
    }else document.getElementById('razdel_teni').innerHTML = document.getElementById('razdel').innerHTML = array_menu[localStorage.getItem('nm') - 0 + 1][localStorage.getItem('nr') - 1];
    //---------------------------------------------------------------------------------------------
    //---------------------------------------------------------------------------------------------
    pomoshnik.innerHTML = "<span id='ten_pomoshnika'></span><span id='telo'></span><span id='svet_tela'></span><span id='glaz_l'></span><span id='glaz_r'></span><span id='guba'></span>";
    glaz_l.innerHTML = "<span id='svet_glaz_l' class='c_svet_glaz'></span><span id='sheka_l'></span>";
    glaz_r.innerHTML = "<span id='svet_glaz_r' class='c_svet_glaz'></span><span id='sheka_r'></span>";
    guba.innerHTML = "<span id='guba_1'></span><span id='guba_2'></span>";
    //---------------------------------------------------------------------------------------------
    guba_2.style.visibility = 'hidden';
    //---------------------------------------------------------------------------------------------
    kn_prydki.innerHTML = '<';
    kn_prydki.style.top = innerHeight - 64 + 'px';
    ten_kn_prydki.style.top = innerHeight - 60 + 'px';
    ten_kn_prydki.style.visibility = kn_prydki.style.visibility = 'hidden';
    //---------------------------------------------------------------------------------------------
    //кнопка для возвращения назад на верх страницы
    kn_nazad.innerHTML = '^';
    ten_kn_nazad.style.visibility = kn_nazad.style.visibility = 'hidden';
    ten_kn_nazad.style.left = kn_nazad.style.left =osnova.clientWidth- ok_r-30 + 'px';
    ten_kn_nazad.style.top = kn_nazad.style.top = innerHeight - 80 + 'px';
    //---------------------------------------------------------------------------------------------
   
    localStorage.setItem('l_p', 0);  //left_pomoshnik
    pomoshnik_go(0);
   
    ten_line_pomoshnik.style.top=innerHeight-60+'px';
    line_pomoshnik.style.top=innerHeight-73+'px';
    //---------------------------------------------------------------------------------------------
    name_sait1.innerText = array_name_sait[0];
    name_sait1_teni.innerText = array_name_sait[0];
    name_sait2.innerText = array_name_sait[1];
    name_sait2_teni.innerText = array_name_sait[1];
    ns_a = 2; ns_b = 1; ns_i = 0;
    ns_c = ns_d = 0;
    //---------------------------------------------------------------------------------------------
    m_g.innerHTML = array_menu[0][0];
    m_y.innerHTML = array_menu[0][1];
    m_os.innerHTML = array_menu[0][2];
    m_s.innerHTML = array_menu[0][3];
    //---------------------------------------------------------------------------------------------
   
    osnova_razvernuta=false;
    
    setTimeout('sait_load_dopolnit()', 10);
    }    
}

//=================================================================================================
function sait_load_dopolnit() {
    menu_width = 280;
    m1_left = 22; m2_left = m1_left + m_g.clientWidth + m_razdelitel.clientWidth + 4; m3_left = m2_left + m_y.clientWidth + m_razdelitel.clientWidth + 4; m4_left = m3_left + m_os.clientWidth + m_razdelitel.clientWidth + 4; m_b = 1;
    ms = [["m_g", 8, m1_left, 4], ["m_y", 24, m2_left, 6], ["m_os", 4, m3_left, 2], ["m_s", 4, m4_left, 2]];
    //---------------------------------------------------------------------------------------------
    str = "<div id='ten_m'></div>";
    str += "<div id='m_g_0'class='c_m_o'onmouseover='menu_(1,1,0)'onmouseleave='menu_(2,1,0)'>"
    for (i = 1; i < ms[0][1]; i++)str += "<div id='m_g_" + i + "'class='c_m'onmouseover='menu_(1," + (i + 1) + ",0)'onmouseout='menu_(2," + (i + 1) + ",0)'onclick='menu_(4," + (i + 1) + ",0)'></div>";
    str += "<hr id='m_g_l_0'class='c_m_line_0'color='black'size='1'/><hr id='m_g_l_1'class='c_m_line_1'color='white'size='1'/><hr id='m_g_l_2'class='c_m_line_2'color='black'size='1'/><hr id='m_g_l_3'class='c_m_line_3'color='white'size='1'/></div>";
    m1.innerHTML = str;
    for (i = 0; i < ms[0][1] - 1; i++)document.getElementById(ms[0][0] + '_' + (i + 1)).innerText = array_menu[1][i];
    //---------------------------------------------------------------------------------------------
    str = "<div id='m_y_0'class='c_m_o'onmouseover='menu_(1,1,1)'onmouseout='menu_(2,1,1)'>"
    for (i = 1; i < ms[1][1]; i++)str += "<div id='m_y_" + i + "'class='c_m'onmouseover='menu_(1," + (i + 1) + ",1)'onmouseout='menu_(2," + (i + 1) + ",1)'onclick='menu_(4," + (i + 1) + ",1)'></div>";
    str += "<hr id='m_y_l_0' class='c_m_line_0' color='black' size='1'/><hr id='m_y_l_1' class='c_m_line_1' color='white' size='1'/><hr id='m_y_l_2'class='c_m_line_4' color='black' size='1'/><hr id='m_y_l_3'class='c_m_line_5' color='white' size='1'/><hr id='m_y_l_4'class='c_m_line_6' color='black' size='1'/><hr id='m_y_l_5'class='c_m_line_7' color='white' size='1'/></div > ";
    m2.innerHTML = str;
    for (i = 0; i < ms[1][1] - 1; i++)document.getElementById(ms[1][0] + '_' + (i + 1)).innerText = array_menu[2][i];
    //---------------------------------------------------------------------------------------------
    str = "<div id='m_os_0'class='c_m_o'onmouseover='menu_(1,1,2)'onmouseout='menu_(2,1,2)'>"
    for (i = 1; i < ms[2][1]; i++)str += "<div id='m_os_" + i + "'class='c_m'onmouseover='menu_(1," + (i + 1) + ",2)'onmouseout='menu_(2," + (i + 1) + ",2)'onclick='menu_(4," + (i + 1) + ",2)'></div>";
    str += "<hr id='m_os_l_0' class='c_m_line_0' color='black' size='1'/><hr id='m_os_l_1' class='c_m_line_1' color='white' size='1'/></div > ";
    m3.innerHTML = str;
    for (i = 0; i < ms[2][1] - 1; i++)document.getElementById(ms[2][0] + '_' + (i + 1)).innerText = array_menu[3][i];
    //---------------------------------------------------------------------------------------------
    str = "<div id='m_s_0'class='c_m_o'onmouseover='menu_(1,1,3)'onmouseout='menu_(2,1,3)'>"
    for (i = 1; i < ms[3][1]; i++)str += "<div id='m_s_" + i + "'class='c_m'onmouseover='menu_(1," + (i + 1) + ",3)'onmouseout='menu_(2," + (i + 1) + ",3)'onclick='menu_(4," + (i + 1) + ",3)'></div>";
    str += "<hr id='m_s_l_0'class='c_m_line_0' color='black' size='1'/><hr id='m_s_l_1'class='c_m_line_1' color='white' size='1'/></div > ";
    m4.innerHTML = str;
    for (i = 0; i < ms[3][1] - 1; i++)document.getElementById(ms[3][0] + '_' + (i + 1)).innerText = array_menu[4][i];
    //---------------------------------------------------------------------------------------------
    for (j = 0; j < 4; j++) {
        m = [];
        for (i = 0; i < ms[j][1]; i++) { m[i] = document.getElementById(ms[j][0] + "_" + i); }
        m[0].style.height = (ms[j][1] - 1) * text_size + 'px';
        m[0].style.left = ms[j][2] + 'px';
        mm = document.getElementById(ms[j][0]).clientWidth;
        if (m[0].clientWidth <= mm) m[0].style.width = mm + 10 + 'px';
        t = 2;
        for (i = 1; i < m.length; i++) {
            m[i].style.top = t + 'px';
            t += text_size;
        }
    }
    m_i = 0;
    
    //---------------------------------------------------------------------------------------------
    //interes_treug.style.visibility='hidden';
     in_tr=interes_treug.getContext('2d');

      interes_treug.width=20;
    interes_treug.height=20;
    in_tr.beginPath();  
    in_tr.fillStyle='#ffefe0';
    in_tr.fillRect(10,2,1,2);
    in_tr.fillRect(9,4,2,2);
    in_tr.fillRect(8,6,3,2);
    in_tr.fillRect(7,8,5,2);
    in_tr.fillRect(6,10,6,2);
    in_tr.fillRect(5,12,8,2);
    in_tr.fillRect(4,14,9,2);
    in_tr.fillRect(3,16,11,2);
    in_tr.fillRect(2,18,12,2);
    
    in_tr.strokeStyle='#604020';
    
    in_tr.lineWidth=2;

    in_tr.moveTo(10,0);
    in_tr.lineTo(1,20);
    in_tr.moveTo(10,0);
    in_tr.lineTo(15,20);
    
in_tr.stroke();
    //---------------------------------------------------------------------------------------------
    //metka_treug.style.visibility='hidden';
    met_tr=metka_treug.getContext('2d');
    metka_treug.style.top='120px';
      metka_treug.width=20;
    metka_treug.height=20;
    met_tr.beginPath();  
    
    
    met_tr.fillStyle='#efffe0';
    met_tr.fillRect(10,2,1,2);
    met_tr.fillRect(9,4,2,2);
    met_tr.fillRect(8,6,3,2);
    met_tr.fillRect(7,8,5,2);
    met_tr.fillRect(6,10,6,2);
    met_tr.fillRect(5,12,8,2);
    met_tr.fillRect(4,14,9,2);
    met_tr.fillRect(3,16,11,2);
    met_tr.fillRect(2,18,12,2);
    met_tr.strokeStyle='#00a010';
    
    met_tr.lineWidth=2;

    met_tr.moveTo(10,0);
    met_tr.lineTo(1,20);
    met_tr.moveTo(10,0);
    met_tr.lineTo(15,20);
met_tr.stroke();

 
    //---------------------------------------------------------------------------------------------
    stranici_right = stranica_left + stranica.clientHeight;
    stranica_left_p = stranica_left;
    
    odin_na_stranice=false;
    /////
    //kn_stran_nazad_down=false;
    /////
    //kn_poisk_down=false;
    /////
    //kn_mneniy_down=false;
    shporgalki_id=0;

    paragraf_nomer=0;
    reshenie_nomer=0;
//ym_div_on=false;
    interes_on=false;
interes_nomer=0;
    metka_on=false;
    metka_nomer=0;
    metka_left=0;



    gl_p_vis_hidden = false;
    deform_okno_besedi_down = false;
    deform_okno_novosti_down = false;
    deform_okno_zametki_down = false;
    peremeshenie_okon_down = false;
    peremeshenie_okon_svernut = false;
    peremeshenie_okon_fiksaciy = 0;
    kn_prydki_skrita = true;
    kn_prydki_start = false;
    okna_svernuti = false;
    nachalo_napisano = false;
    staroe_x = innerWidth;
    staroe_y = innerHeight;
    peremeshenie_vniz = 0;
    posle_scroll = false;
    kn_nazad_vidna = false;

    
    //---группа перезаписана в файл s_0.js--- 
    dvig_pan_rabota = false;
    dvig_pan_del = 0;
    dvig_pan_variant = 0;
    dvig_pan_konec = osnova.clientWidth - 20;
    dvig_pan_index = 0;
    //---------------------------------------


    prydki_index = 0;
    prydki_variant = 0;
    prydki_rabota = false;
    prydki_del = 0;
    prydki_perem = 0;

    
    setTimeout('izmen_win()', 4);
    pom_etap_vipolnen = false;
    pom_etap = 1;
    pom_et_nomer = 0;


}
//=================================================================================================
function up() {
    osnova.style.height=(odin<2?t_s.clientHeight:zagol.clientHeight+text_osnov.clientHeight)+(odin>0?0:gl_p.clientHeight)+500+'px';
    if(osnova.clientHeight<innerHeight){osnova.style.height=innerHeight+'px';}
    if(odin<2){
        okna.style.height=osnova.clientHeight+scrollY+'px';
    ten_stranici.style.width=   stranica.style.width=(osnova.clientWidth/100)*60+'px';
    ten_stranici.style.height=stranica.clientHeight+'px';
}
}
//=================================================================================================

random_plus = 0;
function self_random(nachalo = 1, konec = 2) {
    d = new Date();
    otvet = konec - nachalo;
    otvet = nachalo + d.getSeconds() % otvet;
    return otvet;
}
//=================================================================================================
//=================================================================================================
//=================================================================================================
function menu_open(){
    if (m_g_0.style.visibility == 'visible') {
        if ((event.clientY<m_g_0.offsetTop&&(event.clientY<m_g.offsetTop||event.clientX<m_g.offsetLeft||event.clientX>m_g.offsetLeft+m_g.clientWidth))||event.clientY >m_g_0.offsetTop+m_g_0.clientHeight||event.clientX<m_g_0.offsetLeft||event.clientX>m_g_0.offsetLeft+m_g_0.clientWidth){
            menu_vis(0, 0); 
            m_g.style.backgroundColor = color_menu;
            m_g.style.color = 'black';
        }
    }else {
        if(event.clientY>m_g.offsetTop&&event.clientY<m_g.offsetTop+m_g.clientHeight&&event.clientX>m_g.offsetLeft&&event.clientX<m_g.offsetLeft+m_g.clientWidth) {
            menu_vis(0, 1);
            m_g.style.background=color_nadpisi;
            m_g.style.color=color_videl;
        }
    }
    if (m_y_0.style.visibility == 'visible') {
        if ((event.clientY<m_y_0.offsetTop&&(event.clientY<m_y.offsetTop||event.clientX<m_y.offsetLeft||event.clientX>m_y.offsetLeft+m_y.clientWidth))||event.clientY >m_y_0.offsetTop+m_y_0.clientHeight||event.clientX<m_y_0.offsetLeft||event.clientX>m_y_0.offsetLeft+m_y_0.clientWidth){
            menu_vis(1, 0);           
            m_y.style.backgroundColor = color_menu;
            m_y.style.color = 'black';
        }        
    } else {
        if(event.clientY>m_y.offsetTop&&event.clientY<m_y.offsetTop+m_y.clientHeight&&event.clientX>m_y.offsetLeft&&event.clientX<m_y.offsetLeft+m_y.clientWidth) {
            menu_vis(1, 1);
            m_y.style.background=color_nadpisi;
            m_y.style.color=color_videl;
        }
    }
    if (m_os_0.style.visibility == 'visible') { 
        if ((event.clientY<m_os_0.offsetTop&&(event.clientY<m_os.offsetTop||event.clientX<m_os.offsetLeft||event.clientX>m_os.offsetLeft+m_os.clientWidth))||event.clientY >m_os_0.offsetTop+m_os_0.clientHeight||event.clientX<m_os_0.offsetLeft||event.clientX>m_os_0.offsetLeft+m_os_0.clientWidth){
            menu_vis(2, 0);           
            m_os.style.backgroundColor = color_menu;
            m_os.style.color = 'black';
        } 
    } else {
        if(event.clientY>m_os.offsetTop&&event.clientY<m_os.offsetTop+m_os.clientHeight&&event.clientX>m_os.offsetLeft&&event.clientX<m_os.offsetLeft+m_os.clientWidth) {
            menu_vis(2, 1);
            m_os.style.background=color_nadpisi;
            m_os.style.color=color_videl;
        }
    }     
    if (m_s_0.style.visibility == 'visible') {
        if ((event.clientY<m_s_0.offsetTop&&(event.clientY<m_s.offsetTop||event.clientX<m_s.offsetLeft||event.clientX>m_s.offsetLeft+m_s.clientWidth))||event.clientY > m_s_0.offsetTop+m_s_0.clientHeight||event.clientX<m_s_0.offsetLeft||event.clientX>m_s_0.offsetLeft+m_s_0.clientWidth){
            menu_vis(3, 0);
            m_s.style.backgroundColor = color_menu;
            m_s.style.color = 'black';
        }
    } else {
        if(event.clientY>m_s.offsetTop&&event.clientY<m_s.offsetTop+m_s.clientHeight&&event.clientX>m_s.offsetLeft&&event.clientX<m_s.offsetLeft+m_s.clientWidth) {
            menu_vis(3, 1);
            m_s.style.background=color_nadpisi;
            m_s.style.color=color_videl;
        }
    }
}
//=================================================================================================
function menu_vis(id_el, deistvie) {
    if (deistvie == 0) deistvie = 'hidden'; else deistvie = 'visible';
    for (i = 0; i < ms[id_el][1]; i++) document.getElementById(ms[id_el][0] + '_' + i).style.visibility = deistvie;
    for (i = 0; i < ms[id_el][3]; i++) { document.getElementById(ms[id_el][0] + '_l_' + i).style.visibility = deistvie; }
    ten_m.style.height = (ms[id_el][1] - 1) * text_size - 5 + 'px';
    ten_m.style.left = ms[id_el][2] + 'px';
    ten_m.style.width = document.getElementById(ms[id_el][0] + '_0').clientWidth + 2 + 'px';
    ten_m.style.visibility = deistvie;
             
}
//=================================================================================================
function menu_(deistvie, nomer, idnomer) {
    //---------------------------------------------------------------------------------------------
    color_okna = "#a0d0ff";
    color_nadpisi = "#607090";
    color_videl = "#f0ffc0";
    color_menu = menu.style.backgroundColor;
    //---------------------------------------------------------------------------------------------
    m = [];
    event.returnValue = true;
    m[0] = document.getElementById(ms[idnomer][0]);
    for (i = 1; i < ms[idnomer][1] + 1; i++) m[i] = document.getElementById(ms[idnomer][0] + '_' + (i - 1));
    //---------------------------------------------------------------------------------------------
    switch (deistvie) {
        //-----------------------------------------------------------------------------------------
        case 1://over
         if (nomer <2) {
                m[1].style.cursor = 'pointer';
                m[0].style.backgroundColor = color_nadpisi;
                m[0].style.color = color_videl;
            }
            else m[nomer].style.backgroundColor = color_videl;
            break;
        //-----------------------------------------------------------------------------------------
        case 2://out
            if (nomer < 2) {
                m[0].style.cursor = 'default';
                m[0].style.color = 'black';
                m[0].style.backgroundColor = color_menu;
                if (event.clientY < 40) menu_vis(idnomer, 0);
            }
            else {
                m[nomer].style.backgroundColor = color_okna;
                m[nomer].style.color = 'black';
                if (event.clientY < 42)menu_vis(idnomer,0);
            }
            break;
        //-----------------------------------------------------------------------------------------
        
        //-----------------------------------------------------------------------------------------
        case 4://down
            m[nomer].style.backgroundColor = 'black';
            m[nomer].style.color = color_videl;
            if (idnomer < 4) nm=idnomer;
            nr=nomer-1;
            np=0;
            ogl_vibrono = 0;
            menu_vis(idnomer, 0);
            smena_rab=true;
            smena_var=0;
            gl_p_vibor=false;
            if(svo==1)smena_deistvie=1;
            else if(svo==2)smena_deistvie=2;
            else if(svo==3)smena_deistvie=3;
            ten_stranici.style.top=stranica.style.top='240px';
        odin=0;
        localStorage.setItem('odin',0);
            switch(dz){
        
                case 1:smena_stranic_1();break;
        default:smena_stranic_0();break;
    
    }
//odin_na_stranice=false;
            
            np_1=0;
            np_2=0;
            np_3=0;
            if (idnomer == 0 && nomer == 7) {
                nachalo_napisano = true;
            }
            break;
        //-----------------------------------------------------------------------------------------
    }
}
//=================================================================================================

//=================================================================================================
//=================================================================================================
//=================================================================================================

//=================================================================================================
//=================================================================================================
//=================================================================================================
function on_pamyt(nm, nr, np) {
    if (nm == 0 && nr == 6 && np == 0) { } else {
        
        pamyt_istorii="<p>" + tistor_telo(localStorage.getItem('nn')-0)+pamyt_istorii;
        array_text[0][5][0][0] =  nachalo_istorii+ pamyt_istorii;
        localStorage.setItem('nn', localStorage.getItem('nn') - 0 + 1);
        localStorage.setItem('nm', nm);
        localStorage.setItem('nr', nr);
        localStorage.setItem('np', np); 
       
    }
}
//=================================================================================================
function on_gl_p(deistvie_gl){

    switch(deistvie_gl){
        case 1://over
        break;
        case 2://out
        break;
        case 4://down
            if(svo==2){
                if(event.clientY<250+scrollY||event.clientX<70){
                    smena_deistvie=5;
                    smena_var=0;
switch(dz){
        case 1:smena_stranic_1();break;
        default:smena_stranic_0();break;
    
    }

                }
            }
        break;
    }
}
//=================================================================================================
function istoriy(){
    pamyt_istorii='<p>'+tistor_telo(localStorage.getItem('nn')-0)+pamyt_istorii;
    array_text[0][5][0][0] = nachalo_istorii+ pamyt_istorii;
    localStorage.setItem('nn', localStorage.getItem('nn') - 0 + 1);
}
//=================================================================================================
//=================================================================================================
//=================================================================================================

ar_form_vvod_text=['','',''];
//=================================================================================================
function on_form_text(nomer_f_text){
    
       if(form_text_aktiv){if(id_form.id!='form_'+nomer_f_text){
                form_text_aktiv=false;
                id_form.style.border='1px solid #105090';
                id_form.innerHTML=ar_form_vvod_text[nomer_f_text_cop];
                form_shetchik=0;
            }
       }
else            
        
        if(form_text_aktiv==false){
id_form=document.getElementById('form_'+nomer_f_text);        
                   
        id_form.style.border='2px solid blue';
        nomer_f_text_cop=nomer_f_text;
        
        form_text_aktiv=true;
      // bob.innerHTML='yra';
         form_shetchik=0;
        id_form.innerHTML=ar_form_vvod_text[nomer_f_text]+ form_text_palka;

   setTimeout('form_text_on()', 1);      
           
        }
 
   // bb=event.srcElement;
  

}
//=================================================================================================

function on_form_text_on()
{
    setTimeout('form_text_on()',2);

}
//=================================================================================================
//=================================================================================================
//============================== Подслушиватели ===================================================
//=================================================================================================
//=================================================================================================
document.addEventListener('mousedown',event=>{
   
   if(metka_on){if(event.target.id!='metka_div'){metka_chet++;if(metka_chet>1)tm_telos(0,nomer_metki_pamyt);}}
   if(interes_on){if(event.target.id!='interes_div'){interes_chet++;if(interes_chet>1)ti_telos(0,nomer_interesa_pamyt);}}
});
//=================================================================================================
//=================================================================================================
//=================================================================================================
document.addEventListener('mousemove',event=>{
   menu_open();
});
//=================================================================================================
//=================================================================================================
//=================================================================================================
document.addEventListener('scroll',event=>{
    
});

//=================================================================================================
//=================================================================================================
//=================================================================================================
document.addEventListener('keydown',event=>{
//const item=document.querySelector(`[data-scroll=" "]`);
//if(item)scrollTo(item);
    if(form_text_aktiv)/*switch(event.key){
        case key.backSpace: form_vvod_text[nomer_f_text_cop]=form_vvod_text[nomer_f_text_cop].pop();break;
        default:*/
        
        if(event.key=='Backspace'){
            
            id_form.innerHTML= ar_form_vvod_text[nomer_f_text_cop]=ar_form_vvod_text[nomer_f_text_cop].slice(0,ar_form_vvod_text[nomer_f_text_cop].length-1);}
        else
        if(event.key.length<2){id_form.innerHTML= ar_form_vvod_text[nomer_f_text_cop]=ar_form_vvod_text[nomer_f_text_cop]+event.key;}
        if(event.key==='Enter'){}
})
//=================================================================================================
//=================================================================================================
//=================================================================================================
//=================================================================================================
//=================================================================================================
function form_text_on()
{
    
    if(form_text_aktiv){
            //bob.innerHTML=event.srcElement;
            //if(bb.id!='form_'+nomer_form_text){form_text_aktiv=false;id_form.style.border='1px solid #105090';id_form.innerHTML=form_vvod_text[nomer_form_text];}
            //if(form_shetchik<100)form_shetchik++; else {form_shetchik=0;  
            if(form_text_palka_plus){
                 id_form.innerHTML=ar_form_vvod_text[nomer_f_text_cop]+ form_text_palka;
                 form_text_palka_plus=false;
                }
            else {
                id_form.innerHTML=ar_form_vvod_text[nomer_f_text_cop];
                form_text_palka_plus=true;
            }
            //}

        setTimeout('form_text_on()',400);
        
    }
    EventTarget=new e
   // perem=event.key;
}

//================================================================================================= 
function form_chel(){
   
str_f_ch='';
    str_f_ch+='<div class="form_zag"><h2>Заполните данную форму</h2></div><div id="form_chel_div">';
    str_f_ch+='<div class="form_vstavka"><p><i>Хочу вступить в вашу группу под именем:</i><div id="form_1" class="form_text"onmousedown="on_form_text(1)"></div><div align="center"valign="top"><small>(псевдоним или фамелия, имя, отчество по желанию)</small></div></div>';
    str_f_ch+='<div class="form_vstavka"><p><i>Мой адрес электронной почты:</i><div id="form_2" class="form_text"onmousedown="on_form_text(2)"></div></div>';
    str_f_ch+='<div class="form_vstavka"><p><i>Список моих аккаунтов, которыми я хочу поделится с обществом:</i><div id="form_3" class="form_text_mnogo"onmousedown="on_form_text(3)"></div></div>';
    str_f_ch+='<div class="form_vstavka"><p><table><tr><td style="padding-left:20px"><i>  Мой день рождения:</i></td><td id="form_4" class="form_text"onmousedown="on_form_text(4)" width="30%"></td><td><small>(число, месяц)</small></td></tr> </table>';
    str_f_ch+='<p><table><tr><td style="padding-left:20px"><i>Cейчас мне:</i></td><td id="form_5" class="form_text"onmousedown="on_form_text(5)" width="20%"></td><td><small>(Ваш возрост)</small></td></tr> </table></div>';
    str_f_ch+='<div class="form_vstavka"><p><i>Я проживаю в:</i><div id="form_6" class="form_text"onmousedown="on_form_text(6)"></div><div align="center"><small>(область, город, село и так далее)</small></div></div>';
    str_f_ch+='<div class="form_vstavka"><p><i>Моё семейное положение: </i><div id="form_7" class="form_text"onmousedown="on_form_text(7)"></div><div align="center"><small>(холост(свободна) или женат(замужем), сколько детей)</small></div></div>';
    str_f_ch+='<div class="form_vstavka"><p><i>У меня есть хобби, которыми я хочу поделиться с другими пользователями:</i><div id="form_8" class="form_text_mnogo"onmousedown="on_form_text(8)"></div><div align="center"><small>(перечислите виды творчества, которыми Вы увлекаетесь и хотите, чтобы об этом знали другие)</small></div></div>';
    
    str_f_ch+='</div>';
    //bob.innerHTML=str_f_ch; 
    return str_f_ch;
}
//=================================================================================================
//=================================================================================================
//=================================================================================================
function fragment_str(nomer_texta){
    odin_na_stranice=true;
str_fragment_texta='yra';
return str_fragment_texta;
}
//=================================================================================================
function chel(nomer_chel){
  //  odin_na_stranice=true;
if(odin==0)odin=1;
//nomer_chel--;
str_chel='';
str_chel+='<p><table width="100%"><tr ><td align="center" colspan=2><big>'+ar_ym[nomer_chel][0]+'</big><h1>'+ar_ym[nomer_chel][1]+'</h1></td></tr>';

//bob.innerHTML='tdrt';
str_chel+='<tr><td colspan=2>Для безопасности сайта он не содержит ссылок на другие интернет-ресурсы. Здесь находится лишь пути, по которым Вы сможете найти всё Необходимое в поисковике на просторах интернета!</td></tr><tr><td><ul>';
for(i=0;i<ar_chel[nomer_chel-1][0].length;i++) str_chel+='<li>'+ar_chel[nomer_chel][0][i]+'</li>';
str_chel+='</ul></td><td width="250px"align="center"><img src="ym_'+nomer_chel+'_foto/ym_'+nomer_chel+'_foto_1.jpg" class="foto_ymelca">';
if(nomer_chel==0)str_chel+='<br><small>(фотография умельца)</small>';
str_chel+='</td></tr><tr><td colspan="2">';
if(nomer_chel==0)str_chel+='<p>Если мастер пожелает, то указываются его:';
else str_chel+='<p>Немножко обо мне:';
str_chel+='<ul>';
for(i=0;i<ar_chel[nomer_chel][1].length;i++)str_chel+='<li>'+ar_chel[nomer_chel][1][i]+'</li>';
str_chel+='</ul>';
if(nomer_chel==0)str_chel+='<p>Перечисляются все виды творчества, которыми он увлекается.<ul>';
else str_chel+='<p>Всё, чем увлекаюсь:<b><ul>';
for(i=0;i<ar_chel[nomer_chel][2].length;i++)str_chel+='<li>'+ar_chel[nomer_chel][2][i]+'</li>';
str_chel+='</ul></b><p>Все фотографии, видео и уроки пронумерованны и начинаются с более новых работ! ';

nm=0;
nr=3;
np=nomer_chel;
np_1=nomer_chel+1;
localStorage.setItem('np_1',np_1);
chel_kolvo_p=0;
//bob.innerHTML=tp_up_m(0);
for(i=0;i<5;i++)if(ar_tp[nm-0][nr-1][np-0][i]!=''){str_chel+='<p>'+tp_telo(i);chel_kolvo_p++;}

str_chel+='<p>'+ar_chel[nomer_chel][3]+' <p></td></tr></table><p>';
return str_chel;
}
     
//=================================================================================================
//=================================================================================================
//=================================================================================================

function chel_rab(nomer_chel,nomer_izd){
    //odin_na_stranice=true;
    if(odin==0)odin=1;
str_chel='';
str_chel+='<p><table width="100%"><tr ><td align="center"><big><h3 style="line-height: 45px;">'+ar_tp[nm][nr-1][np][np_2-1]+' / Изделие '+np_3+'</h3></big></td></tr>';


str_chel+='<tr><td align="center">';
str_chel+=ar_tizd[nomer_chel][nomer_izd][0];

str_chel+='</td></tr><tr><td align="center"><big>'+ar_tizd[nomer_chel][nomer_izd][1]+'</big>';
str_chel+='</td></tr><tr><td>';
for(i=2;i<8;i++)str_chel+=ar_tizd[nomer_chel][nomer_izd][i];
str_chel+='</td></tr><tr><td>';
 str_chel+='<p>Об истории создания изделия.';



nm=0;
nr=3;
np=1;
np_1=nomer_chel+1;//np_1=nomer_chel+1;
localStorage.setItem('np_1',np_1);
localStorage.setItem('np_2', np_2);
np_3=nomer_izd+1;
localStorage.setItem('np_3',np_3);
chel_kolvo_p=0;
//bob.innerHTML=tp_up_m(0);


str_chel+='</td></tr></table><p>';
return str_chel;
} 
//=================================================================================================
//=================================================================================================
//=================================================================================================

function chel_all_yr(nomer_chel){
    //odin_na_stranice=true;
if(odin==0)odin=1;
    str_chel='';
str_chel+='<p><table width="100%"><tr ><td align="center"><big><h3 style="line-height: 45px;">'+ar_tp[nm][nr-1][np][1]+'</h3></big></td></tr>';
np_1=nomer_chel+1;
//nom_t=nomer_chel+1;
str_chel+='<tr><td>'+on_tp_t(1)+'</td></tr></table>';

localStorage.setItem('np_1',np_1);

localStorage.setItem('np_2', np_2);
np_3=0;
localStorage.setItem('np_3',np_3);


return str_chel;
}
//=================================================================================================
//=================================================================================================
//=================================================================================================

function chel_yr(nomer_chel,nomer_yroka){
    //odin_na_stranice=true;

//np_2=nomer_predmeta+1;
if(odin==0)odin=1;
str_chel='';
str_chel+='<p><table width="100%"><tr ><td align="center"><big><h3 style="line-height: 45px;">'+ar_tp[nm][nr-1][np_1-1][ar_ym_yr[np_1-1][0][0]]+' / Урок '+np_3+'.</h3></big></td></tr>';
np_1=nomer_chel+1;
np_3=nomer_yroka+1;
np=1;
//bob.innerHTML=nomer_predmeta+1;//ar_ym_yr[nomer_chel][nomer_predmeta+1][nomer_yroka];
str_chel+='<tr><td>'+ar_ym_yr[nomer_chel][1][nomer_yroka]+'</td></tr></table>';

localStorage.setItem('np',np);
localStorage.setItem('np_1',np_1);

localStorage.setItem('np_2', np_2);

localStorage.setItem('np_3',np_3);


return str_chel;
}
//=================================================================================================
//=================================================================================================
//=================================================================================================

function chel_inter(nomer_chel,nomer_pic){
//    odin_na_stranice=true;
if(odin==0)odin=1;
    //np_2=nomer_predmeta+1;
np_1_m=np_1-1;
str_chel='';
str_chel+='<p><table width="100%"><tr><td align="center"><big><h3 style="line-height: 45px;">'+'Скаченные из общедоступного интернета / '+ar_int[nomer_chel][nomer_pic][0]+'.</h3></big></td></tr><tr><td align="center">';
np_1=nomer_chel+1;
np_3=nomer_pic+1;
np=1;
//bob.innerHTML=nomer_predmeta+1;//ar_ym_yr[nomer_chel][nomer_predmeta+1][nomer_yroka];
    for(ia=1;ia<ar_int[nomer_chel][nomer_pic].length;ia++)str_chel+='<img id="img_iz_int_'+nomer_chel+'_'+nomer_pic+'_'+ia+'" src="'+ar_int[nomer_chel][nomer_pic][ia]+'"class="foto_rab"></img><br>';
str_chel+='</td></tr></table>';

localStorage.setItem('np',np);
localStorage.setItem('np_1',np_1);

localStorage.setItem('np_2', np_2);

localStorage.setItem('np_3',np_3);

return str_chel;
}
     
   
     
//=================================================================================================
//=================================================================================================
//=================================================================================================
function on_ts_tm(nomer_izdel){
name=nm+'_'+(nr-1)+'_'+np+'_'+(np_1-1)+'_'+nomer_izdel;  
idnom = document.getElementById('ts_'+name);
    
str_rab = true;
            str_var=0;
           
            nm=0;
            nr=3;
            np=0;

            np_2=1;
            np_3=
            //nom_t=
            nomer_izdel+1;
    switch(dz){
        case 1:smena_stranic_1();break;
        default:smena_stranic_0();break;
    
    }
 //odin_na_stranice=true;
    
    up();
}
//=================================================================================================
function on_ts_m(deistvie,nomer_izdel){
name=nm+'_'+(nr-1)+'_'+np+'_'+(np_1-1)+'_'+nomer_izdel;  
idnom = document.getElementById('ts_'+name);
    switch (deistvie) {
        case 1://over
            idnom.style.background = '#c0eaff';
            idnom.style.color = '#0010a0';
            break;
        case 2://out
            idnom.style.background = '#a0e0ff';
            idnom.style.color = 'black';
            break;
 
    }


}
//=================================================================================================
function tizd(nomer_izd) {
    np_1_m=np_1-1;
    name_izd = nm + '_' + (nr-1) + '_' + np+'_'+np_1_m+'_'+nomer_izd;
    return '<p><div id="ts'+name_izd+'"class="ssilka" onmouseover="on_ts_m(1,'+nomer_izd+')"onmouseout="on_ts_m(2,'+nomer_izd+')"onmousedown="on_ts_tm('+nomer_izd+')"><table><tr><td>'+(nomer_izd+1)+')</td><td width="35%"align="center">'+ar_tizd[np_1_m][nomer_izd][0]+'</td><td style="padding-left:10px">'+ar_tizd[np_1_m][nomer_izd][1]+'<br/>'+ar_tizd[np_1_m][nomer_izd][2]+'<br/>'+ar_tizd[np_1_m][nomer_izd][3]+'<br/>'+ar_tizd[np_1_m][nomer_izd][4]+'<br/>'+ar_tizd[np_1_m][nomer_izd][5]+'<br/>'+ar_tizd[np_1_m][nomer_izd][6]+'<br/>'+ar_tizd[np_1_m][nomer_izd][7]+'</td></tr></table></div>';
                    
}
//=================================================================================================
//=================================================================================================
//=================================================================================================

function on_ts_int(nomer_int) {
    
str_rab = true;
            str_var=0;
           
            nm=0;
            nr=3;
            np=0;

            np_2=3;
            np_3
            //nom_t
            =nomer_int+1;
    switch(dz){
        case 1:smena_stranic_1();break;
        default:smena_stranic_0();break;
    
    }

 odin_na_stranice=true;    
    up();

}
//=================================================================================================
function ts_int(nomer_int) {
    np_1_m=np_1-1;
    
    name_int = nm + '_' + (nr-1) + '_' + np+'_'+np_1_m+'_'+nomer_int;
    int_str= '<p><div class="ris_inter">'+(nomer_int+1)+') '+ar_int[np_1_m][nomer_int][0]+'</div><div id="ts_'+name_int+'"class="ssilka" onmouseover="on_ts_m(1,'+nomer_int+')"onmouseout="on_ts_m(2,'+nomer_int+')"onmousedown="on_ts_int('+nomer_int+')"><table><tr><td width="35%"align="center">';
    for(ri=1;ri<ar_int[np_1_m][nomer_int].length;ri++)int_str+='<img src="'+ar_int[np_1_m][nomer_int][ri]+'"class="shema_img"></img>';
    int_str+='</td></tr></table></div>';
    //bob.innerHTML=np_1;
    return int_str;                
}
//<span class="ris_inter">Дата и время поступления на сайт</span><p><img src="ym_0_ris_0_0.jpg"  class="shema_img"></img><img src="ym_0_ris_0_1.jpg" class="shema_img"></img><img src="ym_0_ris_0_2.jpg" class="shema_img"></img>'
//=================================================================================================
//=================================================================================================
//=================================================================================================
function mrp() {
    nm=localStorage.getItem('nm');
    nr=localStorage.getItem('nr');
    np=localStorage.getItem('np');
    np_1=localStorage.getItem('np_1');
    np_2=localStorage.getItem('np_2');
    np_3=localStorage.getItem('np_3');
}
//=================================================================================================
//=================================================================================================
//=================================================================================================
function on_tistor(deistvie,nomer) {

}
//=================================================================================================
function tistor_telo(nomer_istor) {
den=dat.getDate();
mes=dat.getMonth();
god=dat.getFullYear();
chas=dat.getHours();
min=dat.getMinutes();
dat=new Date();
den=dat.getDate()-den;
mes=dat.getMonth()-mes;
god=dat.getFullYear()-god;
chas=dat.getHours()-chas;
min=dat.getMinutes()-min;
text_time='';
if(god==0&&mes==0&&den==0&&chas==0){
    if(min==0)text_time='меньше минуты';
    else text_time=min+' мин';
    
}

    if(nomer_istor==0)return '<table id="istor_'+nomer_istor+'" class="istoriy" onmouseover="on_tistor(1,'+nomer_istor+')"onmouseout="on_tistor(2,'+nomer_istor+')"onmousedown="on_tistor(3,'+nomer_istor+')"><tr><td width="10%"align="center"class="istoriy_nomer"rowspan="2">'+nomer_istor+'</td><td class="istoriy_vizit"colspan="2">'+ar_istor[nomer_istor][0]+' <big><b> </b></big>'+'</td></tr><tr><td class="istoriy_time">'+ ar_istor[nomer_istor][1]+'</td><td class="istoriy_time">'+ar_istor[nomer_istor][2]+'</td></tr></table>';
else return '<table id="istor_'+nomer_istor+'" class="istoriy"onmouseover="on_tistor(1,'+nomer_istor+')"onmouseout="on_tistor(2,'+nomer_istor+')"onmousedown="on_tistor(3,'+nomer_istor+')"><tr><td width="10%"align="center"class="istoriy_nomer"rowspan="2">'+nomer_istor+'</td><td class="istoriy_vizit"colspan="2"><big><b>'+array_menu[0][nm-0] + ' / ' + array_menu[nm - 0 + 1][nr - 1] + ' / ' + array_razd_p[nm-0][nr - 1][np-0] +'  </b></big></td></tr><tr><td class="istoriy_time">'+dat.getDate()+'.'+dat.getMonth()+'.'+dat.getFullYear()+' '+dat.getHours()+':'+dat.getMinutes()+'</td><td class="istoriy_time">'+text_time+'</td></tr></table>';
}
//=================================================================================================
//=================================================================================================
//=================================================================================================
function on_tn(deistvie,nomer) {
    switch(deistvie){
    case 1:

    break;
    }
}
//=================================================================================================
function tn_telo(deistvie_n,nomer_n) {
    if(deistvie_n==0)return '<div id="tn_'+nomer_n+'_telo"><table id="tn_'+nomer_n+'" class="nowosti"onmouseover="on_tn(1,'+nomer_n+')"onmouseout="on_tn(2,'+nomer_n+')"onmousedown="tn_telos(1,'+nomer_n+')"><tr><td id="tn_'+nomer_n+'_z"class="nowosti_zagolovok"><big><i><b>'+ar_now[nomer_n][0]+'</b></i></big></td><td id="tn_'+nomer_n+'_d"class="nowosti_data">'+ar_now[nomer_n][1]+'</td></tr><tr><td colspan=2 style="background:#fff8e0;"></td></tr></table></div>';
    else return '<div id="tn_'+nomer_n+'_telo"><table id="tn_'+nomer_n+'" class="nowosti"onmouseover="on_tn(1,'+nomer_n+')"onmouseout="on_tn(2,'+nomer_n+')"onmousedown="tn_telos(0,'+nomer_n+')"><tr><td id="tn_'+nomer_n+'_z"class="nowosti_zagolovok"><big><i><b>'+ar_now[nomer_n][0]+'</b></i></big></td><td id="tn_'+nomer_n+'_d"class="nowosti_data">'+ar_now[nomer_n][1]+'</td></tr></table><div id="tn_'+nomer_n+'_t" class="nowosti_text"align="left">'+ar_now[nomer_n][2]+' </div></div>';
}
//=================================================================================================
function tn_telos(deistvie_ns,nomer_ns) {
    if(deistvie_ns==0)document.getElementById('tn_'+nomer_ns+'_telo').innerHTML='<table id="tn_'+nomer_ns+'" class="nowosti"onmouseover="on_tn(1,'+nomer_ns+')"onmouseout="on_tn(2,'+nomer_ns+')"onmousedown="tn_telos(1,'+nomer_ns+')"><tr><td id="tn_'+nomer_ns+'_z"class="nowosti_zagolovok"><big><i><b>'+ar_now[nomer_ns][0]+'</b></i></big></td><td id="tn_'+nomer_ns+'_d"class="nowosti_data">'+ar_now[nomer_ns][1]+'</td></tr><tr><td colspan=2 style="background:#fff8e0;"></td></tr></table>';
    else document.getElementById('tn_'+nomer_ns+'_telo').innerHTML='<table id="tn_'+nomer_ns+'" class="nowosti"onmouseover="on_tn(1,'+nomer_ns+')"onmouseout="on_tn(2,'+nomer_ns+')"onmousedown="tn_telos(0,'+nomer_ns+')"><tr><td id="tn_'+nomer_ns+'_z"class="nowosti_zagolovok"><big><i><b>'+ar_now[nomer_ns][0]+'</b></i></big></td><td id="tn_'+nomer_ns+'_d"class="nowosti_data">'+ar_now[nomer_ns][1]+'</td></tr></table><div id="tn_'+nomer_ns+'_t" class="nowosti_text"align="left">'+ar_now[nomer_ns][2]+' </div>';
    up();
}
//=================================================================================================
//=================================================================================================
//=================================================================================================
function on_tym(deistvie,nomer) {
    switch(deistvie){
    case 3:
    smena_deistvie=6;
     smena_var=0;
    nm=0;
            nr=3;
            np=np_1;
            np_1= nomer+1;
        if(odin==0)odin=1;    
            np_2=0;
            np_3=0;
    switch(dz){
        case 1:smena_stranic_1();break;
        default:smena_stranic_0();break;
    
    }

    
    up();
    break;
    //---------------------------------------------------------------------------------------
    case 6:
    document.getElementById('tn_'+nomer+'_telo').innerHTML='<table id="tn_'+nomer+'" class="nowosti" onmousedown="on_tn(3,'+nomer+')"><tr><td id="tn_'+nomer+'_z" class="nowosti_zagolovok">'+document.getElementById('tn_'+nomer+'_z').innerHTML+'</td><td id="tn_'+nomer+'_d"class="nowosti_data">'+document.getElementById('tn_'+nomer+'_d').innerHTML+'</td></tr><tr><td colspan=2 style="background: #fff8e0;"> </td></tr></table>';
    up();
    osnova.style.height=osnova.clientHeight-gl_p.clientHeight+'px';
    break;
    //---------------------------------------------------------------------------------------
    }
}
//=================================================================================================
function tym_telo(nomer_ym) {
    
    tym_str='<table id="ym_'+nomer_ym+'" class="ymelec"onmouseover="on_tym(1,'+nomer_ym+')"onmouseout="on_tym(2,'+nomer_ym+')"onmousedown="on_tym(3,'+nomer_ym+')"><tr><td align="center"><img class="foto_ymelca" src="ym_'+nomer_ym+'_foto/ym_'+nomer_ym+'_foto_1.jpg">'+(nomer_ym==0?'<br><small>(фотография умельца)</small>':'')+'</td><td id="lud_'+nomer_ym+'_name">'+ar_ym[nomer_ym][0]+' <big><b>'+ar_ym[nomer_ym][1]+'</b></big><p>'+ ar_ym[nomer_ym][2]+'<b><i><ul><li>';
    for(i=3;i<ar_ym[nomer_ym].length-1;i++)tym_str+=ar_ym[nomer_ym][i]+'</li><li>';
    tym_str+=ar_ym[nomer_ym][ar_ym[nomer_ym].length-2]+'</li></ul></i></b>'+ ar_ym[nomer_ym][ar_ym[nomer_ym].length-1]+'</td></tr></table>';
    return tym_str;
}
//=================================================================================================
//=================================================================================================
//=================================================================================================
function on_tym_rab(deistvie,nomer_ym,nomer_rab) {
    switch(deistvie){
    case 3:
    //str_rab = true;
      //      str_var=0;
            //odin_na_stranice=true;
        smena_deistvie=6;
            nm=0;
            nr=3;
            np=0;
            np_1=
            //nom_t=
            nomer_ym+1;
            np_2=1;
            np_3=nomer_rab+1;
                    if(odin==0){odin=1;text_stranici.style.paddingTop='10px';}
            smena_var=0;
    switch(dz){
        case 1:smena_stranic_1();break;
        default:smena_stranic_0();break;
    
    }

    
    up();
    break;
    }
}
//=================================================================================================
function tym_rab_telo(nomer_ym,nomer_rab) {
    if(nomer_ym==0) return'<table id="ym_0_rab_0" class="rabota_ymelca"onmouseover="on_tym_rab(1,0,0)"onmouseout="on_tym_rab(2,0,0)"onmousedown="on_tym_rab(3,0,0)"><tr><td class="rabota_izdelie">'+ar_tizd[nomer_ym][nomer_rab][0]+'<p>'+ar_ym_rab[nomer_ym][nomer_rab][0]+'<i> "'+ar_ym_rab[nomer_ym][nomer_rab][1]+'"</i> <p>Например: вязаная крючком игрушка <i>"Масяня 3D"</i> </td><td class="rabota_ym"><img class="foto_ymelca_min"src="ym_0_foto/ym_0_foto_1.jpg"><br><small>(мини-фото умельца)</small><p>Фамелия, имя или псевдоним мастера.<p> Например: <b>Масяня Питерская</b></td></tr></table>';
    else return'<table id="ym_'+nomer_ym+'_rab_'+nomer_rab+'" class="rabota_ymelca"onmouseover="on_tym_rab(1,'+nomer_ym+','+nomer_rab+')"onmouseout="on_tym_rab(2,'+nomer_ym+','+nomer_rab+')"onmousedown="on_tym_rab(3,'+nomer_ym+','+nomer_rab+')"><tr><td class="rabota_izdelie">'+ar_tizd[nomer_ym][nomer_rab][0]+'<p>'+ar_ym_rab[nomer_ym][nomer_rab][0]+'<i> "'+ar_ym_rab[nomer_ym][nomer_rab][1]+'"</i></td><td class="rabota_ym"><img class="foto_ymelca_min"src="ym_'+nomer_ym+'_foto/ym_'+nomer_ym+'_foto_1.jpg"><p><b>'+ar_ym[nomer_ym][0]+'</b></td></tr></table>';
}

//=================================================================================================
//=================================================================================================
//=================================================================================================
function on_tym_yrok(deistvie,nomer_ym,nomer_predmeta,nomer_yroka) {
    switch(deistvie){
    case 3:

    //str_rab = true;
      //      str_var=0;
            //odin_na_stranice=true;
        smena_deistvie=6;
            nm=0;
            nr=3;
            np=1;
            np_1
            //nom_t
            =nomer_ym+1;
   // bob.innerHTML=ar_ym_yr[nomer_ym][0][0];
            np_2=2;
            
            np_3=nomer_yroka+1;
            smena_var=0;
            if(odin==0){odin=1;text_stranici.style.paddingTop='10px';}
    switch(dz){
        case 1:smena_stranic_1();break;
        default:smena_stranic_0();break;
    
    }

    up();
    break;
    }
}
//=================================================================================================
function tym_yrok_telo(nomer_ym,nomer_predmeta,nomer_yroka) {
    if(nomer_ym==0)return'<table id="ym_0_yrok_0_0"class="yrok_ymelca"onmouseover="on_tym_yrok(1,0,0,0)"onmouseout="on_tym_yrok(2,0,0,0)"onmousedown="on_tym_yrok(3,0,0,0)"><tr><td class="yrok"><big><i><u>'+ar_ym_yrok[0][0][0][0]+'</u></i></big><br>'+ar_ym_yrok[0][0][0][1]+'<p><br>Урок '+nomer_yroka+'. <i><b>"'+ar_ym_yrok[0][0][0][2]+'"</b></i><p>'+ar_ym_yrok[0][0][0][3]+'</td><td class="yrok_ym"><img class="foto_ymelca_min" src="ym_0_foto/ym_0_foto_1.jpg"><br><small>(мини-фото умельца)</small><p>Фамелия, имя или псевдоним мастера-учителя.<p> Например: <b>Масяня Питерская</b></td></tr></table>';
    else return'<table id="ym_'+nomer_ym+'_yrok_'+nomer_predmeta+'_'+nomer_yroka+'" class="yrok_ymelca"onmouseover="on_tym_yrok(1,'+nomer_ym+','+nomer_predmeta+','+nomer_yroka+')"onmouseout="on_tym_yrok(2,'+nomer_ym+','+nomer_predmeta+','+nomer_yroka+')"onmousedown="on_tym_yrok(3,'+nomer_ym+','+nomer_predmeta+','+nomer_yroka+')"><tr><td class="yrok"><big><i><u>'+ar_ym_yrok[nomer_ym][nomer_predmeta][nomer_yroka][0]+'</u></i></big><br>'+ar_ym_yrok[nomer_ym][nomer_predmeta][nomer_yroka][1]+'<p><br>Урок '+nomer_yroka+'. <i><b>"'+ar_ym_yrok[nomer_ym][nomer_predmeta][nomer_yroka][2]+'"</b></i><p>'+ar_ym_yrok[nomer_ym][nomer_predmeta][nomer_yroka][3]+'</td><td class="yrok_ym"><img class="foto_ymelca_min" src="ym_'+nomer_ym+'_foto/ym_'+nomer_ym+'_foto_1.jpg"><p><b>'+ar_ym[nomer_ym][0]+' </b></td></tr></table>';
}
//=================================================================================================
//=================================================================================================
//=================================================================================================
function on_tym_yr_mast(deistvie,nomer_ym){
if(deistvie==3){    //str_rab = true;
            //str_var=0;
           // odin_na_stranice=true;
           smena_deistvie=6; 
           nm=0;
            nr=3;
            np=0;
            np_1=
            //nom_t=
            nomer_ym+1;
            np_2=4;
        if(odin==0){odin=1;text_stranici.style.paddingTop='10px';}    
            np_3=0;
            smena_var=0;
   switch(dz){
        case 1:smena_stranic_1();break;
        default:smena_stranic_0();break;
    
    }

    
    
    up();
}


}
//=================================================================================================
function tym_yroki_mast_telo(nomer_ym) {
    if(nomer_ym==0)return'<table id="ym_0_yroki_master" class="yroks_ymelca"onmouseover="on_tym_yr_mast(1,0)"onmouseout="on_tym_yr_mast(2,0)"onmousedown="on_tym_yr_mast(3,0)"><tr><td class="yroks_ym"><img class="foto_ymelca_min" src="ym_0_foto/ym_0_foto_1.jpg"><br><small>(мини-фото умельца)</small><p>Фамелия, имя или псевдоним мастера-учителя.<p> Например: <b>Масяня Питерская</b></td><td class="yroks"><p>'+ar_ym_predm[nomer_ym][0]+' </td></tr></table>';
    else return'<table id="ym_'+nomer_ym+'_yroki_master" class="yroks_ymelca"onmouseover="on_tym_yr_mast(1,'+nomer_ym+')"onmouseout="on_tym_yr_mast(2,'+nomer_ym+')"onmousedown="on_tym_yr_mast(3,'+nomer_ym+')"><tr><td class="yroks_ym"><img class="foto_ymelca_min" src="ym_'+nomer_ym+'_foto/ym_'+nomer_ym+'_foto_1.jpg"><p><b>'+ar_ym[nomer_ym][0]+'</b></td><td class="yroks"><p><b><i>'+ar_ym_predm[nomer_ym][0]+' </i></b></td></tr></table>';
}
//=================================================================================================
//=================================================================================================
//=================================================================================================
function on_tym_pik(deistvie,nomer_ym,nomer_pik){
if(deistvie==3){    //str_rab = true;
            //str_var=0;
           // odin_na_stranice=true;
            smena_deistvie=6;
           nm=0;
            nr=3;
            np=0;
            np_1=
            //nom_t=
            nomer_ym+1;
            np_2=3;
            if(odin==0){odin=1;text_stranici.style.paddingTop='10px';}
            np_3=nomer_pik+1;
            smena_var=0;
    switch(dz){
        case 1:smena_stranic_1();break;
        default:smena_stranic_0();break;
    
    }

    
    
    up();
}

}
//=================================================================================================
function tym_pik_telo(nomer_ym,nomer_pik) {
    tym_str='';
    if(nomer_ym==0)tym_str+='<table id="ym_0_pik_0" class="shema_ymelca"onmouseover="on_tym_pik(1,0,0)"onmouseout="on_tym_pik(2,0,0)"onmousedown="on_tym_pik(3,0,0)"><tr><td align="center"><img class="foto_ymelca_min" src="ym_'+nomer_ym+'_foto/ym_'+nomer_ym+'_foto_1.jpg"><br><small>(мини-фото умельца)</small><p>Фамелия, имя или псевдоним мастера-учителя.<p> Например: <b>Масяня Питерская</b></td><td style="background:#303060"></td><td class="shema" align="center"> Здесь показаны все схемы и рисунки из данной коллекции: <p>';
    else tym_str+='<table id="ym_'+nomer_ym+'_pik_'+nomer_pik+'" class="shema_ymelca"onmouseover="on_tym_pik(1,'+nomer_ym+','+nomer_pik+')"onmouseout="on_tym_pik(2,'+nomer_ym+','+nomer_pik+')"onmousedown="on_tym_pik(3,'+nomer_ym+','+nomer_pik+')"><tr><td align="center"><img class="foto_ymelca_min" src="ym_'+nomer_ym+'_foto/ym_'+nomer_ym+'_foto_1.jpg"><p><b>'+ar_ym[nomer_ym][0]+'</b></td><td style="background:#303060"></td><td class="shema" align="center">';
    for(i=1;i<ar_int[nomer_ym][nomer_pik].length;i++)tym_str+='<img src="'+ar_int[nomer_ym][nomer_pik][i]+'"class="shema_img"></img>';
    
    
    tym_str+='</td></tr></table>';
    return tym_str;
}
//=================================================================================================
//=================================================================================================
//=================================================================================================
function on_shpora() {
    switch(shpora_var){
        case 0:
             shporgalki.style.visibility='visible';
                shporgalki.style.top=scrollY+20+'px';
                shporgalki.style.height='5px';
                shpora_var++;
                shpora_del=10;
                shpora_izmen=5;
                shpora_index=0;
            break;
            case 1:
                if(shpora_index<10){
                    shpora_index++;
                    shpora_izmen+=shpora_del;
                    shporgalki.style.height=shpora_izmen+'px';
                }else{
                    shpora_rab=false;
                    shpora_var=0;
                }

                break;   
            case 2:
                 shpora_var++;

                shpora_del=10;
                shpora_izmen=5;
                shpora_index=0;
                
                break;
    }
    if(shpora_rab)setTimeout('on_shpora()',30);
}
//=================================================================================================
function on_tshp(deistvie, nomer_shp) {
    name_shp=nm+'_'+(nr-1)+'_'+np+'_'+nomer_shp;  
    idnom = document.getElementById('tshp_'+name_shp);
    switch (deistvie) {
        case 1://over
        if(ar_shp[nr-3][np][nomer_shp][1]==0){
            idnom.style.background = '#eea';
            idnom.style.color = '#620';
        }
        break;
        case 2://out
        if(ar_shp[nr-3][np][nomer_shp][1]==0){ 
            idnom.style.background = '#a62';
            idnom.style.color = '#eea';
        }
        break;
        case 3://over v
            if(shporgalki_id<1){ 
                shporgalki_id++;                
                shpora_var=0;
                shpora_rab=true;
                on_shpora();
            }
            if(ar_shp[nr-3][np][nomer_shp][1]==0){
                shporgalki_id++;

                idnom.style.background='#c0ffe0';
                idnom.style.color = '#620';
                galka=document.getElementById('tshp_'+name_shp+'_galka');
                galka.style.paddingLeft='5px';
                galka.style.paddingRight='5px';
                galka.innerHTML='<tt>V</tt>';
                ar_shp[nr-3][np][nomer_shp][1]=shporgalki.innerHTML.length;
                shporgalki.innerHTML=shporgalki.innerHTML+'<hr width="100%"size="2"color="black"/>'+ar_shp[nr-3][np][nomer_shp][0];
                shporgalki.style.height=shporgalki.clientHeight+idnom.clientHeight+'px';
            }else{
                shporgalki_id--;
                idnom.style.background = '#eea';
                idnom.style.color = '#620';
                galka=document.getElementById('tshp_'+name_shp+'_galka');
                galka.style.paddingLeft='0px';
                galka.style.paddingRight='0px';
                galka.innerHTML='__';
                dlina=ar_shp[nr-3][np][nomer_shp][0].length;
                isk=ar_shp[nr-3][np][nomer_shp][1];
                ar_shp[nr-3][np][nomer_shp][1]=0;
                primshp=ar_shp[nr-3][np].length;
                for(ishp=0;ishp<primshp;ishp++)if(ar_shp[nr-3][np][ishp][1]>isk)ar_shp[nr-3][np][ishp][1]=ar_shp[nr-3][np][ishp][1]-dlina-40;
                shporgalki.style.height=shporgalki.clientHeight-idnom.clientHeight-11+'px';
                shporgalki.innerHTML=shporgalki.innerHTML.slice(0,isk)+shporgalki.innerHTML.slice(dlina+isk+(dlina+isk<shporgalki.innerHTML.length?40:0),shporgalki.innerHTML.length);    
                if(shporgalki_id<2){
                    shporgalki_id=0;
                    shporgalki.style.visibility='hidden'
                }
            }
            break;
    }
}
//=================================================================================================
function tshp_telo(nomer_shp) {
    
    name_shp = nm + '_' + (nr-1) + '_' + np+'_'+nomer_shp;

    return'<p><center><table border="2"align="middle"><tr border="2"id="tshp_'+name_shp+'"  class="shpora" onmouseover="on_tshp(1,'+nomer_shp+')"onmouseout="on_tshp(2,'+nomer_shp+')"onmousedown="on_tshp(3,'+nomer_shp+')"><td>Занести в шпоргалки  <span id="tshp_'+name_shp+'_galka"class="shpora_g">__ </span></td></tr><tr><td>'+ar_shp[nr-3][np][nomer_shp][0]+'</td></tr></table></center><p>';
    
}
//=================================================================================================
  
//=================================================================================================
//=================================================================================================
//=================================================================================================
function on_kn_tp(deistvie_kn,nomer_kn) {
    color_kn_tp_videl='#47a';
    color_kn_tp_nevidel='#9cf';
    name_kn=nm+'_'+(nr-1)+'_'+np+'_'+nomer_kn;  
    //idnom_kn = document.getElementById('kn_tp_'+name_kn);
    switch (deistvie_kn) {
        case 1://over
            document.getElementById('kn_tp_'+name_kn).style.backgroundColor=color_kn_tp_videl;
            
            document.getElementById('svet_tp_'+name_kn).style.visibility='visible';
            document.getElementById('ten_tp_'+name_kn).style.visibility='visible';
            document.getElementById('ten_kn_tp_'+name_kn).style.visibility='visible';

        break;
        case 2://out
            document.getElementById('kn_tp_'+name_kn).style.backgroundColor=color_kn_tp_nevidel;
            

            document.getElementById('svet_tp_'+name_kn).style.visibility='hidden';

            document.getElementById('ten_tp_'+name_kn).style.visibility='hidden';
            document.getElementById('ten_kn_tp_'+name_kn).style.visibility='hidden';
        break;
        case 4:
            
            document.getElementById('kn_tp_'+name_kn).style.backgroundColor=color_kn_tp_nevidel;
            

            document.getElementById('svet_tp_'+name_kn).style.visibility='hidden';

            document.getElementById('ten_tp_'+name_kn).style.visibility='hidden';

            document.getElementById('ten_kn_tp_'+name_kn).style.visibility='hidden';

            smena_deistvie=6;
   
    if(odin==0)odin=1;else{
        if(np_1>0){
            
            
            
        }
     
    }
        
    localStorage.setItem('odin',odin);
 
    smena_var=0;
    //bob.innerHTML=;//document.getElementById('kn_tp_'+name_kn);
   
    //np_1=ar_np_1[nm][nr-1][np];
  pamyt_nom_t=nom_t=nomer_kn;

  localStorage.setItem('nom_t',nom_t);
    //np_2=4;
    //np_3=1;
  // on_str_0(); 

  ;
   ar_tp[nm][nr-1][np][nomer_kn][1]=1;
   //document.getElementById('tp_'+name_kn+'_telo').scrollIntoView({block:'center'});
       
   pamyt_tp_scroll=document.getElementById('kn_tp_'+name_kn).offsetTop;  
     tp_scroll=0;

   //bob.innerHTML=ar_tp_up[nm][nr-1][np][nomer_kn];
   //bob.innerHTML=pamyt_tp_scroll;
    switch(dz){
        case 1:smena_stranic_1();break;
        default:smena_stranic_0();break;
    }
  
   

   
//    up();

        break;
    }
}
tp_scroll=0;
pamyt_tp_scroll=0;
v_razdel=false;
//=================================================================================================
function on_tp(deistvie, nomer) {
    name=nm+'_'+(nr-1)+'_'+np+'_'+nomer;  
    idnom = document.getElementById('tp_'+name);
    switch (deistvie) {
        case 1://over
            idnom.style.background = '#ffd0c0';
            idnom.style.color = '#a01000';
            break;
        case 2://out
            idnom.style.background = '#ffb0a0';
            idnom.style.color = 'black';
            break;
        case 3://over v
            document.getElementById('tp_'+name  + '_v').style.background = '#605040';
            break;
        case 4://out v
            document.getElementById('tp_'+name + '_v').style.background = 'black';
            break;
    }
}
//=================================================================================================
function tp_telo(nomer_p) {
    
    name_p = nm + '_' + (nr-1) + '_' + np+'_'+nomer_p;
    if(ar_tp[nm][nr-1][np][nomer_p][1]==0) return'<div id="tp_'+name_p+'_telo"><div id="tp_'+name_p+'" class="paragraf" onmouseover="on_tp(1,'+nomer_p+')"onmouseout="on_tp(2,'+nomer_p+')"onmousedown="tp_telos(1,'+nomer_p+')">' +ar_tp[nm][nr-1][np][nomer_p][0]+'</div></div>';
    else return'<div id="tp_'+name_p+'_telo"><div id="tp_'+name_p+'_v" class="paragraf_v" onmouseover="on_tp(3,' + nomer_p + ')"onmouseout="on_tp(4,' + nomer_p + ')"onmousedown="tp_telos(0,'+nomer_p+')">'+ar_tp[nm][nr-1][np][nomer_p][0]+'</div><div id="ten_kn_tp_'+name_p+'"class="c_ten_kn_tp"></div><div id="kn_tp_'+name_p+'"class="c_kn_tp"onmouseover="on_kn_tp(1,' + nomer_p + ')"onmouseout="on_kn_tp(2,' + nomer_p + ')"onmousedown="on_kn_tp(4,'+nomer_p+')"><div id="svet_tp_'+name_p+'"class="c_svet_tp"></div><div id="ris_tp_'+name_p+'"class="c_ris_tp"></div><div id="ten_tp_'+name_p+'"class="c_ten_tp"></div></div><p><hr width="100%"size="2"color="black"/><p>'+on_tp_t(nomer_p)+'<hr width="100%"size="2"color="black"/></div>';
}
//=================================================================================================
function tp_telos(deistvie_ps,nomer_ps){
    //deistvie_ps=tp_up(nomer_ps);
    name_ps = nm + '_' + (nr-1) + '_' + np+'_'+nomer_ps;
    if(deistvie_ps==0) {document.getElementById('tp_'+name_ps+'_telo').innerHTML='<div id="tp_'+name_ps+'" class="paragraf" onmouseover="on_tp(1,'+nomer_ps+')"onmouseout="on_tp(2,'+nomer_ps+')"onmousedown="tp_telos(1,'+nomer_ps+')">' +ar_tp[nm][nr-1][np][nomer_ps][0]+'</div>';ar_tp[nm][nr-1][np][nomer_ps][1]=0;}
    else {document.getElementById('tp_'+name_ps+'_telo').innerHTML= '<div id="tp_'+name_ps+'_v" class="paragraf_v" onmouseover="on_tp(3,' + nomer_ps + ')"onmouseout="on_tp(4,' + nomer_ps + ')"onmousedown="tp_telos(0,'+nomer_ps+')">'+ar_tp[nm][nr-1][np][nomer_ps][0]+'</div><div id="ten_kn_tp_'+name_ps+'"class="c_ten_kn_tp"></div><div id="kn_tp_'+name_ps+'"class="c_kn_tp" onmouseover="on_kn_tp(1,' + nomer_ps + ')"onmouseout="on_kn_tp(2,' + nomer_ps + ')"onmousedown="on_kn_tp(4,'+nomer_ps+')"><div id="svet_tp_'+name_ps+'"class="c_svet_tp"></div><div id="ris_tp_'+name_ps+'"class="c_ris_tp"></div><div id="ten_tp_'+name_ps+'"class="c_ten_tp"></div></div><p><hr width="100%"size="2"color="black"/><p>'+on_tp_t(nomer_ps)+'<hr width="100%"size="2"color="black"/>';ar_tp[nm][nr-1][np][nomer_ps][1]=1;}
   // osnova.style.height=osnova.clientHeight+ document.getElementById('tp_'+name_ps+'_telo').clientHeight+'px';
    up();
}    
//=================================================================================================
//=================================================================================================
//=================================================================================================
function on_tr(deistvie, nomer) {
name=nm+'_'+(nr-1)+'_'+np+'_'+nomer;  
idnom = document.getElementById('tr_'+name);
    switch (deistvie) {
        case 1://over
            idnom.style.background = '#e0c0ff';
            idnom.style.color = '#3000a0';
            break;
        case 2://out
            idnom.style.background = '#b090ff';
            idnom.style.color = 'black';
            break;
        case 3://over v
            document.getElementById('tr_'+name  + '_v').style.background = '#6030a0';
            break;
        case 4://out v
            document.getElementById('tr_'+name + '_v').style.background = '#5000a0';
            break;
    }
}
//=================================================================================================
function tr_telo(deistvie_r,nomer_r) {
    name_r = nm + '_' + (nr-1) + '_' + np+'_'+nomer_r;    
    if(deistvie_r==0)return '<span id="tr_'+name_r+'_telo"><span id="tr_'+name_r+'" class="reshenie" onmouseover="on_tr(1,'+nomer_r+')"onmouseout="on_tr(2,'+nomer_r+')"onmousedown="tr_telos(1,'+nomer_r+')">' +ar_tr[nm][nr-1][np][nomer_r]+'</span></span>';
    else return '<span id="tr_'+name_r+'_telo"><span id="tr_'+name_r+'_v"class="reshenie_v" onmouseover="on_tr(3,'+nomer_r+')"onmouseout="on_tr(4,'+nomer_r+')"onmousedown="tr_telos(0,'+nomer_r+')">'+ar_tr[nm][nr-1][np][nomer_r]+'</span><div class="reshenie_div">'+on_tr_t(nomer_r)+'</div></span>';
}
//=================================================================================================
function tr_telos(deistvie_rs,nomer_rs) {
    name_rs = nm + '_' + (nr-1) + '_' + np+'_'+nomer_rs;    
    if(deistvie_rs==0) document.getElementById('tr_'+name_rs+'_telo').innerHTML='<span id="tr_'+name_rs+'" class="reshenie" onmouseover="on_tr(1,'+nomer_rs+')"onmouseout="on_tr(2,'+nomer_rs+')"onmousedown="tr_telos(1,'+nomer_rs+')">' +ar_tr[nm][nr-1][np][nomer_rs]+'</span>';
    else document.getElementById('tr_'+name_rs+'_telo').innerHTML='<span id="tr_'+name_rs+'_v"class="reshenie_v" onmouseover="on_tr(3,'+nomer_rs+')"onmouseout="on_tr(4,'+nomer_rs+')"onmousedown="tr_telos(0,'+nomer_rs+')">'+ar_tr[nm][nr-1][np][nomer_rs]+'</span><div class="reshenie_div">'+on_tr_t(nomer_rs)+'</div>';
    up();
}
//=================================================================================================
//=================================================================================================
//=================================================================================================
function on_ts(deistvie, nomer) {
name=nm+'_'+(nr-1)+'_'+np+'_'+nomer;  
idnom = document.getElementById('ts_'+name);
    switch (deistvie) {
        case 1://over
            idnom.style.background = '#c0eaff';
            idnom.style.color = '#0010a0';
            break;
        case 2://out
            idnom.style.background = '#a0e0ff';
            idnom.style.color = 'black';
            break;
    }
}
//=================================================================================================
function ts_telo(nomer_s) {
    name_s = nm + '_' + (nr-1) + '_' + np+'_'+nomer_s;    
    if(nm==0&&nr==1&&np==2)return '<span id="ts_'+name_s+'" class="ssilka" onmouseover="on_ts(1,'+nomer_s+')"onmouseout="on_ts(2,'+nomer_s+')"onmousedown="on_ts_t('+nomer_s+')">' +ar_ts[nm][nr-1][np]+'</span>';
    else return '<span id="ts_'+name_s+'" class="ssilka" onmouseover="on_ts(1,'+nomer_s+')"onmouseout="on_ts(2,'+nomer_s+')"onmousedown="on_ts_t('+nomer_s+')">' +ar_ts[nm][nr-1][np][nomer_s]+'</span>';
}
//=================================================================================================
//=================================================================================================
//=================================================================================================
function on_tm(deistvie, nomer) {
name=nm+'_'+(nr-1)+'_'+np+'_'+nomer;      
idnom = document.getElementById('tm_'+name);
    switch (deistvie) {
        case 1://over
            idnom.style.background = '#a0ff40';
            idnom.style.color = '#106000';
            break;
        case 2://out
            idnom.style.background = '#c0ff20';
            idnom.style.color = 'black';
            break;
        case 3://over v
            document.getElementById('tm_'+name  + '_v').style.background = '#30a050';
            break;
        case 4://out v
            document.getElementById('tm_'+name + '_v').style.background = '#008010';
            break;
    }
}
//=================================================================================================
function tm_telo(nomer_m) {
    name_m = nm + '_' + (nr-1) + '_' + np+'_'+nomer_m;    
    return'<span id="tm_'+name_m+'_telo"><span id="tm_'+name_m+'" class="metka" onmouseover="on_tm(1,'+nomer_m+')"onmouseout="on_tm(2,'+nomer_m+')"onmousedown="tm_telos(1,'+nomer_m+')">' +ar_tm[nm][nr-1][np][nomer_m]+'</span></span>';
}
//=================================================================================================
function tm_telos(deistvie_ms,nomer_ms) {
    name_ms = nm + '_' + (nr-1) + '_' + np+'_'+nomer_ms;    
    if(deistvie_ms==0)
    {
        if(metka_on)  {
            ti_telos(0,pamyt_interes);
            event.returnValue = false;
            ten_metka.style.visibility=metka_div.style.visibility=metka_treug.style.visibility='hidden';
            metka_on=false;
            metka_chet=0;
            document.getElementById('tm_'+name_ms+'_telo').innerHTML='<span id="tm_'+name_ms+'" class="metka" onmouseover="on_tm(1,'+nomer_ms+')"onmouseout="on_tm(2,'+nomer_ms+')"onmousedown="tm_telos(1,'+nomer_ms+')">' +ar_tm[nm][nr-1][np][nomer_ms]+'</span>';
        }
    }
    else{
        document.getElementById('tm_'+name_ms+'_telo').innerHTML='<span id="tm_'+name_ms+'_v"class="metka_v" onmouseover="on_tm(3,'+nomer_ms+')"onmouseout="on_tm(4,'+nomer_ms+')"onmousedown="tm_telos(0,'+nomer_ms+')">'+ar_tm[nm][nr-1][np][nomer_ms]+'</span>';
        ten_metka.style.visibility=metka_div.style.visibility=metka_treug.style.visibility='visible';
        metka_treug.style.top=scrollY+event.clientY+2+'px';
        metka_treug.style.left=event.clientX-10+'px';
        metka_div.innerHTML=on_tm_t(nomer_ms);
        if(metka_div.clientWidth>=osnova.clientWidth-50){
            metka_div.style.left='70px';
            metka_div.style.right='70px';
        }
        metka_div.style.top=scrollY+event.clientY+20+'px';
        ten_metka.style.top=metka_div.style.top;
        ten_metka.style.left=metka_div.style.left;
        ten_metka.style.width=metka_div.clientWidth+5+'px';
        ten_metka.style.height=metka_div.clientHeight+5+'px';
        metka_left=metka_div.style.top.slice(0, metka_div.style.top.length - 2) - 0;
        metka_on=true;
        metka_chet=0;
        nomer_metki_pamyt=nomer_ms;
        pamyt_metka=nomer_ms;
        ti_telos(0,pamyt_interes);
    }
    up();
}
//=================================================================================================
//=================================================================================================
//=================================================================================================
function on_ti(deistvie, nomer) {
name=nm+'_'+(nr-1)+'_'+np+'_'+nomer;  
idnom = document.getElementById('ti_'+name);
    switch (deistvie) {
        case 1://over
            idnom.style.background = '#ffe060';
            idnom.style.color = '#804020';
            break;
        case 2://out
            idnom.style.background = '#fff040';
            idnom.style.color = 'black';
            break;
        case 3://over v
            document.getElementById('ti_'+name  + '_v').style.background = '#ffd040';
            break;
        case 4://out v
            document.getElementById('ti_'+name + '_v').style.background = '#ffe060';
            break;
    }
}
//=================================================================================================
function ti_telo(nomer_i) {
    name_i = nm + '_' + (nr-1) + '_' + np+'_'+nomer_i;    
    return '<span id="ti_'+name_i+'_telo"><span id="ti_'+name_i+'" class="interes" onmouseover="on_ti(1,'+nomer_i+')"onmouseout="on_ti(2,'+nomer_i+')"onmousedown="ti_telos(1,'+nomer_i+')">' +ar_ti[nm][nr-1][np][nomer_i]+'</span></span>';    
}
//=================================================================================================
function ti_telos(deistvie_is,nomer_is) {
    name_is = nm + '_' + (nr-1) + '_' + np+'_'+nomer_is;    
    if(deistvie_is==0){
        if(interes_on){
            ten_interes.style.visibility=interes_div.style.visibility=interes_treug.style.visibility='hidden';
            interes_on=false;
            interes_chet=0;
            document.getElementById('ti_'+name_is+'_telo').innerHTML='<span id="ti_'+name_is+'" class="interes" onmouseover="on_ti(1,'+nomer_is+')"onmouseout="on_ti(2,'+nomer_is+')"onmousedown="ti_telos(1,'+nomer_is+')">' +ar_ti[nm][nr-1][np][nomer_is]+'</span>';
            event.returnValue = false;
        }
    }else{
        document.getElementById('ti_'+name_is+'_telo').innerHTML='<span id="ti_'+name_is+'_v"class="interes_v" onmouseover="on_ti(3,'+nomer_is+')"onmouseout="on_ti(4,'+nomer_is+')"onmousedown="ti_telos(0,'+nomer_is+')">'+ar_ti[nm][nr-1][np][nomer_is]+'</span>';
        ten_interes.style.visibility=interes_div.style.visibility=interes_treug.style.visibility='visible';
        interes_treug.style.top=scrollY+event.clientY+2+'px';
        interes_treug.style.left=event.clientX-10+'px';
        interes_div.innerHTML=on_ti_t(nomer_is);
        if(interes_div.clientWidth>=osnova.clientWidth-50){
            interes_div.style.left='100px';
            interes_div.style.right='100px';
        }

        interes_div.style.top=scrollY+event.clientY+20+'px';
        ten_interes.style.top=interes_div.style.top;
        ten_interes.style.left=interes_div.style.left;
        ten_interes.style.width=interes_div.clientWidth+5+'px';
        ten_interes.style.height=interes_div.clientHeight+5+'px';
        interes_left=interes_div.style.top.slice(0, metka_div.style.top.length - 2) - 0;
        interes_chet=0;
        interes_on=true;
        nomer_interesa_pamyt=nomer_is;
        pamyt_interes=nomer_is;
        tm_telos(0,pamyt_metka);
    }
    up();
}
//=================================================================================================
//=================================================================================================
//=================================================================================================
function all_control(deistvie) {

    if (m_g_0.style.visibility == 'visible' || m_y_0.style.visibility == 'visible' || m_os_0.style.visibility == 'visible' || m_s_0.style.visibility == 'visible') {
        if (m_g_0.style.visibility == 'visible') menu_(3, 1, 0);
        if (m_y_0.style.visibility == 'visible') menu_(3, 1, 1);
        if (m_os_0.style.visibility == 'visible') menu_(3, 1, 2);
        if (m_s_0.style.visibility == 'visible') menu_(3, 1, 3);
    } else {
        switch (deistvie) {
            //---------------------------------------------------------------------------------------------
            case 2://keydown
            if(form_text_aktiv){
                bob.innerHTML='yra';// key.keypress
            }
            break;
            //---------------------------------------------------------------------------------------------
            case 3://move
                if (event.clientX < osnova.clientWidth - okna.clientWidth) panel_izmen(5);
                if (peremeshenie_okon_down) {
                    if (event.clientX < soderg_razdela_1.clientWidth - 30) {
                        perem = soderg_razdela_1.clientWidth - 95;
                        //stranica.style.width = ten_stranici.style.width = perem + 'px';
                        dvigenie_paneli.style.left = perem + 50 + 'px';
                        okna.style.left = perem + 60 + 'px';

                        okna.style.width = osnova.clientWidth - perem - 60 + 'px';
                       
                        okno_besedi.style.width = okno_novosti.style.width = okno_zametki.style.width = okna.clientWidth - 30 + 'px';
                    } else {

                        if (event.clientX > osnova.clientWidth - 20) {
                            okna.style.left = osnova.clientWidth - 20 + 'px';
                            okna.style.width = '20px';
                            dvigenie_paneli.style.left = osnova.clientWidth - 30 + 'px';
                            //ten_stranici.style.width = stranica.style.width = osnova.clientWidth - stranica_left + 'px';

                        }
                        else {
                            if (event.clientX > osnova.clientWidth - 130) {
                                peremeshenie_okon_svernut = true;
                            }

                            okna.style.width = osnova.clientWidth - event.clientX + 'px';
                            okna.style.left = osnova.clientWidth - okna.clientWidth + 'px';
                            dvigenie_paneli.style.left = osnova.clientWidth - okna.clientWidth - 10 + 'px';

                            if (event.clientX < osnova.clientWidth - 150) {
                                okno_besedi.style.width = okno_novosti.style.width = okno_zametki.style.width = okna.clientWidth - 30 + 'px';
                            }
                        }
                    }
                   // stranica.style.width = ten_stranici.style.width = osnova.clientWidth - okna.clientWidth - stranica_left - 10 + 'px';
                   ten_kn_nazad.style.left=kn_nazad.style.left=osnova.clientWidth- okna.clientWidth -30+'px'; 
                   ok_r=okna.clientWidth; 
                   localStorage.setItem('ok_r',ok_r);
                }
                //---------------------------------------------------------------------------------------------
                break;
            //---------------------------------------------------------------------------------------------
            case 4://down
                    if (kn_prydki_start == false) {
                        if (kn_prydki_skrita && event.clientX < 162 && event.clientY > innerHeight - 30) {
                            ten_kn_prydki.style.visibility = kn_prydki.style.visibility = 'visible';
                            kn_prydki_skrita = false;
                        } else {
                            ten_kn_prydki.style.visibility = kn_prydki.style.visibility = 'hidden';
                            kn_prydki_skrita = true;
                        }
                    }
                if(metka_on){
                    
                    
                }
                break;
            //---------------------------------------------------------------------------------------------
            case 5://up
                //if (peremeshenie_okon_down)
                 kn_dvig_panel(5);
                   

                break;
            //-----------------------------------------------------------------------------------------
        }
    }
}
//=================================================================================================
function okno_izmen(idnomer, deistvie) {
    switch (deistvie) {
        case 3://move
            if (event.clientX > osnova.clientWidth - okno_besedi.clientWidth && event.clientX < osnova.clientWidth - 10 && idnomer == 0 && event.clientY > okb + okno_besedi.clientHeight - 5) okno_besedi.style.cursor = 'ns-resize';
            else okno_besedi.style.cursor = 'default';
            if (event.clientX > osnova.clientWidth - okno_besedi.clientWidth && event.clientX < osnova.clientWidth - 10 && idnomer == 1 && event.clientY > okn + okno_novosti.clientHeight - 5) okno_novosti.style.cursor = 'ns-resize';
            else okno_novosti.style.cursor = 'default';
            if (event.clientX > osnova.clientWidth - okno_besedi.clientWidth && event.clientX < osnova.clientWidth - 10 && idnomer == 2 && event.clientY > okz + okno_zametki.clientHeight - 5) okno_zametki.style.cursor = 'ns-resize';
            else okno_zametki.style.cursor = 'default';
            if (deform_okno_besedi_down) panel_izmen(3);
            if (deform_okno_novosti_down) panel_izmen(3);
            if (deform_okno_zametki_down) panel_izmen(3);
    
            break;
        case 4://down
            panel_izmen(4);
            break;
        case 5://up
            panel_izmen(5);
            break;
    }
}
//=================================================================================================
function panel_izmen(deistvie) {
    switch (deistvie) {

        case 3://move
            if (event.clientX > osnova.clientWidth - okno_besedi.clientWidth && event.clientX < osnova.clientWidth - 10 &&
                okno_besedi.style.visibility == 'visible' && ((event.clientY > okb - scrollY + okno_besedi.clientHeight - 5 && event.clientY < okb - scrollY + okno_besedi.clientHeight + 5) ||
                    (event.clientY > okn - scrollY + okno_novosti.clientHeight - 5 && event.clientY < okn - scrollY + okno_novosti.clientHeight + 5) ||
                    (event.clientY > okz - scrollY + okno_zametki.clientHeight - 5 && event.clientY < okz - scrollY + okno_zametki.clientHeight + 5))) okna.style.cursor = 'ns-resize';
            else okna.style.cursor = 'default';
            if (deform_okno_besedi_down) {

                if (event.clientY - okb + scrollY < okgran) okno_besedi.style.height = okgran + 'px';
                else {
                    if (event.clientY - okb + scrollY > innerHeight + scrollY - okno_top - okno_novosti.clientHeight - okno_zametki.clientHeight - 30) okno_besedi.style.height = innerHeight + scrollY - okno_top - okno_novosti.clientHeight - okno_zametki.clientHeight - 30 + 'px';
                    else okno_besedi.style.height = event.clientY - okb + scrollY + 'px';
                }
                okn = okb + okno_besedi.clientHeight + 10;
                okno_novosti.style.top = okn + 'px';
                okz = okn + okno_novosti.clientHeight + 10;
                okno_zametki.style.top = okz + 'px';
            } else if (deform_okno_novosti_down) {
                if (event.clientY - okn + scrollY < okgran) okno_novosti.style.height = okgran + 'px';
                else {
                    if (event.clientY - okn + scrollY > innerHeight + scrollY - okno_top - okno_besedi.clientHeight - okno_zametki.clientHeight - 30) okno_novosti.style.height = innerHeight + scrollY - okno_top - okno_besedi.clientHeight - okno_zametki.clientHeight - 30 + 'px';
                    else okno_novosti.style.height = event.clientY - okn + scrollY + 'px';
                }
                okz = okn + okno_novosti.clientHeight + 10;
                okno_zametki.style.top = okz + 'px';
            } else if (deform_okno_zametki_down) {
                if (event.clientY - okz + scrollY < okgran) okno_zametki.style.height = okgran + 'px';
                else {
                    if (event.clientY - okz + scrollY > innerHeight + scrollY - okno_top - okno_besedi.clientHeight - okno_novosti.clientHeight - 30) okno_zametki.style.height = innerHeight + scrollY - okno_top - okno_besedi.clientHeight - okno_novosti.clientHeight - 30 + 'px';
                    else okno_zametki.style.height = event.clientY - okz + scrollY + 'px';
                }
            }
    
            break;
        case 4://down
            if (event.clientX > osnova.clientWidth - okno_besedi.clientWidth && event.clientX < osnova.clientWidth - 10) {
                if (event.clientY > okb - scrollY + okno_besedi.clientHeight - 5 && event.clientY < okb - scrollY + okno_besedi.clientHeight + 5) deform_okno_besedi_down = true;
                else if (event.clientY > okn - scrollY + okno_novosti.clientHeight - 5 && event.clientY < okn - scrollY + okno_novosti.clientHeight + 5) deform_okno_novosti_down = true;
                else if (event.clientY > okz - scrollY + okno_zametki.clientHeight - 5 && event.clientY < okz - scrollY + okno_zametki.clientHeight + 5) deform_okno_zametki_down = true;
                event.returnValue = false;
    
            }
            break;
        case 5://up

            if (deform_okno_besedi_down) {
                deform_okno_besedi_down = false;
                localStorage.setItem('o_b', okno_besedi.style.height);
            }
            if (deform_okno_novosti_down) {
                deform_okno_novosti_down = false;
                localStorage.setItem('o_n', okno_novosti.style.height);
            }
            if (deform_okno_zametki_down) {
                deform_okno_zametki_down = false;
                localStorage.setItem('o_z', okno_zametki.style.height);
            }
            event.returnValue = true;
            break;
    }
}
//=================================================================================================
function kn_dvig_panel(deistvie) {
    color_kn = '#5080b0';
    color_videl = '#80b0e0';
    switch (deistvie) {
        case 1://over
            dvigenie_paneli.style.backgroundColor = color_videl;
            dvigenie_paneli.style.cursor = 'ew-resize';
            break;
        case 2://out
            dvigenie_paneli.style.backgroundColor = color_kn;
            break;
        case 3://move

            break;
        case 4://douwn
            peremeshenie_okon_down = true;
            peremeshenie_okon_fiksaciy = event.clientX;
            //okna.style.left=okna.offsetLeft+100+'px';
            kn_nazad.style.left=osnova.clientWidth- okna.clientWidth -30+'px';
            event.returnValue = false;
            break;
        case 5://up
            peremeshenie_okon_down = false;
            if (peremeshenie_okon_fiksaciy == event.clientX) {
                dvig_pan_rabota = true;
                setTimeout('dvig_panel()', 50);
                
            }
            
            event.returnValue = true;
            break;
    }
}
//=================================================================================================
function dvig_panel() {
    switch (dvig_pan_variant) {
        case 0:
            dvig_pan_del = okna.clientWidth / 10;
            dvig_pan_index = osnova.clientWidth - okna.clientWidth + dvig_pan_del;
            dvig_pan_variant++;
            okna.style.left = dvig_pan_index + 'px';
            okna.style.width = okna.clientWidth - dvig_pan_del + 'px';
            //ten_stranici.style.width = stranica.style.width = stranica.clientWidth + dvig_pan_del - 5 + 'px';
            dvigenie_paneli.style.left = dvig_pan_index - 10 + 'px';
            ten_kn_nazad.style.left = kn_nazad.style.left = dvig_pan_index - 30 + 'px';
            break;
        case 1:
            if (okna.clientWidth - dvig_pan_del > 20) {
                dvig_pan_index += dvig_pan_del;

                okna.style.left = dvig_pan_index + 'px';
                perem = okna.style.left.slice(0, okna.style.left.length - 2) - 0;
                okna.style.width = osnova.clientWidth - perem + 'px';
                //ten_stranici.style.width = stranica.style.width = perem - stranica_left - 10 + 'px';
                dvigenie_paneli.style.left = dvig_pan_index - 10 + 'px';
                ten_kn_nazad.style.left = kn_nazad.style.left = dvig_pan_index - 30 + 'px';
            } else {
                okna.style.left = osnova.clientWidth - 20 + 'px';
                ok_r=20;
                okna.style.width = '20px';
                dvigenie_paneli.style.left = osnova.clientWidth - 30 + 'px';
                ten_kn_nazad.style.left = kn_nazad.style.left = osnova.clientWidth - 50 + 'px';
                //ten_stranici.style.width = stranica.style.width = osnova.clientWidth - stranica_left - 30 + 'px';
                dvig_pan_rabota = false;
                dvig_pan_variant = 2;
                peremeshenie_okon_svernut = true;
                localStorage.setItem('ok_r',ok_r);
            }


            break;
        case 2:
            dvig_pan_del = 27;
            dvig_pan_index = osnova.clientWidth - 20 - dvig_pan_del;
            dvig_pan_variant++;
            okna.style.left = dvig_pan_index + 'px';
            okna.style.width = osnova.clientWidth - okna.style.left.slice(0, okna.style.left.length - 2) - 0 + 'px';
            //ten_stranici.style.width = stranica.style.width = stranica.clientWidth - dvig_pan_del + 10 + 'px';
            dvigenie_paneli.style.left = dvig_pan_index - 10 + 'px';
            ten_kn_nazad.style.left = kn_nazad.style.left = dvig_pan_index - 30 + 'px';
            break;
        case 3:
            if (okna.clientWidth + dvig_pan_del < 260) {
                dvig_pan_index -= dvig_pan_del;

                okna.style.left = dvig_pan_index + 'px';
                perem = okna.offsetLeft;
                okna.style.width = osnova.clientWidth - perem + 'px';
                okno_besedi.style.width = okno_novosti.style.width = okno_zametki.style.width = okna.clientWidth - 30 + 'px';
              //  ten_stranici.style.width = stranica.style.width = perem - stranica_left - 10 + 'px';
                dvigenie_paneli.style.left = dvig_pan_index - 10 + 'px';
                ten_kn_nazad.style.left = kn_nazad.style.left = dvig_pan_index - 30 + 'px';
            } else {
                okna.style.left = osnova.clientWidth - 270 + 'px';
                okna.style.width = '270px';
                ok_r=270;
                okno_besedi.style.width = okno_novosti.style.width = okno_zametki.style.width = okna.clientWidth - 30 + 'px';
                dvigenie_paneli.style.left = osnova.clientWidth - 280 + 'px';
                ten_kn_nazad.style.left = kn_nazad.style.left = osnova.clientWidth - 300 + 'px';
                //ten_stranici.style.width = stranica.style.width = osnova.clientWidth - stranica_left - 280 + 'px';
                dvig_pan_rabota = false;
                dvig_pan_variant = 0;
                peremeshenie_okon_svernut = false;

                localStorage.setItem('ok_r',ok_r);
            }


            break;
    }
    if (dvig_pan_rabota) setTimeout('dvig_panel()', 50);

}
//=================================================================================================
function top_ok(idnomer) {
    switch (idnomer) {
        //besedi
        case 0: idnomer = okno_besedi.style.top.slice(0, okno_besedi.style.top.length - 2); break;
        //novosti
        case 1: idnomer = okno_novosti.style.top.slice(0, okno_novosti.style.top.length - 2); break;
        //pometki
        case 2: idnomer = okno_zametki.style.top.slice(0, okno_zametki.style.top.length - 2); break;
    }
    idnomer -= 0;
    return idnomer;
}
//=================================================================================================
function kn_okna_videlen(deistvie, idnomer) {
    ne_videl_kn = '#40a0d0';
    videl_kn = '#90e0ff';
    nagatay_kn = '#ffe0a0';
    ne_videl_ris = '#c0ffe0';
    switch (idnomer) {
        case 0: odin_kn = svert_1; odin_dr = svert_1_a; break;
        case 1: odin_kn = svert_2; odin_dr = svert_2_a; break;
        case 2: odin_kn = svert_3; odin_dr = svert_3_a; break;
        case 3: odin_kn = na_meste_1; odin_dr = na_meste_1_a; break;
        case 4: odin_kn = na_meste_2; odin_dr = na_meste_2_a; break;
        case 5: odin_kn = na_meste_3; odin_dr = na_meste_3_a; break;
    }
    switch (deistvie) {
        //-----------------------------------------------------------------------------------------
        case 1://over
            odin_kn.style.backgroundColor = videl_kn;
            odin_dr.style.backgroundColor = ne_videl_kn;
            break;
        //-----------------------------------------------------------------------------------------
        case 2://out
            odin_kn.style.backgroundColor = ne_videl_kn;
            odin_dr.style.backgroundColor = ne_videl_ris;
            break;
        //-----------------------------------------------------------------------------------------
        case 4://down
            okno_svert = 210;

            break;
        //-----------------------------------------------------------------------------------------
    }
}
//=================================================================================================
function kn_na_str(pologenie) {
    kn_stran_nazad.style.top=pologenie+'px';
    pologenie+=kn_stran_nazad.clientHeight+20;
    kn_poisk.style.top=pologenie+'px';
    pologenie+=kn_poisk.clientHeight+20;
    kn_mneniy.style.top=pologenie+'px';
}
//=================================================================================================
function okna_umen() {
    if (innerHeight < okno_top + okno_besedi.clientHeight + okno_novosti.clientHeight + okno_zametki.clientHeight + 30 - scrollY) {
        minus = (okno_top + okno_besedi.clientHeight + okno_novosti.clientHeight + okno_zametki.clientHeight + 30 - innerHeight - scrollY) / ((okno_besedi.clientHeight <= okgran ? 0 : 1) + (okno_novosti.clientHeight <= okgran ? 0 : 1) + (okno_zametki.clientHeight <= okgran ? 0 : 1));
        plus = 0;
        if (okno_besedi.clientHeight > okgran) {
            if (okno_besedi.clientHeight - minus < okgran) {
                plus = okno_besedi + minus - okgran;
                okno_besedi.style.height = okgran + 'px';
            } else okno_besedi.style.height = okno_besedi.clientHeight - minus + 'px';
        }
        if (okno_novosti.clientHeight > okgran) {
            if (okno_novosti.clientHeight - minus < okgran) {
                plus += okno_novosti + minus - okgran;
                okno_novosti.style.height = okgran + 'px';
            } else okno_novosti.style.height = okno_novosti.clientHeight - minus + 'px';
        }
        if (okno_zametki.clientHeight > okgran) {
            if (okno_zametki.clientHeight - minus < okgran) {
                plus += okno_zametki + minus - okgran;
                okno_zametki.style.height = okgran + 'px';
            } else okno_zametki.style.height = okno_zametki.clientHeight - minus + 'px';
        }
        if (plus != 0) plus /= ((okno_besedi.clientHeight <= okgran ? 0 : 1) + (okno_novosti.clientHeight <= okgran ? 0 : 1) + (okno_zametki.clientHeight <= okgran ? 0 : 1));
        if (okno_besedi.clientHeight > okgran) okno_besedi.style.height = okno_besedi.clientHeight - plus + 'px';
        if (okno_novosti.clientHeight > okgran) okno_novosti.style.height = okno_novosti.clientHeight - plus + 'px';
        if (okno_zametki.clientHeight > okgran) okno_zametki.style.height = okno_zametki.clientHeight - plus + 'px';
    }
    okb = okno_top;
    okno_besedi.style.top = okb + 'px';
    okn = okb + okno_besedi.clientHeight + 10;
    okno_novosti.style.top = okn + 'px';
    okz = okn + okno_novosti.clientHeight + 10;
    okno_zametki.style.top = okz + 'px';
}
//=================================================================================================
function okna_uvel() {
    if (innerHeight > okno_top + okno_besedi.clientHeight + okno_novosti.clientHeight + okno_zametki.clientHeight + 30 - scrollY) {
        plus = (innerHeight-okno_top-okno_besedi.clientHeight - okno_novosti.clientHeight - okno_zametki.clientHeight-30+scrollY)/3;
        okno_besedi.style.height = okno_besedi.clientHeight + plus + 'px';
        okno_novosti.style.height = okno_novosti.clientHeight + plus + 'px';
        okno_zametki.style.height = okno_zametki.clientHeight + plus + 'px';
    }
    okb = okno_top;
    okno_besedi.style.top = okb + 'px';
    okn = okb + okno_besedi.clientHeight + 10;
    okno_novosti.style.top = okn + 'px';
    okz = okn + okno_novosti.clientHeight + 10;
    okno_zametki.style.top = okz + 'px';
}

//=================================================================================================
function izmen_win() {

    if (staroe_x != innerWidth) {

        m2_left = m1_left + m_g.clientWidth + m_razdelitel.clientWidth + 4;
        m3_left = m2_left + m_y.clientWidth + m_razdelitel.clientWidth + 4;
        m4_left = m3_left + m_os.clientWidth + m_razdelitel.clientWidth + 4;
        ms[1][2] = m2_left;
        ms[2][2] = m3_left;
        ms[3][2] = m4_left;
        //--------------------------------
        m_y_0.style.left = m2_left + 'px';
        m_os_0.style.left = m3_left + 'px';
        m_s_0.style.left = m4_left + 'px';
        if (m_g_0.clientWidth <= m_g.clientWidth) m_g_0.style.width = m_g.clientWidth + 10 + 'px';
        else if (m_g_0.clientWidth > menu_width) m_g_0.style.width = menu_width + 'px';
        if (m_y_0.clientWidth <= m_y.clientWidth) m_y_0.style.width = m_y.clientWidth + 10 + 'px';
        else if (m_y_0.clientWidth > menu_width) m_y_0.style.width = menu_width + 'px';
        if (m_os_0.clientWidth <= m_os.clientWidth) m_os_0.style.width = m_os.clientWidth + 10 + 'px';
        else if (m_os_0.clientWidth > menu_width) m_os_0.style.width = menu_width + 'px';
        if (m_s_0.clientWidth <= m_s.clientWidth) m_s_0.style.width = m_s.clientWidth + 10 + 'px';
        else if (m_s_0.clientWidth > menu_width) m_s_0.style.width = menu_width + 'px';
        //-----------------------------------------------------------------------------------

        stranica.style.width = (osnova.clientWidth/100)*60 + 'px';
        gl_p.style.width=(osnova.clientWidth/100)*55+'px';
        switch(dz){
            case 1:ten1_gl_p.style.width=gl_p.clientWidth+2+'px';break;
            default:
                ten1_gl_p.style.width=ten2_gl_p.style.width=gl_p.clientWidth+2+'px';
                kn_za_str.style.left=gl_p.clientWidth-70+'px';
            break;
        }
        ten_vibronogo_p.style.width=gl_p.clientWidth+20+'px';
        ogl_vibrono_copiy.style.width=gl_p.clientWidth-15+'px';
        
        for(ii=0;ii<array_razd_p[nm][nr-1].length;ii++){
            pp=document.getElementById('p_'+ii);
            
             pph=pp.clientHeight;

            pp.style.width=gl_p.clientWidth-44+'px';
            //if(pp.clientHeight!=pph){
                pph=pp.clientHeight-pph;
                iij=array_razd_p[nm][nr-1].length;
                for(ij=ii+1;ij<iij;ij++){
                    if(ogl_vibrono==ij){
                        ijpt=ogl_vibrono_copiy.style.top.slice(0,ogl_vibrono_copiy.style.top.length-2)-0;
                        ogl_vibrono_copiy.style.top=ijpt+pph+'px';
                        ten_vibronogo_p.style.top=ijpt+pph+'px';
                    }
                    
                    ijp=document.getElementById('p_'+ij);
                    ijpt=ijp.style.top.slice(0,ijp.style.top.length-2)-0;
                    ijp.style.top=ijpt+pph+'px';
                    //if(ij==iij-1){
                        ijpt=ijp.style.top.slice(0,ijp.style.top.length-2)-0;
                        gl_p.style.height=ijp.clientHeight+ijpt+15+'px';
                        ten1_gl_p.style.height=ten2_gl_p.style.height=ijp.clientHeight+ijpt+25+'px';
                    //}               
                }
            //}
            ten_vibronogo_p.style.height=ogl_vibrono_copiy.clientHeight+5+'px';
            ppp=document.getElementById('tp_'+ii);
            ppp.style.left=gl_p.clientWidth+1+'px';
            ppp.style.top=pp.style.top;
            ppp.style.height=pp.clientHeight+'px';
        }
        text_stranici.style.paddingTop=gl_p.clientHeight-20+'px';
        //-----------------------------------------------------------------------------------
        ten_stranici.style.width = stranica.clientWidth + 'px';
        
        dvigenie_paneli.style.left = osnova.clientWidth - okna.clientWidth - 10 + 'px';

        ten_kn_nazad.style.left = kn_nazad.style.left = stranica.clientWidth + 105 + 'px';
        okna.style.left = osnova.clientWidth -okna.clientWidth+ 'px';
        //-----------------------------------------------------------------------------------
        staroe_x = innerWidth;
        up();
    }
    if (staroe_y != innerHeight) {
        
        if (staroe_y > innerHeight) {
            okna_umen();
        } else if (innerHeight > 165 + okno_top - scrollY && okno_besedi.style.visibility == 'hidden') {
            if (okno_besedi.clientHeight < 45) okno_besedi.style.height = '45px';
            if (okno_novosti.clientHeight < 45) okno_novosti.style.height = '45px';
            if (okno_zametki.clientHeight < 45) okno_zametki.style.height = '45px';
        }else okna_uvel();
        if (localStorage.getItem('l_p')) {
            if (localStorage.getItem('l_p') == 0) ten_kn_prydki.style.visibility = kn_prydki.style.visibility = 'hidden';
            else ten_kn_prydki.style.visibility = kn_prydki.style.visibility = 'visible';
        } else {
            ten_kn_prydki.style.visibility = kn_prydki.style.visibility = 'hidden'; localStorage.setItem('l_p', 0);
        }
        ten_line_pomoshnik.style.visibility = 'visible';
        line_pomoshnik.style.visibility = 'visible';
        ten_pomoshnika.style.visibility = 'visible';
        pomoshnik.style.visibility = 'visible';

        ten_kn_nazad.style.top = kn_nazad.style.top = innerHeight - 80 + scrollY + 'px';
        line_pomoshnik.style.top = innerHeight - 73 + 'px';
        ten_line_pomoshnik.style.top = innerHeight - 61 + 'px';
        pomoshnik_go(0);
                
        ten_kn_prydki.style.top = innerHeight - 60 + 'px';
        kn_prydki.style.top = innerHeight - 64 + 'px';
        staroe_y = innerHeight;
        up();
    }
    
    if (scrollY) 
    {

        if (scrollY > 100 && kn_nazad_vidna == false) {
            kn_nazad_vidna = true;
            ten_kn_nazad.style.visibility = kn_nazad.style.visibility = 'visible';
        }
        if(shporgalki_id!=0&&scrollY>40){
            shporgalki.style.top=scrollY+20+'px';
        }
        if (kn_nazad_vidna) ten_kn_nazad.style.top = kn_nazad.style.top = innerHeight-100 + scrollY + 'px';
        ten_kn_nazad.style.left=kn_nazad.style.left=osnova.clientWidth-okna.clientWidth-30+'px';        
       if(odin_na_stranice){
           if(250<scrollY){
           //kn_na_str(50+scrollY);
           }else{
               //kn_na_str(300);
           }
       }else{
       if(170+gl_p.clientHeight<scrollY){ 
       //kn_na_str(50+scrollY);
       }
       else{
       //kn_na_str(gl_p.clientHeight+230);
       }}

        line_pomoshnik.style.top = innerHeight - 73 + scrollY + 'px';
        ten_line_pomoshnik.style.top = innerHeight - 60 + scrollY + 'px';
        
        pomoshnik.style.left='40px';
        pomoshnik_go(0);

        ten_kn_prydki.style.top = innerHeight - 60 + scrollY + 'px';
        kn_prydki.style.top = innerHeight - 64 + scrollY + 'px';
        ten_stranici.style.height = stranica.clientHeight + 'px';
        okna.style.height = osnova.clientHeight + 'px';

        if (scrollY > 150) {
            okno_top = 60 + scrollY;
            dvigenie_paneli.style.top = okno_top - 50 + 'px';
            okb = okno_top;
            okno_besedi.style.top = okb + 'px';
            okn = okb + okno_besedi.clientHeight + 10;
            okno_novosti.style.top = okn + 'px';
            okz = okn + okno_novosti.clientHeight + 10;
            okno_zametki.style.top = okz + 'px';
        } else {
            okno_top = 210;
            dvigenie_paneli.style.top = okno_top - 60 + 'px';
            okna_umen();
        }
        if (localStorage.getItem('l_p')) {
            if (localStorage.getItem('l_p') == 0) ten_kn_prydki.style.visibility = kn_prydki.style.visibility = 'hidden';
            else ten_kn_prydki.style.visibility = kn_prydki.style.visibility = 'visible';
        } else {
            ten_kn_prydki.style.visibility = kn_prydki.style.visibility = 'hidden'; localStorage.setItem('l_p', 0);
        }
        ten_line_pomoshnik.style.visibility = 'visible';
        line_pomoshnik.style.visibility = 'visible';
        ten_pomoshnika.style.visibility = 'visible';
        pomoshnik.style.visibility = 'visible';

        posle_scroll = true;
    } else if (posle_scroll && scrollY < 2) {
//if(odin_na_stranice) kn_na_str(300);else kn_na_str(gl_p.clientHeight+230);
posle_scroll = false;
        kn_nazad_vidna = false;
        ten_kn_nazad.style.visibility = kn_nazad.style.visibility = 'hidden';
        ten_kn_prydki.style.top = innerHeight - 60 + scrollY + 'px';
        kn_prydki.style.top = innerHeight - 64 + scrollY + 'px';

        line_pomoshnik.style.top = innerHeight - 73 + 'px';
        ten_line_pomoshnik.style.top = innerHeight - 60 + 'px';

        //sleva
        pomoshnik_go(0);
    
        menu_line.style.height = '45px';
 
        okno_top = 210;
        okna.style.top = menu.style.top = '0px';
        m_g_0.style.top = m_y_0.style.top = m_os_0.style.top = m_s_0.style.top = '40px';
        ten_m.style.top = '60px';
        ten_menu.style.top = '55px';
        name_sait1.style.top = name_sait1_teni.style.top = '60px';
        name_sait2.style.top = name_sait2_teni.style.top = '120px';
        dvigenie_paneli.style.top = '160px';
        okno_besedi.style.top = '210px';
        okno_novosti.style.top = okno_top + okno_besedi.clientHeight + 10 + scrollY + 'px';
        okno_zametki.style.top = okno_top + okno_besedi.clientHeight + okno_novosti.clientHeight + 20 + scrollY + 'px';
        if (localStorage.getItem('l_p')) {
            if (localStorage.getItem('l_p') == 0) ten_kn_prydki.style.visibility = kn_prydki.style.visibility = 'hidden';
            else ten_kn_prydki.style.visibility = kn_prydki.style.visibility = 'visible';
        } else { ten_kn_prydki.style.visibility = kn_prydki.style.visibility = 'hidden'; localStorage.setItem('l_p', 0); }
        ten_line_pomoshnik.style.visibility = 'visible';
        line_pomoshnik.style.visibility = 'visible';
        ten_pomoshnika.style.visibility = 'visible';
        pomoshnik.style.visibility = 'visible';

    }
    setTimeout('izmen_win()', 4);
   //  bb=event.srcElement;
}
//=================================================================================================
